{
  "data": [
    {
      "hadith": [
        {
          "body": "Bintal-Harith b.al-Nu'man said:I memorized Surahal-Qaf from the mouth of the Messenger of Allah (saws); he would recite it in his speech on every friday. Our oven and his oven were same.Abu Dawud said: Rawh b. 'Ubadah reported on the authority of Shu'bah the nameBintHarithah b.al-Nu'man ; and Ibn Ishaq reported the name of Umm Hisham hint Harithah b.al-Nu'man."
        },
        {
          "body": "Narrated Qasim bin Muhammad and Sulaiman bin Yasar:that Yahya bin Sa`id binAl-`As divorced the daughter of `Abdur-Rahman binAl-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to Marwan binAl-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-Rahman binAl-Hakam did not obey me (or had a convincing \nargument).\" (InAl-Qasim's versions Marwan said, \"Have you not heard of the case of FatimabintQais?\" Aisha said, \"The case of FatimabintQais is not in your favor.' Marwan binAl-Hakam said to \n`Aisha, \"The reason that made FatimabintQais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of AsmabintAbi Bakr as-Siddiq.\"20.7 Wearing\nPerfume during Hajj."
        },
        {
          "body": "Narrated FatimabintAl-Mundhir:Whenever a lady suffering from fever was brought to Asma'bintAbu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order \nus to abate fever with water.\""
        },
        {
          "body": "Yahya related to me from Malik from Nafi that SafiyyabintAbi\nUbayd told him that Hafsa, ummal-muminin, sent Asim ibn Abdullah ibn\nSad to her sister FatimabintUmar ibnal-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir told him that she used to see AsmabintAbi Bakrat\nMuzdalifa telling whoever led the subh prayer for her and her\ncompanions to pray it as soon as the dawn broke, after which she would\nmount and go to Mina without stopping at all."
        },
        {
          "body": "This hadith has been narrated on the authority of Ibn 'Aun and the name of Juwairiyabintal-Harith was mentioned beyond any doubt."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from Fatimabintal-Mundhir that whenever a woman who had a fever, was brought to\nAsmabintAbi Bakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\""
        },
        {
          "body": "Narrated UmAl-FadlbintAl-Harith:I heard the Prophet reciting Surat-al-Mursalat `Urfan (77) in the Maghrib prayer, and after that prayer \nhe did not lead us in any prayer till he died."
        },
        {
          "body": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah married MaimunahbintAl-Harith when he was a Muhrim.\" According to the Hadith of Ya'la (one of the narrators): \"In Sarif.\""
        },
        {
          "body": "It was narrated from Anas that UmmAl-FadlbintAl-Harith said:\" The Messenger of Allah (SAW) led us in praying maghrib in his house and he recitedAl-Mursalat, then after that, he never offered any prayer until he died.\""
        },
        {
          "body": "It was narrated that Umm HaimbintWadda'Al-Khuza'iyyah said:\"I heard the Messenger of Allah (saas) say: 'The supplication of a father reaches the Veil (i.e. the place of repentance).'\""
        },
        {
          "body": "Narrated Asma'bintYazid bin As-SakanAl-Ansariyyah:\"The sleeves of (the shirt) of the Messenger of Allah (saws) were to the wrist.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib."
        },
        {
          "body": "(Another chain) from Umm AmarahbintKa'bAl-Ansari:From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\""
        },
        {
          "body": "Aishah narrated from JudamahbintWahbAl-Asadiyyah that she heard the Messenger of Allah (S.A.W) saying:\"I intended to prohibitAl-Ghilah until I remembered that the Persians and Romans do that, without any harm to their children.\""
        },
        {
          "body": "Narrated Anas [may Allah be pleased with him]:that the Prophet (SAW) said: \"Sufficient for you among the women of mankind are Mariambint'Imran, KhadijahbintKhuwailid, FatimahbintMuhammad and Asiyah the wife of Fir'awn.\""
        },
        {
          "body": "Narrated MaimunabintAl-Harith:My bed was beside the praying place (Musalla) of the Prophet and sometimes his garment fell on me \nwhile I used to lie in my bed."
        },
        {
          "body": "It was narrated that:that Abu Sa'eedAl-Khudri said: “The Messenger of Allah said: 'There is no Sadaqah on any less then five camels, or for four. If the number of camels reaches five then one sheep must be given, up to nine. If the number reaches ten, then two sheep must be given, up to fourteen. If the number reaches fifteen, then three sheep must be given, up to nineteen. If the number reaches twenty, then four sheep must be given, up to twenty-four. If the number reaches twenty-five, then aBintMakhad (a one year old she-camel), must be given up to thirty-five; if there is notBintMakhad, then a Bin Labun (a two-year-old male camel). If there are more camels then aBintLabun (a two-year-old she-camel) up to forty-five. If there are more camels then a Hiqqah (a three-year-old she-camel) must be given up to sixty. If there are more camels then a Jadha'ah (a five-year-old she-camel) must be given up to seventy-five. If there are more camels, then twoBintLabun must be given, up to ninety. If there are more camels, then two Hiqqah must be given, up to one hundred and twenty. The for each fifty, one Hiqqah, and for each forty, aBintLabun.' ”"
        },
        {
          "body": "FatimahbintQais narrated that :she asked -or, the Prophet was asked - about Zakat, and he said: \"Indeed there is a duty on wealthy aside from Zakat.\" Then he recited this Ayah which is inAl-Baqarah: 'It is notAl-Birr (piety, righteousness) that you turn your faces.' (Al-Baqarah 2:177)"
        },
        {
          "body": "Asma'bintAbu Bakr (May Allah be pleased with her) reported:Messenger of Allah (PBUH) said to me, \"Do not hoard; otherwise, Allah will withhold from you.\"[Al-Bukhari and Muslim]."
        },
        {
          "body": "AR-RubayyibintMu'awwidh binAl-Afra narrated:that she got a Khul during the time of the Prophet. So the Prophet ordered her - or: she was ordered - that she observe an Iddah of a menstruation.\""
        },
        {
          "body": "Yahya related. to me from Malik from Yahya ibn Said that AmrabintAbd ar-Rahman told him from HabibabintSahlal-Ansari that she\nhad been the wife of Thabit ibn Qays ibn Shammas. The Messenger of\nAllah, may Allah bless him and grant him peace, went out for the dawn\nprayer, and found HabibabintSahl at his door in the darkness. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nher, \"Who is this?\" She said, \"I am HabibabintSahl, Messenger of\nAllah.\" He said, \"What do you want?\" She said, \"That Thabit ibn Qays\nand I separate.\" When her husband, Thabit ibn Qays came, the Messenger\nof Allah, may Allah bless him and grant him peace, said to him, \"This\nis HabibabintSahl. She mentioned what Allah willed that she\nmention.\" Habiba said, \"Messenger of Allah, all that he has given me\nis with me!\" The Messenger of Allah, may Allah bless him and grant him\npeace, said to Thabit ibn Qays, \"Take it from her,\" and he took it\nfrom her, and she stayed in the house of her family."
        },
        {
          "body": "Narrated BusrabintSafwan (rad):Allah’s Messenger (saw) said, “He who touches his penis should perform ablution”. [Reported byAl-Khamsa, and At-Tirmidhi and Ibn Hibban graded it Sahih (sound)."
        },
        {
          "body": "Narrated KhansabintKhidamAl-Ansariya:that her father gave her in marriage when she was a matron and she disliked that marriage. So she \nwent to Allah's Apostle and he declared that marriage invalid."
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said that AtikabintZayd ibn Amr ibn Nufayl, the wife of Umar ibnal-Khattab, used to\nkiss Umar ibnal-Khattab's head while he was fasting, and he did not\ntell her not to."
        },
        {
          "body": "FatimabintQais (Allah be pleased with her) reported that she had been married to Abu 'Amr b. Hafs b.al-Mughira and he divorced her with three pronouncements. She stated that she went to Allah's Messenger (may peace be upon him) asking him about abandoning that house. He commanded her to move to the house of Ibn Umm Maktum, the blind. Marwan refused to testify the divorced woman abandoning her house (before the 'Idda was over). 'Urwa said that 'A'isha objected to (the words of) FatimabintQais."
        },
        {
          "body": "Umm Sa'idbintMurraal-Fihri related from her father that the Prophet,\nmay Allah bless him and grant him peace, said, \"I and the guardian of an\norphan will be in the Garden like these two.\" (His two fingers)"
        },
        {
          "body": "Khaulahbint'Thamir (May Allah bepleased with her) reported:Messenger of Allah (PBUH) said, \"Many people misappropriate (acquire wrongfully) Allah's Property (meaning Muslims' property). These people will be cast in Hell on the Day of Resurrection\".[Al- Bukhari]."
        },
        {
          "body": "Yahya related to me from Muhammad ibn alMunkadir that Rabia ibn\nAbdullah ibn alHadir told him that he had seen Umar ibnal-Khattab\nleading people in front of the bier at the funeral of ZaynabbintJahsh."
        },
        {
          "body": "Anas bin Malik narrated that:Abu Bakr Siddiq wrote to him: “In the name of Allah, the Most Gracious, the Most Merciful. This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah. The ages of camels to be given (in Zakat) may be made up in sheep. So if a man has camels on which the Sadaqah is a Jadha'ah (a four-year-old she-camel) and he does not have a Jadha'ah but he has a Hiqqah (a three year old she-camel), then the Hiqqah should be accepted from him, and two sheep should be given (in addition), if they are readily available, or twenty Dirham. If a man has camels on which the Sadaqah is a Hiqqah, and he only has a Bin Labun( a two-year-old she-camel), then theBintLabun should be accepted from him, along with two sheep or twenty Dirhams.If a man has camels on which the sadaqah is aBintLabun, and he does not have one, but he has a Hiqqah, then it should be accepted from him, and the Zakat collector should give him back twenty Dirham or two sheep. If a man has camels on which Sadaqah is aBintLabun, and he does not have one, but he has aBintMakhad(a one-year-old she-camel), then theBintMakhad should be accepted from him, along with twenty Dirham or two sheep. If a man has camels on which the Sadaqah is aBintMakhad, and he does not have one, but he has aBintLabun, then theBintLabun should be accepted from him, and the Zakat collector should give him back twenty Dirhams or two sheep. Whoever does not have aBintMakhad, but he has aBintLabun (a two-year-old male camel), then it should be accepted from him and nothing else should be given along with it.' ”"
        },
        {
          "body": "JudamabintWahbal-Asadiyya (Allah be pleased with her) reported:I heard Allah's Messenger (may peace be upon him) saying this. The rest of the hadith is the same concerning 'azl and ghila (cohabitating with a suckling woman), but with a slight variation of words."
        },
        {
          "body": "In Mas'ud said:\"The Messenger of Allah ruled that the Diyah for accidental killing is twentyBintMakhad, twenty Bin Makhad, twentyBintLabur, twenty Jadh'ah, and twenty Hiqqah.\""
        },
        {
          "body": "Narrated 'Ali bin Abi Talib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "Narrated UmAl-FadlbintAl-Harith:\"While the people were with me on the day of `Arafat they differed as to whether the Prophet was \nfasting or not; some said that he was fasting while others said that he was not fasting. So, I sent to him \na bowl full of milk while he was riding over his camel and he drank it.\""
        },
        {
          "body": "Narrated Khansa'bintKhidamAl-Ansariya:That her father gave her in marriage when she was a matron and she disliked that marriage. So she \ncame and (complained) to the Prophets and he declared that marriage invalid. (See Hadith No. 69, \nVol. 7)"
        },
        {
          "body": "It was narrated that Abu Bakr bin Abu Jahm bin SukhairAl-'Adawi said:\"I heard FatimahbintQais say that her husband divorced her ttree times, and the Messenger of Allah (SAW) did not say that she was entitled to accommodation and maintenance.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from his father from AmrabintAbd ar-Rahman that A'isha ummal-\nmuminin said to the Messenger of Allah, may Allah bless him and grant\nhim peace, \"Messenger of Allah, SafiyyabintHuyy has begun her\nperiod,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Perhaps she will delay us. Has she done tawaf of the\nHouse with you?\" They said, \"Of course.\" He said, \"So you are free to\nleave.\""
        },
        {
          "body": "Narrated UmAl-FadlbintAlHarith:On the day of `Arafat, some people who were with me, differed about the fasting of the Prophet \n(p.b.u.h) some said that he was fasting while others said that he was not fasting. So I sent a bowl full \nof milk to him while he was riding his camel, and he drank that milk."
        },
        {
          "body": "Furai'ahbintMalik, the sister of Abu Sa'eedAl-Khudri, said:\"My husband died inAl-Qadum, so I went to the Prophet and told him that our house was remote.\" He gave her permission then he called her back and said: \"Stay in your house for four months and ten days, until the term prescribed is fulfilled.\""
        },
        {
          "body": "Narrated `Amr binAl-Harith:(The brother of the wife of Allah's Apostle. JuwairabintAl-Harith) When Allah's Apostle died, he did \nnot leave any Dirham or Dinar (i.e. money), a slave or a slave woman or anything else except his \nwhite mule, his arms and a piece of land which he had given in charity ."
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Said ibnal-Musayyab that AsmabintUmays gave birth to Muhammad ibn Abi Bakr\nat Dhu'l-Hulayfa and Abu Bakr told her to do ghusl and then enter\nihram."
        },
        {
          "body": "Maimunahbintal-Harith reported :the Messenger of Allah (may peace be upon him) used to pray while. I was by his side in the state of menstruation. Sometime his cloth would touch me when he prostrated. He would pray on a small mat."
        },
        {
          "body": "It was narrated that HunaidahbintSharik bin Aban said:\"I met 'Aishah, may Allah be pleased with her, inAl-Khuraibah, and I asked her about the dregs and she forbade them to me and she said: 'Soak (the fruit) at night and drink it in the morning, and tie the vessel closed.' And she forbade me from using Ad-Dubba' (gourds), An-Naqir,Al-Muzaffat, andAl-Hantam.\""
        },
        {
          "body": "Narrated `Aisha:SafiyabintHuyay, the wife of the Prophet got her menses, and Allah's Apostle was informed of that. \nHe said, \"Would she delay us?\" The people said, \"She has already performed Tawaf-al-Ifada.\" He \nsaid, \"Therefore she will not (delay us).\""
        },
        {
          "body": "FatimahbintQais narrated that Abu 'Amr bin HafsAl-Makhzumi divorced her thrice. Khalid binAl-Walid went with a group of (the tribe of) Makhzum to the Messenger of Allah and said:\"O Messenger of Allah! Abu 'Amr bin Hafs has divorced Fatimah thrice, is she entitled to provision?\" He said: \"She is not entitled to provision nor shelter.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from Fatimabintal-Mundhir ibn az-Zubayr that AsmabintAbu\nBakr as-Siddiq said, \"A woman questioned the Messenger of Allah, may\nAllah bless him and grant him peace, saying, 'If menstrual blood gets\nonto our clothes how do you think we should deal with it?' The\nMessenger of Allah, may Allah bless him and grant him peace, said, 'If\nmenstrual blood gets onto your clothes you should wash them, and\nsprinkle them with water before you pray in them.' \""
        },
        {
          "body": "Narrated Ibn Mas'ud:\"The Messenger of Allah (saws) judged for the accidental blood-Money: TwentyBintMakhad, twenty make Ibn Makhad, twentyBintLabunm twenty Jadha'ah, and twenty Hiqqah.\n\n(Another chain) with similar meaning."
        },
        {
          "body": "It was narrated that Abu Qatadah said:\"I saw the Messenger of Allah (SAW) leading the people in prayer, carrying UmamahbintAbiAl-'As on his shoulder. When he bowed he put her down and when he finished prostrating he picked her up again.\""
        },
        {
          "body": "Narrated `Aisha:(the wife of the Prophet) I told Allah's Apostle that SafiyabintHuyai had got her menses. He said, \n\"She will probably delay us. Did she perform Tawaf (Al-Ifada) with you?\" We replied, \"Yes.\" On that \nthe Prophet told her to depart."
        },
        {
          "body": "It was narrated that HafshahbintUmar said:\"The Messenger of Allah sadi: 'An army will be sent toward this House, and when they are inAl-Baida, they first and the last of them will be swallowed up by the earth, and those in the middle will be saved.' I said: \"What if there are believers among them?\" He said: 'It will be graves for them.'\" (Daif)"
        },
        {
          "body": "Aishah narrated:\"It was mentioned to the Messenger of Allah that SafiyyahbintHuyai got her menses during the days of Mina, so he said: \"Will she prevent us (from departing)?\" They said: \"She has done (Tawaf)Al-Ifadah/\" So the Messenger of Allah said: \"In that case there is no harm.\""
        },
        {
          "body": "Ummal-Fadlbint-al-Harith reported that some people argued about the fasting of the Messenger of Allah (may peace be upon him) on the day of 'Arafa. Some of them said that he had been fasting, whereas the others said that he had not been fasting. I sent a cup of milk to him while he was riding his camel at 'Arafa, and he drank it."
        },
        {
          "body": "HindbintAl-HarithAl-Farrasiyyah narrated that:Umm Salamah told her that during the time of the Messenger of Allah (SAW), when the women said the taslim at the end of the prayer, the Messenger of Allah (SAW) and the men who had prayed with him would stay put for as long as Allah (SAW) willed. Then, when the Messenger of Allah (SAW) got up, the men did too."
        },
        {
          "body": "It was narrated from Yahya bin Sa'eed, from 'Amrahbint'Abdur-Rahman, that she told him about HabibahbintSahl:\"She was married to Thabit bin Qais bin Shammas. The Messenger of Allah went out to pray As-Subh and he found HabibahbintSahl at his door at the end of the night. The Messenger of Allah said: 'Who is this?' She said: 'I am HabibahbintSahl, O Messenger of Allah.' He said: 'What is the matter?' She said: 'I cannot live with Thabit bin Qais' -her husband. When Thabit bin Qais came, the Messenger of Allah said to him: 'Here is HabibahbintSahl and she has said what Allah willed she should say.' Habibah said: 'O Messenger of Allah, everything that he gave me is with me.' The Messenger of Allah said: 'Take it from her.' So he took it from her and she stayed with her family.\""
        },
        {
          "body": "It was narrated that 'Ali binAl-Mubarak said:\"KarimahbintHammam told me that she heard 'Aishah, the Mother of the Believers, say: 'You have been forbidden Ad-Dubba' (gourds), you have been forbiddenAl-Hantam, you have been forbiddenAl-Muzaffat.' Then she turned to women and said: 'Beware of green earthenware jars, and if the water in your clay vessels intoxicates you, do not drink it.'\""
        },
        {
          "body": "It was narrated that Marwan binAl-Hakam said that one should perform Wudu' after touching one's penis. Marwan said:\"BusrahbintSafwan told me that.\" 'Urwah sent someone to check that, and she said: \"The Messenger of Allah (PBUH) mentioned what Wudu' is done for, and said: 'Touching the penis.'\""
        },
        {
          "body": "It was narrated that Abu Qatadah said:\"I saw the Messenger of Allah (saws)leading the people in prayer, carrying UmamahbintAbiAl-As on his shoulder. When he bowed he put her down and when he stood up from prostration he picked  her up again.\""
        },
        {
          "body": "JuwairiyahbintAl-Harith (May Allah be pleased with her), the Mother of the Believers, said that the Prophet (PBUH) visited her on a Friday and she was observing fast. He asked, \"Did you observe fast yesterday?\" She said, \"No.\" He asked, \"Do you intend to observe fast tomorrow?\" She said, \"No.\" He said, \"In that case, give up your fast today.\"[Al-Bukhari]."
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibnal-Qasim\nfrom his father from AsmabintUmays that she gave birth to Muhammad\nibn Abi Bakr atal-Bayda. Abu Bakr mentioned this to the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, \"Tell her\nto do ghusl and then enter ihram.\""
        },
        {
          "body": "Yahya related to me from Malik from AbuRijal Muhammad ibn Abd ar-\nRahman from AmrabintAbd ar-Rahman that when A'isha ummal-muminin\nwas doing hajj with women who were expecting their periods, she would\nhurry them to do the tawafal-ifada on the Day of Sacrifice. If they\nstarted to menstruate after the tawafal-ifada she did not stop for\nthem but left with them while they were menstruating."
        },
        {
          "body": "It was narrated from Asma'bintYazid that :the Messenger of Allah (saas) said: \"The Greatest Name of Allah is in these two Verses: And your Ilah (God) is One Ilah (God - Allah), La Ilaha Illa Huwa (none has the right to be worshipped but He), the Most Gracious, the Most Merciful.' And at the beginning of SurahAl'Imran.\""
        },
        {
          "body": "It was\nnarrated from Abu MusaAl-Ash’ari that the Prophet (saw) said:“Many men have attained perfection but no women have attained\nperfection except Maryambint‘Imran (Mary) and Asiyah the wife of\nFir’awn. And the superiority of ‘Aishah over other women is like\nthe\nsuperiority of Tharid over all other foods.”"
        },
        {
          "body": "Malik related to me from Nafi that Abdullah ibn Umar inherited\nthe house of HafsabintUmar. He said, \"Hafsa gave lodging to the\ndaughter of Zayd ibnal-Khattab for as long as she lived. When the\ndaughter of Zayd died, Abdullah ibn Umar took possession of the\ndwelling and considered that it was his.\""
        },
        {
          "body": "Narrated Anas bin Malik:The Verse ofAl-Hijab (veiling of women) was revealed in connection with ZainabbintJahsh. (On the \nday of her marriage with him) the Prophet gave a wedding banquet with bread and meat; and she used \nto boast before other wives of the Prophet and used to say, \"Allah married me (to the Prophet in the \nHeavens.\""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibnal-Qasim\nfrom his father from A'isha ummal-muminin that SafiyyabintHuyy\nbegan menstruating and so she mentioned it to the Messenger of Allah,\nmay Allah bless him and grant him peace, and he asked, \"Will she delay\nus?\" and he was told, \"She has already done the tawafal-ifada,\" and\nhe said, \"Then she will not delay us. \""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibnal-Qasim\nfrom his father from Abd ar-Rahman and Mujamma the sons of Yazid ibn\nJariyaal-Ansari from KhansabintKhidamal-Ansariya that her father\ngave her in marriage and she had been previously married. She\ndisapproved of that, and went to the Messenger of Allah, may Allah\nbless him and grant him peace, and he revoked the marriage."
        },
        {
          "body": "Narrated Dhakwan:from the freed slave of 'Amr binAl-'As that 'Amr binAl-'As sent him to 'Ali seeking his permission to enter upon AsmabintUmais, so he permitted him. When he was finished from what he needed, the freed slave of 'Amr binAl-'As asked about that, so he said: \"Indeed the Prophet (SAW) prohibited us - or - prohibited that we enter upon women, without the permission of their husbands.\""
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said that AtikabintZayd ibn Amr ibn Nufayl, the wife of Umar ibnal-Khattab, used to\nask Umar ibnal-Khattab for permission to go to the mosque. He would\nkeep silent, so she would say, \"By Allah, I will go out, unless you\nforbid me,\" and he would not forbid her."
        },
        {
          "body": "It was narrated that JudamahbintWahbAl-Asadiyyah said:\"I heard the Messenger of Allah say: 'I wanted to forbid intercourse with a nursing mother, but then (I saw that) the Persians and the Romans do this, and it does not kill their children.'  And I heard him say/when he was asked about coitus interruptus: 'It is the disguised form of b.rryirg children alive.\""
        },
        {
          "body": "AishahbintTallah narrated from her maternal aunt Aishah the Mother of the Believers that:the Messenger of Allah told one of his wives to depart from Jam (Al-Muzadalifah) on the night of Jam, to go to Jamratual Aqabah and stone it, then come back to her camp before morning. And Ata used to do that until he died."
        },
        {
          "body": "AsmabintYazid narrated that the Prophet (saws) said:“Allah's greatest name is in these two Ayah: ‘And your deity is One deity, there is none who has the right to be worshipped but He, Ar-Raḥmān, Ar-Raḥīm.’ And the Opening  ofAl-`Imrān: ‘Alif. Lām. Mīm. Allah, None has the right to be worshipped but He, the Ever living, the Sustainer.’”"
        },
        {
          "body": "It was\nnarrated from Abu Bakr bin ‘Abdullah bin Zubair from his\ngrandmother – he (the narrator) said:“I do not know if it was\nAsma’bintAbu Bakr or Su’dabint‘Awf’ – that the\nMessenger of Allah (saw)\nentered upon Duba’ahbint‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from ZaynabbintAbu Salama that she saw ZaynabbintJahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray."
        },
        {
          "body": "It was narrated from QudamahAl-'Amiri that JasrahbintDijajahAl-'Amiriyyah told him:\"I heard 'Aishah when some people asked her about Nabidh, saying we soak dates in the morning and drink it in the evening, or we soak them in the evening and drink them in the morning. She said: 'I do not permit any intoxicant even if it were bread or even if it were water.' She said that three times.\""
        },
        {
          "body": "A'isha (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) went (to the house of) Duba'abintal-Zubair b. Abdal-Muttalib. She said:Messenger of Allah, I intend to perform Hajj, but I am ill. Thereupon Allah's Apostle (may peace be upon him) said: Enter Into the state of Ihram on condition that you would abandon it when Allah would detain you."
        },
        {
          "body": "Malik related to me from Yahya ibn Said from AmrabintAbd ar-\nRahman that Barira came asking the help of A'isha, ummal-muminin.\nA'isha said, \"If your masters agree that I pay them your price in one\nlump sum and set you free I will do it.\" Barira mentioned that to her\nmasters and they said, \"No, not unless your wala' is ours.\" Yahya ibn\nSaid added that AmrabintAbd ar-Rahman claimed that A'isha mentioned\nthat to the Messenger of Allah, may Allah bless him and grant him\npeace, and the Messenger of Allah, may Allah bless him and grant him\npeace said, \"Buy her and set her free. The wala' only belongs to the\none who sets free.\""
        },
        {
          "body": "Narrated `Ali binAl-Husain (from Safiya the Prophet's wife):The wives of the Prophet were with him in the mosque (while he was in I`tikaf) and then they \ndeparted and the Prophet said to SafiyabintHuyai, \"Don't hurry up, for I shall accompany you,\" (and \nher dwelling was in the house of Usama). The Prophet went out and in the meantime two Ansari men \nmet him and they looked at the Prophet and passed by. The Prophet said to them, \"Come here. She is \n(my wife) SafiyabintHuyai.\" They replied, \"Subhan Allah, (How dare we think of evil) O Allah's \nApostle! (we never expect anything bad from you).\" The Prophet replied, \"Satan circulates in the \nhuman being as blood circulates in the body, and I was afraid lest Satan might insert an evil thought in \nyour minds.\""
        },
        {
          "body": "It was narrated that Umm SubyahAl-Juhaniyyah said:\"Often my hand would touch the hand of the Messenger of Allah while performing ablution from a single vessel.\" (Hasan)\n\nAbu `Abdullah bin Majah said: \"I heard Muhammad say: 'Umm Subyah was KhawlahbintQais. I mentioned that to Abu Zur`ah and he said: \"It is true.\""
        },
        {
          "body": "It was narrated from MaimunahbintKardamAl-Yasariyyah that :her father met the Prophet (SAW) when she was riding behind him. He said: \"I vowed to offer a sacrifice at Buwanah.\" The Messenger of Allah (SAW) said: \"Is there any idol there?\" He said: \"No.\" He said: \" Fulfill your vow.\" (Hasan)Another chain with similar wording."
        },
        {
          "body": "It was narrated from Yahya bin 'Abbad bin 'Abdullah bin Az-Zubair, from his grandfather, that he used to say:\"In the year of Khaibar, the Messenger of Allah allocated four shares to Az-Zubair binAl-'Awwam: A share of Az-Zubair, a share for the relatives of Safiyyahbint'Abdul-Muttalib, the mother of Az-Zubair, and two shares for the horse.\""
        },
        {
          "body": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that Ummal-\nFadlbintal-Harith heard him recitingalMursalat (sura 77) and she\nsaid to him, \"My son, you have reminded me by reciting this sura that\nit was what I last heard the Messenger of Allah, may Allah bless him\nand grant him peace, recite in the maghrib prayer.\""
        },
        {
          "body": "Anas (May Allah be pleased with him) reported:Umm Ar-Rubaiy'ibintAl-Bara', who was the mother of Harithah bin Suraqah, came to the Prophet (PBUH) and said: \"O Messenger of Allah! Will you not tell me about Harithah? (He was killed in the battle of Badr). If he is in Jannah I shall show endurance, but if he has met another fate, I may exert myself in weeping for him.\" He (PBUH) replied, \"O mother of Harithah, in in the gardens of Jannah there are many ranks, and your son has attainedAl-Firdaus, the highest.\"[Al- Bukhari]."
        },
        {
          "body": "It was narrated from SafiyyahbintAbi 'Ubaid that she heard Hafsahbint'Umar, the wife of the Prophet, (narrate) that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "It was narrated from Masruq that:Abdullah was asked about a man who married a woman and died without having consummated the marriage with her, nor stipulating the dowry. Abdullah said: “The dowry is hers, and the inheritance is hers and she has to observe the waiting period.” Ma'qil bin SinanAl-Ashja'i said: “I saw the Messenger of Allah (saws) pass a similar ruling concerning Birwa'bintWashiq.” (Sahih)\n\nAnother chain from 'Alqamah, from Abdullah, with similar wording.\nIt was narrated from Masruq that:\nAbdullah was asked about a man who married a woman and died without having consummated the marriage with her, nor stipulating the dowry. Abdullah said: “The dowry is hers, and the inheritance is hers and she has to observe the waiting period.” Ma'qil bin SinanAl-Ashja'i said: “I saw the Messenger of Allah pass a similar ruling concerning Birwa'bintWashiq.” (Sahih)\n\nAnother chain from 'Alqamah, from Abdullah, with similar wording."
        },
        {
          "body": "'Aishah narrated:\"When this Ayah was revealed: And warn your near kindred....(26:214), the Messenger of Allah (s.a.w) said:\n\"O Safiyyahbint'Abdul-Muttalib! O FatimahbintMuhammed! O Banu 'Abdul-Muttalib! I have no authority on your behalf over Allah for anything. Ask me for whatever you want of my wealth.\""
        },
        {
          "body": "Narrated Anas:Abu Bakr wrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who \nhad to pay oneBintMakhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had gotBintLabun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the \ncollector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not aBintMakhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he \nwould not be paid anything ."
        },
        {
          "body": "Narrated `Aisha:Allah's Apostle entered upon DubaabintAz-Zubair and said to her, \"Do you have a desire to perform \nthe Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate \nsomething by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am \nunable to go further).\" She was the wife ofAl-Miqdad binAl-Aswad."
        },
        {
          "body": "Abu Bakr b. Abu'l-Jahm reported:I and Abu Salama b 'Abdal-Rahman came to fatimabintQais (Al! ah be pleased with her) and asked her (about divorce, etc.). She said: I was the wife of Abu 'Amr b. Hafs b.al-Mughira, and he set out to join the battle of Najran. The rest of the hadith is the same, but he made this addition:\" She said: I married him and Allah hornoured me on account of Ibn Zaid and Allah favoured me because of him.\""
        },
        {
          "body": "Narrated 'Aishah:\"When this Ayah was revealed: 'And warn your tribe of near kindred (26:214).' The Messenger of Allah (SAW) said: 'O Safiyyahbint'Abdul-Muttalib! O FatimahbintMuhammad! O Banu 'Abdul-Muttalib! I have no power to help you at all before Allah! Ask of me whatever you want from my wealth.'\""
        },
        {
          "body": "Narrated `A'ishah (RAA):FatimabintAbu Hubaish used to have a prolonged flow of blood (Istihadah) and so Allah’s Messenger (Peace be upon him)· told her, \"If it is the blood of menstruation it will be dark (almost black) and recognizable (by women). If it is that, then leave the prayer. If it is other than that, then make ablution and pray.\"\n[Reported by Abu Da'ud and An-Nasa’i. Ibn Hibban andAl-Hakim graded it Sahih (sound).]"
        },
        {
          "body": "Ibn Shihab narrated from Salim bin Abdullah, from his father, from the Prophet(saw):Ibn Shihab said: “Salim read to me a letter that the Messenger of Allah had written concerning Sadaqat, before Allah caused him to pass away, in which it was said: 'For five camels one sheep; for ten, two sheep; for twenty, four sheep. For twenty five, aBintMakhad(a one year old she-camel), up to thirty-five; if there is noBintMakhad, then a Bin Labun ( a two-year-old male camel). If there are more than thirty-five even one, then aBintLabun ( a two-year-old she-camel) must be given up to forty-five. If there are more than forty-five, even one, then a Hiqqah (a three-year-old she-camel), up to sixty camels. If there are more than sixty, even one more, then a Jadha'ah ( a four-year-old she-camel) must be given, up to seventy-five. If there are more than seventy-five, even one more, then twoBintLabun must be given, upto ninety. If there are more than ninety, even one more, then two Hiqqah must be given, up to one hundred and twenty. If there are many camels, then for each fifty, one Hiqqah must be given and for each forty aBintLabun' ”"
        },
        {
          "body": "Narrated Anas:Abu Bakr , wrote to me about the Zakat which Allah had ordered His Apostle to observe: Whoever \nhad to pay Jahda (Jahda means a four-year-old she-camel) as Zakat from his herd of camels and he \nhad not got one, and he had Hiqqa (three-year-old she-camel), that Hiqqa should be accepted from \nhim along with two sheep if they were available or twenty Dirhams (one Durham equals about 1/4 \nSaudi Riyal) and whoever had to pay Hiqqa as Zakat and he had no Hiqqa but had a Jadha, the Jadha \nshould be accepted from him, and the Zakat collector should repay him twenty Dirhams or two sheep; \nand whoever had to pay Hiqqa as Zakat and he had not got one, but had aBintLabun (two-year-old \nshe-camel), it should be accepted from him along with two sheep or twenty Dirhams; and whoever \nhad to payBintLabun and had a Hiqqa, that Hiqqa should be accepted from him and the Zakat \ncollector should repay him twenty Dirhams or two sheep; and whoever had to payBintLabun and he \nhad not got one but had aBintMakhad (one-year-old she camel), thatBintMakhad should be \naccepted from him along with twenty Dirhams or two sheep."
        },
        {
          "body": "Narrated ZainabbintSalama:Um Habiba said to Allah's Apostle \"We have heard that you want to marry DurrabintAbu-Salama.\" \nAllah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not \nmarried Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\""
        },
        {
          "body": "It was narrated from Anas bin Malik that Abu Bakar, may Allah be pleased with him, wrote to him:\"This is the obligation of Sadaqah which  the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah Whoever is asked for it in the manner explained (in the letter of Abu Bakar), let him give it, and whoever is asked for more than that, let him not give it. When there are less than twenty-five camels, for every five camels, one sheep (is to be given). If the number reaches twenty-five, then aBintMakhad (a one-year-old she-camel) is due, up to thirty-five. If aBintMakhad (a one-year-old male camel). If the number reaches thirty-six, then aBintLabun (a two-year-old she-camel) is due, up to forty five. If the number reaches forty-six, then a Hiqqah (a three year old she-camel) that was bred by a stallion camel is due, up to sixty. If the number reaches sixty-one, then a Jadh'ah (a four-year-old she-camel) is due, up to seventy-five. If the number reaches seventy-six, then twoBintLabun are due, up to ninety. If the number reaches ninety-one, then two Hiqqahs that have been bred by stallion camels are due, up to one hundred and twenty. If there are more than one hundred and twenty, then for every forty aBintLabun and for every fifty a Hiqqah. In the event that a person does not have a camel of the age specified according to the Sadaqah regulation, then if a person owes a Jadh'ah but he has a Hiqqah, then the Hiqqah should be accepted from him and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes a Hiqqah as Sadaqah but he only has a Jadh'ah, then it shold be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes a Hiqqah and does not have one but he has aBintLabun, it should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes aBintLabun as Sadaqah but he only has a Hiqqah, it should be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes aBintLabun as Sadaqah and he does not have aBintLabun, but he has aBintMakhad. It should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes aBintMakhad as Sadaqah but he only has aBintLabun, a male, it shold be accepted from him and nothing else (need be given) with it. If a person has only four camels, then nothing is due on them, unless their owner wishes (to give something). With regard to the Sadaqah of grazing sheep, if there are forty then one sheep is due, up to one hundred and twenty. If there is one more than that, then two sheep are due, up to two hundred. If there is one more than that, then three sheep are due, up to three hundred. If there is one more than that, then for every hundred one sheep is due, and no decrepit or defecting sheep or male sheep should be taken as Sadaqah unless the Zakah collector wishes. Do not combine separate flocks or separate combined flocks for fear of Sadaqah, Each partner (who has a share in a combined flock) shold pay Sadaqah in proportion to his shares. If a man's flock is one less than forty sheep, then nothing is due from them unless their owner wishes. With regard to silver, one-quarter of one-tenth, and if there are only one hundred and ninety, nothing is due unless the owner wishes.\""
        },
        {
          "body": "Narrated 'Aishah:It was narrated from 'Aishah the wife of the Prophet, and Umm Salamah the wife of the Prophet that Abu Hudhaifah bin 'Utbah bin Rabi'ah bin Abd Shams --who was one of those who had been present at Badr with the Messenger of Allah-- adopted Salim --who was the freed slave of an Ansari woman-- as the Messenger of Allah had adopted Zaid bin Harithah.  Abu Hudhaifah bin 'Utbah married Salim to his brother's daughter HindbintAl-Walid bin 'Utbah bin Rabi'ah. HindbintAl-Walid bin 'Utbah was one of the first Muhajir women, and at that time she was one of the best single women of the Quraish. When Allah, the Mighty and Sublime, revealed the following concerning Zaid bin Harithah: \"Call them by (the names of) their fathers, that is more just with Allah. But if you know not their fathers' (names, call them) your brothers in Faith and Mawalikum (your freed slaves).' Each of them went back to being called after his father, and if a person's father was unknown, he was named after his former masters."
        },
        {
          "body": "It was narrated from 'Urwah that FatimahbintAbi Hubaish narrated that she came to the Messenger of Allah (PBUH) and complained to him about bleeding. The Messenger of Allah (PBUH) said to her:\"That is a vein, so when your period comes, do not pray, and when your period is over, purify yourself and pray in between one period and the next.\"\nThis is evidence thatAl-Aqra' is menstruation. Abu 'Abdur-Rahman said: Hisham bin 'Urwah reported this Hadith from 'Urwah, and he did not mention whatAl-Mundhir mentioned in it."
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Ata ibn\nAbi Rabah that a mawla of AsmabintAbi Bakr told him, \"We arrived at\nMina with AsmabintAbi Bakr at the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""
        },
        {
          "body": "Ibrahim ibn Marzuq ath-Thaqafi related that his father (who had\nbelonged to Allah ibn az-Zubayr) told him, \"'Abdullah ibn az-Zubayr sent\nme to his mother, Asma'bintAbi Bakr and he told her howal-Hajjaj was\ntreating them. She made supplication for me and stroked my head. I was\na young boy at that time.\""
        },
        {
          "body": "Juairiyahbintal-Harith (RAA) narrated, ‘The Messenger of Allah (P.B.U.H.) said to me, “Since leaving you have said four phrases which if weighed against all you have said today, would prove to be heavier:‘How perfect Allah is and I praise Him by the amount of His creation and His pleasure, and by the weight of His throne, and the ink of His words.” Related by Muslim."
        },
        {
          "body": "Narrated Ibn `Abbas:that his aunt, Um HufaidbintAl-Harith bin Hazn, presented to the Prophet butter, dried yoghurt and \nmastigures. The Prophet invited the people to those mastigures and they were eaten on his dining \nsheet, but the Prophet did not eat of it, as if he disliked it. Nevertheless. if it was unlawful to eat that, \nthe people would not have eaten it on the dining sheet of the Prophet nor would he have ordered that \nthey be eaten."
        }
      ]
    }
  ]
}