{
  "data": [
    {
      "hadith": [
        {
          "body": "It was narrated from Yahyabin'Abbadbin'AbdullahbinAz-Zubair, from his grandfather, that he used to say:\"In the year of Khaibar, the Messenger of Allah allocated four shares to Az-ZubairbinAl-'Awwam: A share of Az-Zubair, a share for the relatives of Safiyyahbint'Abdul-Muttalib, the mother of Az-Zubair, and two shares for the horse.\""
        },
        {
          "body": "IbrahimibnMarzuq ath-Thaqafi related that his father (who had\nbelonged to Allahibnaz-Zubayr) told him, \"'Abdullahibnaz-Zubayrsent\nme to his mother, Asma'bintAbi Bakr and he told her howal-Hajjaj was\ntreating them. She made supplication for me and stroked my head. I was\na young boy at that time.\""
        },
        {
          "body": "Yahya related to me from Malik fromal-MiswaribnRifaaal-\nQuradhi from az-ZubayribnAbd ar-Rahmanibnaz-Zubayrthat RifaaibnSimwal divorced his wife, TamimabintWahb, in the time of the\nMessenger of Allah, may Allah bless him and grant him peace, three\ntimes. Then she married Abd ar-Rahmanibnaz-Zubayrand he turned from\nher and could not consummate the marriage and so he parted from her.\nRifaa wanted to marry her again and it was mentioned to the Messenger\nof Allah, may Allah bless him and grant him peace, and he forbade him\nto marry her. He said, \"She is not halal for you until she has tasted\nthe sweetness of intercourse.\""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahmanibnal-Qasim\nfrom his father that A'isha, the wife of the Prophet, may Allah bless\nhim and grant him peace, gave HafsabintAbd arRahman in marriage toal-Mundhiribnaz-Zubayrwhile Abd ar-Rahman was away in Syria. When\nAbd ar-Rahman arrived, he said, \"Shall someone like me have this done\nto him? Am I the kind of man to have something done to him without his\nconsent?\" A'isha spoke toal-Mundhiribnaz-Zubayr, andal-Mundhir\nsaid, \"It is in the hands of Abd ar-Rahman.\" Abd ar-Rahman said, \"I\nwon't oppose something that you have already completed.\" Hafsa was\nconfirmed withal-Mundhir, and there was no divorce."
        },
        {
          "body": "Narrated `Aisha:Allah's Apostle entered upon DubaabintAz-Zubairand said to her, \"Do you have a desire to perform \nthe Hajj?\" She replied, \"By Allah, I feel sick.\" He said to her, \"Intend to perform Hajj and stipulate \nsomething by saying, 'O Allah, I will finish my Ihram at any place where You stop me (i.e. I am \nunable to go further).\" She was the wife ofAl-MiqdadbinAl-Aswad."
        },
        {
          "body": "Yahya related to me from Malik from HishamibnUrwa from his\nfather from Fatimabintal-Mundhiribnaz-Zubayrthat AsmabintAbu\nBakr as-Siddiq said, \"A woman questioned the Messenger of Allah, may\nAllah bless him and grant him peace, saying, 'If menstrual blood gets\nonto our clothes how do you think we should deal with it?' The\nMessenger of Allah, may Allah bless him and grant him peace, said, 'If\nmenstrual blood gets onto your clothes you should wash them, and\nsprinkle them with water before you pray in them.' \""
        },
        {
          "body": "Yahya related to me from Malik that MuhammadibnAbd ar-RahmanibnNawfal said, ''Urwaibnaz-Zubayrinformed me from A'isha ummal-\nmuminin that JudamabintWahbal-Asadiyya informed her that she heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'I intended to prohibit ghila but I remembered that the Greeks and\nPersians do that without it causing any injury to their children.' \"Malik explained, \"Ghila is that a man has intercourse with\nhis wife while she is suckling.\""
        },
        {
          "body": "'UrwahbinAz-Zubairsaid:\"I entered upon MawanbinAl-Hakam and we mentioned the things for which Wudu' is done. Marwan said: 'Wudu' should be done after touching the penis.' 'Urwah said: 'I did not know that.' Marwan said: 'BusrahbintSafwan told me that she heard the Messenger of Allah (PBUH) say: \"And if any one of you touches his penis, let him do Wudu'.\""
        },
        {
          "body": "IbnAbbas reported that Duba'abintal-Zubairb. 'Abdal-Muttalib (Allah be pleased with her) came to Allah's Messenger (may peace be upon him) and said:I am an ailing woman but I intend to perform Hajj; what you command me (to do)? He (the Holy Prophet) said: Enter into the state of Ihram (uttering these words) of condition: I would be free from it when Thou wouldst detain me. 'He (the narrator) said: But she was able to complete (the Hajj without breaking down)."
        },
        {
          "body": "A'isha (Allah be pleased with her) reported that Allah's Apostle (may peace be upon him) went (to the house of) Duba'abintal-Zubairb. Abdal-Muttalib. She said:Messenger of Allah, I intend to perform Hajj, but I am ill. Thereupon Allah's Apostle (may peace be upon him) said: Enter Into the state of Ihram on condition that you would abandon it when Allah would detain you."
        },
        {
          "body": "Narrated Abu Huraira:The Prophet said, \"O Bani `Abd Munaf! Buy yourselves from Allah; O Bani `Abdul-Muttalib! Buy \nyourselves from Allah; O mother of Az-ZubairbinAl-Awwam, the aunt of Allah's Apostle, and O \nFatimabintMuhammad! Buy yourselves from Allah, for I cannot defend you before Allah. You \n(both) can ask me from my property as much as you like. \""
        },
        {
          "body": "Yahya related to me from Malik that AbdullahibnAbi BakribnMuhammadibnAmribnHazim heard Urwaibnaz-Zubayrsaying, \"I went to\nsee Marwanibnal-Hakam and we talked about what you had to do wudu\nfor, and Marwan said, 'You have to do wudu if you touch your penis.'\nUrwa said, 'I didn't know that.' Marwanibnal-Hakam said that BusrabintSafwan had told him that she heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'If any of you touches his\npenis he should do wudu.' \""
        },
        {
          "body": "It was\nnarrated from Abu Bakrbin‘AbdullahbinZubairfrom his\ngrandmother – he (the narrator) said:“I do not know if it was\nAsma’bintAbu Bakr or Su’dabint‘Awf’ – that the\nMessenger of Allah (saw)\nentered upon Duba’ahbint‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"
        },
        {
          "body": "Abu Bakr reported:I and Abu Salama came to FatimabintQais (Allah be pleased with her) during the time ofIbnZubair(Allah be pleased with him) and she narrated to us that her husband gave her an irrevocable divorce. (The rest of the hadith is the same.)"
        },
        {
          "body": "Yahya related to me from Malik fromIbnShihab from Urwaibnaz-Zubayrfrom A'isha, ummal-muminin, that she took HafsaibnAbd ar-\nRahmanibnAbi Bakr as-Siddiq into her house when she had entered the\nthird period of her idda.IbnShihab said, \"That was mentioned to AmrabintAbd ar-Rahman, and she said that Urwa had spoken the truth and\npeople had argued with A'isha about it. They said that Allah, the\nBlessed, the Exalted, said in His Book, 'Three quru.' A'isha said,\n'You spoke the truth. Do you know what quru are? Quru are times of\nbecoming pure after menstruation .' \""
        },
        {
          "body": "Narrated Jabirbin`Abdullah:When the Prophet called the people (Sadqa, a sub-narrator, said, 'Most likely that happened on the \nday ofAl-Khandaq) Az-Zubairresponded to the call (i.e. to act as a scout). The Prophet) called \nthe people again and Az-Zubairresponded to the call. The Prophet then said, \"Every prophet had a \ndisciple and my disciple isZubairbinAl-`Awwam.\""
        },
        {
          "body": "NarratedAl-Aswad:`Abdullah the slave of AsmabintAbu Bakr, told me that he used to hear Asma', whenever she passed \nbyAl-Hajun, saying, \"May Allah bless His Apostle Muhammad. Once we dismounted here with him, \nand at that time we were traveling with light luggage; we had a few riding animals and a little food \nration. I, my sister, `Aisha, Az-Zubairand such and such persons performed `Umra, and when we had \npassed our hands over the Ka`ba (i.e. performed Tawaf round the Ka`ba and between As-Safa andAl- \nMarwa) we finished our lhram. Later on we assumed Ihram for Hajj the same evening.\""
        },
        {
          "body": "It was\nnarrated thatIbn‘Abbas said:Duba’ahbintZubairbin‘Abdul-\nMuttalib came to the Messenger of Allah (saw) and said: “I\nam a heavy\nwoman and I want to go for Hajj. How should I enter\nIhram?” He said:\n“Enter Ihram and stipulate the condition that\nyou will exit Ihram from\nthe point where you are prevented.”"
        },
        {
          "body": "Yahya related to me from Malik from RabiaibnAbi Abd ar-Rahman\nthat az-Zubayribnal-Awwam came across a man who had taken hold of a\nthief and was intending to take him to the Sultan. Az-Zubayribnal-\nAwwam interceded for him to let him go. He said, \"No. Not until I take\nhim to the Sultan.\" Az-Zubayrsaid, \"When you reach the Sultan with\nhim, Allah curses the one who intercedes and the one who accepts the\nintercession.\""
        },
        {
          "body": "Narrated 'AbdullahbinAz-Zubair:that the Messenger of Allah (SAW) said: \"It is only calledAl-BaitAl-'Atiq because it has not been conquered by a tyrant.\""
        },
        {
          "body": "Zur’ah b. ‘Abdal-Rahman said:I heardIbnal-Zubairsay: Setting the feet right and placing one hand on the other is a sunnah."
        },
        {
          "body": "Narrated Jabir [may Allah be pleased with him]:that the Messenger of Allah (SAW) said: \"Indeed, every Prophet has a Hawari and, [indeed], my Hawari is Az-Zubair[binAl-'Awwam].\"\nAnd Abu Na'im added in it: \"On the Day ofAl-Ahzab, he (SAW) said: 'Who will bring us news about their party?' Az-Zubairsaid: 'I will.' He said it three times. Az-Zubairsaid (each time): 'I will.'\""
        },
        {
          "body": "The tradition mentioned above has also been transmitted by Jabir through a different chain of narrators. This version adds :Cutting of the hand is not be inflicted on one who snatches something.Abu Dawud  said :IbnJuraij did not hear these two traditions from Abual-Zubair, I have been informed by Ahmad. B. Hanbal  saving :IbnJuraij heard them from Yasinal-Zayyat.Aby Dawud said:Al-Mughirah b. Muslim has transmitted it from Abual-Zubairfrom Jabir From the prophet(saws)."
        },
        {
          "body": "Ya`eeshbinal-Waleed narrated that a freed slave of the family of az-Zubairtold him that azZubairbinal-`Awwam (رضي الله عنه) narrated to him that The Messenger of Allah (ﷺ) said:“There has come to you the disease of the nations before you, jealousy and hatred. Hatred is the `shaver` (destroyer). I do not say that it shaves hair; rather its shaves (destroys) religious commitment. By the One in Whose Hand is the soul of Muhammad, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something that will help you to achieve that? Spread (the greeting of) salaam amongst yourselves.`\n\nIt was narrated from Ya`eeshbinal-Waleed that a freed slave of the family of az-Zubairtold him that az-Zubair(رضي الله عنه) told him: The Prophet (ﷺ)  said: “There has come to you.” and he narrated it.\n\nIt was narrated from a freed slave of the family of az-Zubair(رضي الله عنه) that az-Zubairbinal-`Awwam (رضي الله عنه) told him that The Messenger of Allah (ﷺ) said: “There has come to you...` and he narrated it,"
        },
        {
          "body": "HilalbinKhabbab said:\"I asked Sa'eedbinJubair about a man who performs Hajj and stipulates a condition. He said: 'Conditions are something that people do among themselves.' I narrated the Hadith of 'Ikrimah to him, and he narrated to me fromIbn'Abbas, that Duba'ahbintAz-Zubairbin'Abdul-Muttalib came to the Prophet, and said: 'O Messenger of Allah, I want to perform Hajj, so what should I say?' He said:  'Say: Labbaik Allahumma! Labbaika wa mahilli minal-ardihayth tahbisuni (Here I am, O Allah, Here I am, and I shall exit Ihram at any place where You decree that I cannot proceed.)\" And whatever condition you stipulate will be accepted by your Lord.\""
        },
        {
          "body": "Narrated Jabirbin‘Abdullah :The Prophet (saws) forbade sale of fruits for a number of years. One of the two narrators (Abual-Zubairand Sa'id b. Mina') mentioned the words \"sale for years\" (bai'al-sinin instead ofal-mu'awamah)."
        },
        {
          "body": "It was narrated from 'UrwahbinZubairand 'Amrahbint'Abdur-Rahman that :'Aishah the wife of the Prophet said: \"Umm Habibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahmanbin'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.'\" 'Aishah said: \"She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sister ZainabbintJahsh and the blood would turn the water red.\""
        },
        {
          "body": "It was narrated fromalMundhirbinaz-Zubair(رضي الله عنه) from his father that The Prophet (ﷺ) gave a share to az-Zubair, a share to his mother, and two shares to his horse."
        },
        {
          "body": "It was narrated from 'UrwahbinZubairthat FatimahbintAbi Hubaish narrated to him that:She went to the Messenger of Allah and complained to him about bleeding. The Messenger of Allah said: \"Rather that is a vein, so look and see when your period comes, then do not perform the prayer. When the period is over, then purify yourself and perform the prayer between one period to the next.\""
        },
        {
          "body": "Narrated Anas:The Prophet allowed `Abdur-Rahmanbin`Auf and Az-ZubairbinAl-`Awwam to wear silk."
        },
        {
          "body": "It was narrated thatIbn'Abbas said:'Duba'ahbintAz-Zubairbin'Abdul-Muttalib came to the Messenger of Allah and said: 'I am a heavy woman and I want to go for Hajj. How do I begin the Ihram?' He said: 'Enter Ihram and stipulate the condition that you will exit Ihram from the point where you are prevented (from continuing, if some problem should arise).\""
        },
        {
          "body": "Narrated AsmabintAbu Bakr:I used to carry the date stones on my head from the land of Az-Zubairwhich Allah's Apostle had \ngiven to him, and it was at a distance of 2/3 of a Farsakh from my house. \nNarrated Hisham's father: The Prophet gave Az-Zubaira piece of land from the property of Bani An- \nNadir (gained as war booty)."
        },
        {
          "body": "Subḥāna ‘l-ladhī yusabbiḥur-ra`du bi ḥamdihi \nwa ‘l-malā'ikatu min khīfatih.Glory is to Him Whom thunder and angels glorify due to fear of Him.Reference:Whenever AbdullahbinZubair(RA) would hear thunder, he would abandon all \nconversation and say this supplication. SeeAl-Muwatta' 2/992. It was \ngraded authentic byAl-Albani as a statement of AbdullahbinZubayronly."
        },
        {
          "body": "It was narrated from Hajjaj fromIbnJuraij from Abu Az-Zubair, that Jabir said:\"The hands of the traitor is not to be cut off.\" (Sahih)   \nAbu 'Abdur-Rahman (An-Nasai) said: This Hadith had been reported fromIbnJuraij by 'IsabinYunus,Al-FadlbinMusa,IbnWahb, MuhammadbinRabiah, MakhladbinYazid, and SalamahbinSaeed fromAl-Basrah, who is trustworthy andIbnAbi Safwan said: \"He was the best of the people of his time\" and not one of them said: \"Abu Az-Zubairnarrated to me\" and I do not think that he heard it from Abu Az-Zubair, and Allah knows best."
        },
        {
          "body": "It was narrated from 'AmrbinAz-Zubairthat FatimahbintAbi Hubaish told him that she came to the Messenger of Allah and complained to him about (continual) bleeding. The Messenger of Allah said to her:\"That is a vein. Look and when your period comes, do not pray, and when your period ends, then purify yourself and pray during the time between one period and the next.\""
        },
        {
          "body": "Yahya related to me from Malik from RabiaibnAbd ar-Rahman thatal-QasimibnMuhammad and Urwaibnaz-Zubayrgave the same judgement\ntoal-WalidibnAbdal-Malik in the year of his arrival in Madina\nexcept thatal-QasimibnMuhammad said that he divorced his wife on\nvarious occasions. (i.e. not at one time)."
        },
        {
          "body": "'Ata' reported thatIbn'Abbas sent (him) toIbnZubairat the commencement of the oath of allegiance to him (for Caliphatesaying):As there is no Adhan on 'Id-ul-Fitr, so you should not pronounce it.IbnZubairdid not pronounce Adhan on that day. He (Ibn'Abbas) also sent him (with this message) that sermon (is to be delivered) after the prayer, and thus it was done. So lbnZubairobserved prayer before Khutba."
        },
        {
          "body": "IbnShihab said Salim told him that in the yearal-Hajjaj b. Yusuf attackedIbnaz-Zubair(Abdallah b. az-Zubairwho was in Mecca had laid claims to the Caliphate. ‘Abdal-Malik, the Umayvad Caliph,sentan army underal-Hajjaj b. Yusuf towards the end of 72, A.H. to deal withIbnaz-Zubair, and although there had been fighting in the plain of ‘Arafat, hostilities ceased in order that the Pilgrimage might be observed, and were later resumed.) he asked ‘Abdallah (This is ‘Abdallah b. ‘Umar who is said to have been the one who was the means of having the hostilities stopped during the season of pilgrimage) how they were to act at the standing at ‘Arafa. Salim said, “If you wish to keep to the sunna, observe the prayer in the noonday heat on the day of ‘Arafa.” ‘Abdallah b. ‘Umar then said, “He has spoken the truth ; they were accustomed to combine the noon and the afternoon prayer in accordance with the sunna.”IbnShihab asked Salim whether God's messenger did that, and Salim replied, “In doing that do they follow anything but his sunna?”\n\nBukhari transmitted it."
        },
        {
          "body": "Khalifahsaid:\"I heard 'AbdullahbinAz-Zubairsay: 'Do not let your womenfolk wear silk, for I heard 'UmarbinAl-Khattab say: The Messenger of Allah [SAW] said: Whoever wears it in this world will not wear it in the Hereafter.'\""
        },
        {
          "body": "Narrated JabiribnAbdullah:The Prophet (saws) said: What the sea throws up and is left by the tide you may eat, but what dies in the sea and floats you must not eat.Abu Dawud said: This tradition has been transmitted by Sufyanal-Thawri, Ayyub and Hammad from Abual-Zubairas the statement of Jabor himself (and not from the Prophet). It has been also transmitted direct from the Prophet (saws) through a weak chain by Abu Dhi'b, from Abual-Zubairon the authority if Jabir from the Prophet (saws)."
        },
        {
          "body": "Narrated `Urwa:Az-Zubairsaid, \"I met UbaidabinSa`idbinAl-As on the day (of the battle) of Badr and he was \ncovered with armor; so much that only his eyes were visible. He was surnamed Abu Dhat-al-Karish. \nHe said (proudly), 'I am Abu-al-Karish.' I attacked him with the spear and pierced his eye and he died. \nI put my foot over his body to pull (that spear) out, but even then I had to use a great force to take it \nout as its both ends were bent.\" `Urwa said, \"Later on Allah's Apostle asked Az-Zubairfor the spear \nand he gave it to him. When Allah's Apostle died, Az-Zubairtook it back. After that Abu Bakr \ndemanded it and he gave it to him, and when Abu Bakr died, Az-Zubairtook it back. `Umar then \ndemanded it from him and he gave it to him. When `Umar died, Az-Zubairtook it back, and then \n`Uthman demanded it from him and he gave it to him. When `Uthman was martyred, the spear \nremained with `Ali's offspring. Then `AbdullahbinAz-Zubairdemanded it back, and it remained with \nhim till he was martyred."
        },
        {
          "body": "`Abd Allahbinal-Zubairsaid on the authority of the father :I askedal-Zubair: What prevents you from narrating traditions from the Apostle of Allah (may peace be upon him) as his Companions narrate from him? He said: By Allah I was very close to him. But I heard him (saws) say: He who lies about me deliberately will certainly come to his abode in Hell."
        },
        {
          "body": "Narrated 'Aishah:The Messenger of Allah (saws) as saying: No vow must be taken to do an act of disobedience, and the atonement for it is the same as for an oath.Ahmad b. Muhammadal-Marwazi said: The correct chain of this tradition is: 'Ali b.al-Mubarak, from Yahya b. Abi Kathir, from Muhammad b.al-Zubair, from his father, on the authority of 'Imran b. Husain from the Prophet (saws)Abu Dawud said: By this he (al-Marwazi) means that the narrator Sulaiman b. Arqam had some misunderstanding about this tradition.Al-Zuhri narrated it from him and then transmitted it (omitting his name) from Abu Salamah on the authority of 'Aishah.Abu Dawud said: Baqiyyah has transmitted it fromal-Auza'i from Yahya, from Muhammad b.al-Zubairwith a similar chain ofIbnal-Mubarak."
        },
        {
          "body": "'Urwa b.Zubairreported that 'A'isha, the wife of the Apostle of Allah (may peace be upon him), told him that (once) Haula' dint Tuwait b. Habib b. Asad b. 'Abdal-'Uzzi passed by her (at the time) when the Messenger of Allah (may peace be upon him) was with her. I ('A'Isha) said:It Is Haula'bintTuwait and they say that she does not sleep at night. Upon this the Messenger of Allah (may peace be upon him) said: (Oh) she does not sleep at night! Choose an act which you are capable of doing (continuously). By Allah, Allah would not grow weary, but you will grow weary."
        },
        {
          "body": "Al-Hasan narrated:A man came to az-Zubairbinal-’Awwam (رضي الله عنه) and said: “Shall I kill `Ali for you?” He said: “No; how can you kill him when he has the troops with him?” He said: “I will catch up with him and assassinate him.” He said: “No. The Messenger of Allah (ﷺ) said: Faith prohibits assassination; no believer should resort to that.”Al-Hasan said:  A man came to az-Zubairbinal-`Awwam (رضي الله عنه) and said: “Shall I not kill `Ali for you?” He said: “How can you kill him when he has people with him?” (and he narrated a similar report.)"
        },
        {
          "body": "Narrated NafibinJubair:I heardAlAbbas telling Az-Zubair, \"The Prophet ordered you to fix \n     the flag here.\""
        },
        {
          "body": "A’ishah (RAA) narrated, 'The Messenger of Allah (P.B.U.H.) went to visit. Duba’ahbintAz-Zubairbin'Abdul Muttalib. She said to him, ‘O Messenger of Allah I have made the intention to perform Hajj but I am suffering from an illness.’ He said to her, “Perform Hajj but set a condition that you shall be relieved of the Ihram whenever you are prevented (due to illness, etc.).” Agreed upon."
        },
        {
          "body": "Malik related to me from RabiaibnAbd ar-Rahman that az-Zubayribnal-Awwam bought a slave and set him free. The slave had children by a free woman. When az-Zubayrfreed him, he said, \"They are my mawali.\" The man argued, \"They are the mawali of their mother. Rather, they are our mawali.\" They took the dispute to UthmanibnAffan, and Uthman gave a judgement that az-Zubayrhad their wala'."
        },
        {
          "body": "'UrwahbinAz-Zubairsaid:\"When he was the governor ofAl-Madinah, Marwan mentioned that a man should perform Wudu' after touching his penis, if he touches it iwth his hand. I did not like that and I said: 'The one who touches it does not have to perform Wudu'.' Marwan said: 'BusrahbintSafwan told me that she heard the Messenger of Allah (PBUH) mention the things for which Wudu' should be performed, and the Messenger of Allah (PBUH) said: 'Wudu' should be performed after touching the penis.' 'Urwah said: 'I continued to argue with Marwan until he called one of his guards and sent him to Busrah to ask her about what Marwan had narrated, and Busrah sent word saying something like that which Marwan had narrated to me from her.\""
        },
        {
          "body": "Narrated Jabir:The Prophet said, \"Every prophet used to have a Hawari (i.e. disciple), and my Hawari is Az-ZubairbinAl-`Awwam.\""
        },
        {
          "body": "Narrated AnasbinMalik:(The Caliph `Uthmanordered ZaidbinThabit, Sa`idbinAl-As, `AbdullahbinAz-Zubairand `Abdur- \nRahmanbinAl-HarithbinHisham to write the Qur'an in the form of a book (Mushafs) and said to \nthem. \"In case you disagree with ZaidbinThabit (Al-Ansari) regarding any dialectic Arabic utterance \nof the Qur'an, then write it in the dialect of Quraish, for the Qur'an was revealed in this dialect.\" So \nthey did it."
        },
        {
          "body": "Yahya related to me from Malik that he had heard that Urwaibnaz-Zubayrand Saidibnal-Musayyab used to pray voluntary prayers\nsitting."
        },
        {
          "body": "IbnAz-Zubair(RAA) narrated that the Messenger of Allah (P.B.U.H.) said, \"Offering prayer in my mosque (in Madinah) is better than one thousand prayers elsewhere, save for those offered prayer inal-Masjidal-Haram (in Makkah). And prayer offered inal-Masjidal-Haram is better than prayer offered in my mosque by one hundred prayers.\" Related by Ahmad andIbnHibban graded it as Sahih."
        },
        {
          "body": "Narrated Az-ZubairbinAl-Awwam:The Prophet said, \"One would rather take a rope and cut wood and carry it than ask others)."
        },
        {
          "body": "Muslimal-Qurri reported:I askedIbnAbbas (Allah be pleased with them) about Tamattu' in Hajj and he permitted it, whereasIbnZubairhad forbidden it. He (Ibn'Abbas) said: This is the mother ofIbnZubairwho states that Allah's Messenger (may peace be upon him) had permitted it, so you better go to her and ask her about it. He (Muslimal-Qurri said): So we went to her and she was a bulky blind lady and she said: Verily Allah's Messenger (may peace be upon him) permitted it."
        },
        {
          "body": "AsmabintAbi Bakr  said:\" O the Messenger of Allah! I have nothing except what was given to me by (my husband) Az-Zubair, shall I give it (in charity)?'\" It was said: \"Do not hold (your wealth) so that Allah will hold against you.\""
        },
        {
          "body": "Sa'd reported that he went with 'Abdullahibn'Umar andal-QasimibnMuhammad. They stopped at place and 'Abdullahibnaz-Zubayrcommanded\nand made a gesture of greeting to them and it was answered."
        },
        {
          "body": "Yahya related to me from Malik fromIbnShihab from Urwaibnaz-Zubayrfrom AmrabintAbd ar-Rahman that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said,\"When the\nMessenger of Allah, may Allah bless him and grant him peace, did\nitikaf he would bring his head near to me and I would comb it. He\nwould only go into the house to relieve himself.\""
        },
        {
          "body": "SufyanbinWahbalKhawlani said:When we conquered Egypt without a peace deal (i.e., by force), az-Zubairbinal-`Awwam (رضي الله عنه) stood up and said: “O `Amrbinal`As, divide the land.” `Amr said: “I shall not divide it.” az-Zubair(رضي الله عنه) said: “By Allah, you will divide it as the Messenger of Allah (ﷺ) divided Khaibar!” ‘Amr said: “By Allah, I shall not divide it until I write to Ameeral-Mu`mineen.” So he wrote to `Umar (رضي الله عنه) and `Umar wrote back to him (saying}, Leave it so that the third generation (i.e., the offspring of the foetuses currently in their mother`s wombs) may use the income from it to go out on campaign for the sake of Allah."
        },
        {
          "body": "'AufbinMalik (May Allah be pleased with him) said:'Aishah (May Allah be pleased with her) as told that 'AbdullahbinAz-Zubair(May Allah be pleased with them) had said in respect of selling of a gift which was presented to her: \"By Allah! If 'Aishah does not stop this kind of thing, I will declare her incompetent to administer her property.\" 'Aishah (May Allah be pleased with her) asked: \"Did He ('AbdullahbinAz-Zubair) say so?\" The people said: \"Yes.\" 'Aishah (May Allah be pleased with her) said: \"I vow it before Allah that I will never speak toIbnAz-Zubair.\" When this desertion lasted long, 'AbdullahbinAz-Zubairsought intercession with her, but she said: \"By Allah I will not accept the intercession of anyone for him, and I will not commit a sin of breaking my vow.\" When this state of affairs was prolonged,IbnAz-Zubairfelt it hard on him. He said toAl-MiswarbinMakhramah and 'Abdur-RahmanbinAl-AswadbinYaghut: \"I beseech you in the Name of Allah that you should take me to 'Aishah because it is unlawful for her to vow to sever relations with me.\" SoAl-Miswar and 'Abdur-Rahman took him with them. They sought her permission, saying: \"As-salamu 'alaika wa rahmatullahi wa barakatuhu! Shall we come in?\" 'Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us?\" She said: \"All of you,\" not knowing thatIbnAz-Zubairwas also with them. So, when they entered,IbnAz-Zubairentered the screened place and got hold of 'Aishah (May Allah be pleased with her), his aunt. He was requesting her to forgive him and wept.Al-Miswar and 'Abdur-Rahman also pleaded on his behalf and requested her to speak to him and to accept his repentance. They said to her: \"The Prophet (PBUH) forbade to cut off relationship because it is unlawful for any Muslim not to talk to his (Muslim) brother (or sister, for that matter) for more than three (days).\" So when they persisted in urging and reminding her of the superiority of having good relation with kith and kin, she began to weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with 'AbdullahbinAz-Zubair, and she freed forty slaves as an expiation for breaking her vow. Later on, whenever she remembered her vow, she would weep so much that her veil would become wet with tears.[Al- Bukhari]."
        },
        {
          "body": "Narrated `Aisha:(the wife of the Prophet) that she was told that `AbdullahbinAz-Zubair(on hearing that she was \nselling or giving something as a gift) said, \"By Allah, if `Aisha does not give up this, I will declare her \nincompetent to dispose of her wealth.\" I said, \"Did he (`AbdullahbinAz-Zubair) say so?\" They \n(people) said, \"Yes.\" `Aisha said, \"I vow to Allah that I will never speak toIbnAz-Zubair.\" When this \ndesertion lasted long, `AbdullahbinAz-Zubairsought intercession with her, but she said, \"By Allah, I \nwill not accept the intercession of anyone for him, and will not commit a sin by breaking my vow.\" \nWhen this state of affairs was prolonged onIbnAz-Zubair(he felt it hard on him), he said toAl- \nMiswarbinMakhrama and `Abdur-RahmanbinAl-Aswadbin'Abu Yaghuth, who were from the tribe \nof Bani Zahra, \"I beseech you, by Allah, to let me enter upon `Aisha, for it is unlawful for her to vow \nto cut the relation with me.\" \nSoAl-Miswar and `Abdur-Rahman, wrapping their sheets around themselves, asked `Aisha's \npermission saying, \"Peace and Allah's Mercy and Blessings be upon you! Shall we come in?\" `Aisha \nsaid, \"Come in.\" They said, \"All of us?\" She said, \"Yes, come in all of you,\" not knowing thatIbnAz-Zubairwas also with them. So when they entered,IbnAz-Zubairentered the screened place and got \nhold of `Aisha and started requesting her to excuse him, and wept.Al-Miswar and `Abdur Rahman \nalso started requesting her to speak to him and to accept his repentance. \nThey said (to her), \"The Prophet forbade what you know of deserting (not speaking to your Muslim \nBrethren), for it is unlawful for any Muslim not to talk to his brother for more than three nights \n(days).\" So when they increased their reminding her (of the superiority of having good relation with \nKith and kin, and of excusing others' sins), and brought her down to a critical situation, she started \nreminding them, and wept, saying, \"I have made a vow, and (the question of) vow is a difficult one.\" \nThey (Al-Miswar and `Abdur-Rahman) persisted in their appeal till she spoke with `AbdullahbinAz-Zubairand she manumitted forty slaves as an expiation for her vow. Later on, whenever she \nremembered her vow, she used to weep so much that her veil used to become wet with her tears."
        },
        {
          "body": "It was narrated from Zirr that It was said to `Ali (رضي الله عنه):The killer of az-Zubairis at the door. ‘Ali said: The killer of the son of Safiyyah will certainly enter the Fire. I heard the Messenger of Allah (ﷺ) say: `Every Prophet (ﷺ) has a disciple and my disciple is az-Zubairbinal-Awwam.`"
        },
        {
          "body": "Narrated QasimbinMuhammad and SulaimanbinYasar:that YahyabinSa`idbinAl-`As divorced the daughter of `Abdur-RahmanbinAl-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to MarwanbinAl-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-RahmanbinAl-Hakam did not obey me (or had a convincing \nargument).\" (InAl-Qasim's versions Marwan said, \"Have you not heard of the case of FatimabintQais?\" Aisha said, \"The case of FatimabintQais is not in your favor.' MarwanbinAl-Hakam said to \n`Aisha, \"The reason that made FatimabintQais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\""
        },
        {
          "body": "AbdullahbinAz-ZubairbinAl-Awwam narrated from his father who said:“When the following was revealed: Then on that Day, you shall be asked about the delights!’ Az-Zubairsaid: ‘O Messenger of Allah! Which are the delights that we will be asked about, when they (delights) are but the two black things: dates and water?’ He said: ‘But it is what shall come.’”"
        },
        {
          "body": "Yahya related to me from Malik from Abu'z-Zubayral-Makki from\nAtaibnAbi Rabah that AbdullahibnAbbas was asked about a man who\nhad had intercourse with his wife while at Mina before he had done the\ntawafal-ifada, and he told him to sacrifice an animal."
        },
        {
          "body": "Jabir is reported to have said:A person amongst the Ansar who had no other property declared a slave free after his death. Allah's Messenger (may peace be upon him) sold him, andIbnal-Nahham bought him and he was a Coptic slave (who) died in the first year of the Caliphate ofIbnZubair."
        },
        {
          "body": "Narrated 'Aamirbin'Abdullahbinaz-Zubairon the authority of his father:Allah's Messenger (SAW) said, \"Make marriage publicly known.\"\n\n[Reported by Ahmad andal-Hakim graded it Sahih (authentic)]."
        },
        {
          "body": "NarratedIbnAz-Zubair:I heard `Umar saying, \"The Prophet said, 'Whoever wears silk in this world, shall not wear it in the \nHereafter.\"This hadith is also narrated through 'Umaribnal-Khattab."
        },
        {
          "body": "Narrated 'AlibinAbi Talib [may Allah be pleased with him]:that the Messenger of Allah (SAW) said: \"Indeed, every Prophet has a Hawari, and my Hawari is Az-ZubairbinAl-'Awwam.\""
        },
        {
          "body": "'Awfibnal-Harithibnat-Tufayl, the nephew of 'A'isha, reported\nthat 'A'isha was told that 'Abdullahibnaz-Zubayrhad said about something\nwhich 'A'isha was selling - or giving away as a gift, \"By Allah, if\nshe does not stop, I will debar her from disposing of her property!\" She\nasked, \"Is that truly so?\" \"Yes,\" they replied. 'A'isha exclaimed, \"I vow\nto Allah that I will never again speak a single word toIbnaz-Zubayr!\" When this desertion lasted long, 'AbdullahbinAz-Zubairsought intercession from the Mahajireen with her, but she said:\"By Allah I will not ever accept the intercession of anyone for him, and I will not ever break my vow that I have vowed.\" When it went on long forIbnAz-Zubair, he spoke toAl-MiswarbinMakhramah and 'Abdur-RahmanbinAl-AswadbinYaghut and they were from Bani Zuhrah. So he said to them: \"I beseech you in the Name of Allah that you enter me upon (the place of) 'Aishah because it is unlawful for her to vow to sever relations with me.\" SoAl-Miswar and 'Abdur-Rahman approached with him under their upper garments until they sought her permission, saying: \"As-salamu 'alaiki wa rahmatullahi wa barakatuhu! Shall we come in?\" 'Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us, o mother of the believers?\" She said: \"Yes all of you,\" and she did know thatIbnAz-Zubairwas with them. So, when they entered,IbnAz-Zubairentered the screened place and hugged 'Aishah (May Allah be pleased with her) and began beseeching her and wept. AndAl-Miswar and 'Abdur-Rahman began to plead her to but speak to him and to accept from him, also saying to her: \"You know that the Messenger Allah ﷺ forbade what you know of abandonment and that it is not permissible for a man to abandon his brother over three nights.\" He said: So when they did a great deal of reminding and urging, she began remind them and weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with 'AbdullahbinAz-Zubair. Then she freed forty slaves as an expiation for breaking her vow. Later on she would remember, after freeing forty slaves, then she would weep so much that her veil would become wet with tears."
        },
        {
          "body": "NarratedIbnAz-Zubair:Jabir said, \"We were with the Prophet at Nakhl,\" and then he mentioned the \nFear prayer. \nNarratedAl-QasimbinMuhammad: The Prophet offered the Fear prayer in the Ghazwa of Banu \nAnmar."
        },
        {
          "body": "Narrated `AbdullahbinAz-Zubair:When Az-Zubairgot up during the battle ofAl-Jamal, he called me and I stood up beside him, and he \nsaid to me, \"O my son! Today one will be killed either as an oppressor or as an oppressed one. I see \nthat I will be killed as an oppressed one. My biggest worry is my debts. Do you think, if we pay the \ndebts, there will be something left for us from our money?\" Az-Zubairadded, \"O my son! Sell our \nproperty and pay my debts.\" Az-Zubairthen willed one-third of his property and willed one-third of \nthat portion to his sons; namely, `Abdullah's sons. He said, \"One-third of the one third. If any property \nis left after the payment of the debts, one-third (of the one-third of what is left) is to be given to your \nsons.\" (Hisham, a sub-narrator added, \"Some of the sons of `Abdullah were equal in age to the sons of \nAz-Zubaire.g. Khubaib and `Abbas. `Abdullah had nine sons and nine daughters at that time.\" (The \nnarrator `Abdullah added:) My father (Az-Zubair) went on drawing my attention to his debts saying, \n\"If you should fail to pay part of the debts, appeal to my Master to help you.\" By Allah! I could not \nunderstand what he meant till I asked, \"O father! Who is your Master?\" He replied, \"Allah (is my \nMaster).\" \nBy Allah, whenever I had any difficulty regarding his debts, I would say, \"Master of Az-Zubair! Pay \nhis debts on his behalf .\" and Allah would (help me to) pay it. Az-Zubairwas martyred leaving no \nDinar or Dirham but two pieces of land, one of which was (called)Al-Ghaba, and eleven houses in \nMedina, two in Basra, one in Kufa and one in Egypt. In fact, the source of the debt which he owed \nwas, that if somebody brought some money to deposit with him. Az-Zubairwould say, \"No, (i won't \nkeep it as a trust), but I take it as a debt, for I am afraid it might be lost.\" Az-Zubairwas never \nappointed governor or collector of the tax of Kharaj or any other similar thing, but he collected his \nwealth (from the war booty he gained) during the holy battles he took part in, in the company of the \nProphet, Abu Bakr, `Umar, and `Uthman. (`AbdullahbinAz-Zubairadded:) When I counted his debt, \nit turned to be two million and two hundred thousand. (The sub-narrator added:) HakimbinHizam \nmet `AbdullahbinZubairand asked, \"O my nephew! How much is the debt of my brother?\" \n`Abdullah kept it as a secret and said, \"One hundred thousand,\" Hakim said, \"By Allah! I don't think \nyour property will cover it.\" On that `Abdullah said to him, \"What if it is two million and two hundred \nthousand?\" \nHakim said, \"I don't think you can pay it; so if you are unable to pay all of it, I will help you.\" Az-Zubairhad already boughtAl-Ghaba for one hundred and seventy thousand. `Abdullah sold it for one \nmillion and six hundred thousand. Then he called the people saying, \"Any person who has any money \nclaim on Az-Zubairshould come to us inAl-Ghaba.\" There came to him `AbdullahbinJa`far whom \nAz-Zubairowed four hundred thousand. He said to `AbdullahbinAz-Zubair, \"If you wish I will \nforgive you the debt.\" `Abdullah (binAz-Zubair) said, \"No.\" ThenIbnJa`far said, \"If you wish you \ncan defer the payment if you should defer the payment of any debt.\"IbnAz-Zubairsaid, \"No.\" \n`AbdullahbinJa`far said, \"Give me a piece of the land.\" `AbdullahbinAzZubair said (to him), \n\"Yours is the land extending from this place to this place.\" So, `AbdullahbinAz-Zubairsold some of \nthe property (including the houses) and paid his debt perfectly, retaining four and a half shares from \nthe land (i.e.Al-Ghaba). He then went to Mu'awlya while `Amrbin`Uthman,Al-MundhirbinAz-ZubairandIbnZam`a were sitting with him. Mu'awiya asked, \"At what price have you appraisedAl- \nGhaba?\" He said, \"One hundred thousand for each share,\" Muawiya asked, \"How many shares have \nbeen left?\" `Abdullah replied, \"Four and a half shares.\"Al-MundhirbinAz-Zubairsaid, \"I would like to buy one share for one hundred thousand.\" `Amrbin`Uthman said, \"I would like to buy one share for one hundred thousand.\"IbnZam`a said, \"I would \nlike to buy one share for one hundred thousand.\" Muawiya said, \"How much is left now?\" `Abdullah \nreplied, \"One share and a half.\" Muawiya said, \"I would like to buy it for one hundred and fifty \nthousand.\" `Abdullah also sold his part to Muawiya six hundred thousand. WhenIbnAzZubair had \npaid all the debts. Az-Zubair's sons said to him, \"Distribute our inheritance among us.\" He said, \"No, \nby Allah, I will not distribute it among you till I announce in four successive Hajj seasons, 'Would \nthose who have money claims on Az-Zubaircome so that we may pay them their debt.\" So, he started \nto announce that in public in every Hajj season, and when four years had elapsed, he distributed the \ninheritance among the inheritors. Az-Zubairhad four wives, and after the one-third of his property \nwas excluded (according to the will), each of his wives received one million and two hundred \nthousand. So the total amount of his property was fifty million and two hundred thousand."
        },
        {
          "body": "Narrated Abu Az-Zubair:From Jabir that the Prophet (saws) prohibitedAl-Muhaqalah,Al-Muzabanah,Al-Mukhabarah, andAl-Mu'awamah, and he permitted it in the case ofAl-'Araya.[Abu 'Eisa said:] This Hadith is Hasan Sahih."
        },
        {
          "body": "Abu Khubaib 'AbdullahbinAz-Zubair(May Allah bepleased with them) reported:When Az-Zubair, got ready to fight in the battle ofAl- Jamal, he called me and said: \"My son, whoever is killed today will be either a wrongdoer or a wronged one. I expect that I shall be the the wronged one today. I am much worried about my debt. Do you think that anything will be left over from our property after the payment of my debt? My son, sell our property and pay off my debt.\" Az-Zubairthen willed one-third of that portion to his sons; namely 'Abdullah's sons. He said, \"One-third of the one-third. If any property is left after the payment of debts, one-third (of the one-third of what is left is to be given to your sons.\" (Hisham, a subnarrator added: \"Some of the sons of 'Abdullah were equal in age to the sons of Az-Zubair, e.g., Khubaib and Abbad. 'Abdullah had nine sons and nine daughters at that time)\". (The narrator 'Abdullah added:) He kept on instructing me about his debts and then said: \"My son, should you find yourself unable to pay any portion of my debt then beseech my Master for His help.\" By Allah, I did not understand what he meant and asked: \"Father, who is your Master?\" He said: \"Allah.\" By Allah! Whenever I faced a difficulty in discharging any portion of his debt; I would pray: \"O Master ofZubair, discharge his debt,\" and He discharged it.Zubairwas martyred. He left no money, but he left certain lands, one of them inAl-Ghabah, eleven houses inAl-Madinah, two in Basrah, one in Kufah and one in Egypt. The cause of his indebtedness was that a person would come to him asking him to keep some money of his in trust for him.Zubairwould refuse to accept it as a trust, fearing it might be lost, but would take it as a loan. He never accepted a governorship, or revenue office, or any public office. He fought along with Messenger of Allah (PBUH) and Abu Bakr, 'Umar and 'Uthman (May Allah be pleased with them).'Abdullah added: I prepared a statement of his debts and they amounted to two million and two hundred thousand! HakimbinHizam met me and asked me: \"Nephew, how much is due from my brother as debt?\" I kept it as secret and said: \"A hundred thousand.\" Hakim said: \"By Allah! I do not think your assets are sufficient for the payment of these debts.\" I said: \"What would you think if the amount were two million and two hundred thousand?\" He said: \"I do not think that you would be able to clear off the debts. If you find it difficult let me know.\"Az-Zubair(May Allah bepleased with him) had purchased the land inAl-Ghabah for a hundred and seventy thousand. 'Abdullah sold it for a million and six hundred thousand, and declared that whosoever had a claim against Az-Zubair(May Allah bepleased with him) should see him inAl-Ghabah. 'AbdullahbinJa'far (May Allah bepleased with him) came to him and said: \"Az-Zubair(May Allah bepleased with him) owed me four hundred thousand, but I would remit the debt if you wish.\" 'Abdullah (May Allah bepleased with him) said: \"No.\"IbnJa'far said: ''If you would desire for postponement I would postpone the recovery of it.\" 'Abdullah said: \"No.\"IbnJa'far then said: \"In that case, measure out a plot for me.\" 'Abdullah marked out a plot. Thus he sold the land and discharged his father's debt. There remained out of the land four and a half shares. He then visited Mu'awiyah who had with him at the time 'Amrbin'Uthman,Al-MundhirbinAz-ZubairandIbnZam'ah (May Allah bepleased with them). Mu'awiyah (May Allah bepleased with him) said: \"What price did you put on the land inAl-Ghabah?\" He said: \"One hundred thousand for a each share. Mu'awiyah inquired: \"How much of it is left?\" 'Abdullah said: \"Four and a half shares.\"Al-MundhirbinAz-Zubairsaid: \"I will buy one share for a hundred thousand\". 'Amrbin'Uthman said: \"I will buy one share for a hundred thousand\".IbnZam'ah said: \"I will buy one share for a hundred thousand.\" Then Mu'awiyah asked: \"How much of it is now left?\" 'Abdullah said: \"One and a half share. Mu'awiyah said: \"I will take it for one hundred and fifty thousand.\" Later 'AbdullahbinJa'far sold his share to Mu'awiyah for six hundred thousand.When 'AbdullahbinAz-Zubair(May Allah bepleased with him) finished the debts, the heirs of Az-Zubair(May Allah bepleased with him) asked him to distribute the inheritance among them. He said: \"I will not do that until I announce during four successive Hajj seasons: 'Let he who has a claim against Az-Zubaircome forward and we shall discharge it.\"' He made this declaration on four Hajj seasons and then distributed the inheritance among the heirs of Az-Zubair(May Allah bepleased with him) according to his will. Az-Zubair(May Allah bepleased with him) had four wives. Each of them received a million and two hundred thousand. Thus Az-Zubair's total property was amounted to fifty million and two hundred thousand.[Al-Bukhari]"
        },
        {
          "body": "It was narrated from Anas that:The Messenger of Allah [SAW] granted a concession to 'Abdur-Rahmanbin'Awf and Az-ZubairbinAl-'Awwam allowing them to wear silken shirts because of scabies that they were suffering from."
        },
        {
          "body": "Bintal-Harith b.al-Nu'man said:I memorized Surahal-Qaf from the mouth of the Messenger of Allah (saws); he would recite it in his speech on every friday. Our oven and his oven were same.Abu Dawud said: Rawh b. 'Ubadah reported on the authority of Shu'bah the nameBintHarithah b.al-Nu'man ; andIbnIshaq reported the name of Umm Hisham hint Harithah b.al-Nu'man."
        },
        {
          "body": "Az-Zubairbin'Adi said:We went to AnasbinMalik (May Allah be pleased with him) and complained to him of suffering at the hands ofAl-Hajjaj. He replied: \"Show endurance, for no time will come but will be followed by one worse (than the present one) till you meet your Rubb. I heard this from your Prophet (PBUH)\".[Al- Bukhari]."
        },
        {
          "body": "Narrated Abu MusaAl-Ash'ari:That the Messenger of Allah (saws) said: \"Wearing silk and gold has made unlawful for the males of my Ummah and lawful for its females.[Abu 'Eisa said:] There are narrations on this topic from 'Umar, 'Ali, 'Uqbahbin'Amir, Anas, Umm Hani, Hudhaifah, 'Abdullahbin'Amr, 'ImranbinHusain, 'AbdullahbinAz-Zubair, Jabir, Abu Raihanah,Ibn'Umar,Al-Bara', and WathilahbinAl-Asqa', and this Hadith is Hasan Sahih."
        },
        {
          "body": "Abual-Zubairsaid:'Abd Allah b.al-Zubairused to recite this supplication after each (prescribed) prayer. He then narrated a similar supplication and added to it: \"There is no might and no power except in Allah; there is no god but Allah Whom alone we worship. To Him belongs wealth.\" The narrator then transmitted the rest of tradition."
        },
        {
          "body": "Narrated 'Abdullahbinaz-Zubair(RA):Allah's Messenger (SAW) ruled that the two opposing parties in a dispute should sit in front of the judge.\n\n[Reported by Abu Dawud.al-Hakim graded it Sahih (authentic)]."
        },
        {
          "body": "It was narrated from az-Zubairbinal-`Awwam that a man gave a mare called Ghamrah or Ghamra` [for jihad], then he found a horse or a colt for sale which was said to be from that mare, but he was told not to buy it."
        },
        {
          "body": "Abdullahbinaz-Zubairsaid:I heard 'Umarbinal-Khattab  رضي الله عنه say in his khutbah that he heard the Messenger of Allah ﷺ  say: ` Whoever wears silk in this world will not be clothed with it in the Hereafter.`"
        },
        {
          "body": "IbnAbbas narrated:\"Duba'ahbintAz-Zubaircame to the prophet and said: 'O Messenger of Allah! I want to perform Hajj so should I state a condition?' He said: 'Yes.' She asked: 'So how should I say it?' He said: 'Say; \"Labbaik Allahumma labbaika mahilli minal Ard haithu tahbisuni (I respond to Your call O Allah, I respond to Your call, I will exit Ihram any where on the earth where You prevent me.\""
        },
        {
          "body": "Yahya related to me from Malik from Abu'z-Zubayral-Makki that\nsomebody asked a man for his sister in marriage and the man mentioned\nthat she had committed fornication. Umaribnal-Khattab heard about it\nand he beat the man or almost beat him, and said, \"What did you mean\nby giving him such information?\""
        },
        {
          "body": "Ibn'Umar said:A boy was assassinated. 'Umar said, \"If all the people of San'a took part in the assassination I would kill them all.\"Al-MughirabinHakim said that his father said, \"Four persons killed a boy, and 'Umar said (as above).\"Abu Bakr,IbnAz-Zubair, 'Ali and SuwaidbinMuqarrin gave the judgement ofAl-Qisas (equality in punishment) in cases of slapping. And 'Umar carried outAl-Qisas for a strike with a stick. And 'Ali carried outAl-Qisas for three lashes with a whip. And Shuraih carried out for one last and for scratching."
        },
        {
          "body": "Narrated 'UrwahbinAz-Zubair:that 'AbdullahbinAz-Zubairnarrated to him: \"A man from the Ansar was arguing with Az-Zubairabout a stream atAl-Harrah with which they irrigated their date-palms. So the Ansari man said: 'Let the water pass through.' But he refused, so they brought their dispute to the Messenger of Allah (SAW). So the Messenger of Allah (SAW) said to Az-Zubair: 'OZubair! Water and let the water flow to your neighbor.' The Ansari got angry and said: 'O Messenger of Allah! Is it because he is your nephew?' The face of the Messenger of Allah (SAW) changed. Then he said: 'OZubair! Water and withhold the water until until it flows over your walls.' So Az-Zubairsaid: 'By Allah, I think this Ayah was revealed about that incident: But no, by your Lord! They can have no faith until they make you judge in all disputes between them... (4:65)\""
        },
        {
          "body": "Narrated Anas:The Messenger of Allah (saws) gave license to 'Abdal-Rahman b. 'Awf andal-Zubairb.al-'Awwam to wear silk shirts during a journey because of an itch which they had."
        },
        {
          "body": "It was narrated from Az-ZubairbinAl-'Awwam that:He disputed with a man among Ansar who had been present at Badr with the Messenger of Allah [SAW], concerning a stream inAl-Harrah from which they both used to water their date palm trees. The Ansari said: \"Let the water flow.\" But he (Az-Zubair) refused. The Messenger of Allah [SAW] said: \"Irrigate (your land), OZubair! Then let the water flow to your neighbor.\" The Ansari became angry and said, \"O Messenger of Allah, is it because he is your cousin?\" The face of the Messenger of Allah [SAW] changed color (because of anger) and he said: \"OZubair! Irrigate (your land) then block the water, until it flows back to the walls.\" So the Messenger of Allah [SAW] allowed Az-Zubairto take his rights in full, although before that he had suggested to Az-Zubaira middle way that benefited both him and the Ansari. But when the Ansari made the Messenger of Allah [SAW] angry, he gave Az-Zubairhis rights in full, as stated clearly in his ruling. Az-Zubairsaid: \"I think that this Verse was revealed concerning this matter: 'But no, by your Lord, they can have no faith, until they make you (O Muhammad) judge in all disputes between them.'\""
        },
        {
          "body": "Narrated AbuAl-Aswad :From 'Urwah [binAz-Zubair], and SulaimanbinYasar, that they reported to him from Abu Hurairah that the Prophet (saws) said: \"Whoever fasts a day in the cause of Allah, Allah shall distance him from the Fire by seventy autumns.\" One of them said \"seventy\" and the other said: \"forty\".[Abu 'Eisa said:] This Hadith is a Gharib Hadith from this route. AbuAl-Aswad's name is Muhammadbin'Abdur-RahmanbinNawfalAl-AsadiAl-Madani.There are narrations on this topic from Abu Sa'eed, Anas, 'Uqbahbin'Amir, and Abu Umamah"
        },
        {
          "body": "Anas (May Allah be pleased with him) reported:The Messenger of Allah (PBUH) permittedZubairand `Abdur-Rahmanbin`Auf (May Allah be pleased with them) to wear silk because they were suffering from an itch.[Al-Bukhari and Muslim]."
        },
        {
          "body": "Yahya related to me from Malik that Abu'zZubayral-Makki said,\n\"I saw AbdullahibnAbbas doing tawaf after asr. Then he went into his\nroom and I do not know what he did.\""
        },
        {
          "body": "It was narrated that Abu Maslamah said:\"I heard 'Abdul-'Aziz - that is,binAsid At-Tahi fromAl-Basrah - say: 'IbnAz-Zubairwas asked about soaking (fruits) in earthenware jars and he said: \"The Messenger of Allah [SAW] forbade us from that.\""
        },
        {
          "body": "Abdur RahmanibnAyman, the client of Urwah, askedIbnUmar and Abual-Zubayrwas was listening:What do you think if a man divorces his wife while she is menstruating? He said: AbdullahibnUmar divorced his wife while she was menstruating during the time of the Messenger of Allah (saws).So Umar asked the Messenger of Allah (saws) saying: AbdullahibnUmar divorced his wife while she was menstruating. Abdullah said: He returned her to me and did not count it (the pronouncement) anything. He said: When she is purified, he may divorce her or keep her with him.IbnUmar said: The Prophet (saws) recited the Qur'anic verse: O Prophet, when you divorce women, divorce them in the beginning of their waiting period.\"Abu Dawud said: This tradition has been narrated by Yunus b. Jubair, Anas b. Sirin b. Jubair, Zaid b. Aslam, Abual-Zubairand Mansur from Abu Wa'il on the authority ofIbn'Umar. They all agreed on the theme that the Prophet (saws) commanded him to take her back (and keep her) till she was purified. Then if he desired, he might divorce her or keep her with him if he wanted to do so. The version narrated byal-Zuhri from Salim from Nafi' on the authority ofIbn'Umar has: The Prophet (saws) commanded him to take her back (and keep her) till she is purified, and then has menstrual discharge, and then she is purified. Then if he desires, he may divorce her and if he desires he may keep her.Abu Dawud said: A version like that of Nafi' andal-Zuhri has also been transmitted by 'Ataal-Khurasani fromal-Hasan on the authority ofIbn'Umar. All the versions of this tradition contradict the one narrated by Abual-Zubair."
        },
        {
          "body": "Yahya related to me from Malik that IbrahimibnUqba asked Saidibnal-Musayyab about suckling. Said said, \"All that occurs in the\nfirst two years, even if it is only a drop, makes haram. Whatever is\nafter two years, is only food that is eaten.\"IbrahimibnUqba said, ''Then I asked Urwaibnaz-Zubayrand he told me the same\nas what Saidibnal-Musayyab said.\""
        },
        {
          "body": "Yahya related to me from Malik from Nafi that SafiyyabintAbi\nUbayd told him that Hafsa, ummal-muminin, sent AsimibnAbdullahibnSad to her sister FatimabintUmaribnal-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her."
        },
        {
          "body": "It was narrated fromZubairbin'Awwam that:he was married to Umm Kulthumbint'Uqbah, and she said to him when she was pregnant. \"I will accept one divorce.\" So he divorced her once. Then he went out for prayer, and when he came back she had given birth. He said: \"What is wrong with her? She misled me may Allah mislead her!\" Then he came to the Prophet (SAW), who said: \"Her waiting period is over (and she is divorced); propose marriage a new to her.\""
        },
        {
          "body": "Narrated Hishambin'Urwah:\"On the Day of (the battle of)Al-Jamal, Az-Zubairexhorted his son 'Abdullah, saying: 'There is not a part of me except that it has been injured while with the Messenger of Allah (SAW),' until that ended with his private parts."
        },
        {
          "body": "It was narrated from’`Amirbin‘Abdullahbinaz-Zubair(رضي الله عنه) that his father said:I said to my father, az-Zubairbinal-Awwam (رضي الله عنه): “Why don`t you narrate from the Messenger of Allah (ﷺ).” He said: “I never left him since I became Muslim, but I heard him say something. He said: Whoever tells a lie about me, let him take his place in Hell.`"
        },
        {
          "body": "Al-AswadbinYazid narrated that:IbnAz-Zubairsaid to him: \"Narrated to me from what the Mother of the Believers used to (secretly) inform you about\" - meaning Aishah - so he said: \"She narrated to me that the Messenger of Allah said: 'Had your people not been still close to the pre-Islamic period of ignorance, then I would demolish the Ka'bah and rebuild it with two doors.'\" He said: \"So whenIbnAz-Zubaircame to power he demolished it and rebuilt it with two doors.\""
        },
        {
          "body": "Az-ZubairbinAl-Awwam (RAA) narrated that The Messenger of Allah (P.B.U.H.) said, “It is better for any of you to take a rope and cut some wood (from the forest) and carry it over his back and sell it, to preserve his dignity (as he is earning his own living), rather than ask a person for something and that person may give him or not.” Related byAl-Bukhari."
        }
      ]
    }
  ]
}