{
  "data": [
    {
      "hadith": [
        {
          "body": "Narrated Anas [may Allah be pleased with him]:that the Prophet (SAW) said: \"Sufficient for you among the women of mankind are Mariambint'Imran, KhadijahbintKhuwailid, FatimahbintMuhammad and Asiyah the wife of Fir'awn.\""
        },
        {
          "body": "Anas bin Malik narrated that:Abu Bakr Siddiq wrote to him: “In the name of Allah, the Most Gracious, the Most Merciful. This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah. The ages of camels to be given (in Zakat) may be made up in sheep. So if a man has camels on which the Sadaqah is a Jadha'ah (a four-year-old she-camel) and he does not have a Jadha'ah but he has a Hiqqah (a three year old she-camel), then the Hiqqah should be accepted from him, and two sheep should be given (in addition), if they are readily available, or twenty Dirham. If a man has camels on which the Sadaqah is a Hiqqah, and he only has a Bin Labun( a two-year-old she-camel), then theBintLabun should be accepted from him, along with two sheep or twenty Dirhams.If a man has camels on which the sadaqah is aBintLabun, and he does not have one, but he has a Hiqqah, then it should be accepted from him, and the Zakat collector should give him back twenty Dirham or two sheep. If a man has camels on which Sadaqah is aBintLabun, and he does not have one, but he has aBintMakhad(a one-year-old she-camel), then theBintMakhad should be accepted from him, along with twenty Dirham or two sheep. If a man has camels on which the Sadaqah is aBintMakhad, and he does not have one, but he has aBintLabun, then theBintLabun should be accepted from him, and the Zakat collector should give him back twenty Dirhams or two sheep. Whoever does not have aBintMakhad, but he has aBintLabun (a two-year-old male camel), then it should be accepted from him and nothing else should be given along with it.' ”"
        },
        {
          "body": "In Mas'ud said:\"The Messenger of Allah ruled that the Diyah for accidental killing is twentyBintMakhad, twenty Bin Makhad, twentyBintLabur, twenty Jadh'ah, and twenty Hiqqah.\""
        },
        {
          "body": "Narrated 'Ali bin Abi Talib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "Narrated Ibn Mas'ud:\"The Messenger of Allah (saws) judged for the accidental blood-Money: TwentyBintMakhad, twenty make Ibn Makhad, twentyBintLabunm twenty Jadha'ah, and twenty Hiqqah.\n\n(Another chain) with similar meaning."
        },
        {
          "body": "It was narrated from Yahya bin Sa'eed, from 'Amrahbint'Abdur-Rahman, that she told him about HabibahbintSahl:\"She was married to Thabit bin Qais bin Shammas. The Messenger of Allah went out to pray As-Subh and he found HabibahbintSahl at his door at the end of the night. The Messenger of Allah said: 'Who is this?' She said: 'I am HabibahbintSahl, O Messenger of Allah.' He said: 'What is the matter?' She said: 'I cannot live with Thabit bin Qais' -her husband. When Thabit bin Qais came, the Messenger of Allah said to him: 'Here is HabibahbintSahl and she has said what Allah willed she should say.' Habibah said: 'O Messenger of Allah, everything that he gave me is with me.' The Messenger of Allah said: 'Take it from her.' So he took it from her and she stayed with her family.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of AsmabintAbi Bakr as-Siddiq.\"20.7 Wearing\nPerfume during Hajj."
        },
        {
          "body": "Narrated FatimabintAl-Mundhir:Whenever a lady suffering from fever was brought to Asma'bintAbu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order \nus to abate fever with water.\""
        },
        {
          "body": "It was\nnarrated from Abu Bakr bin ‘Abdullah bin Zubair from his\ngrandmother – he (the narrator) said:“I do not know if it was\nAsma’bintAbu Bakr or Su’dabint‘Awf’ – that the\nMessenger of Allah (saw)\nentered upon Duba’ahbint‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from ZaynabbintAbu Salama that she saw ZaynabbintJahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray."
        },
        {
          "body": "It was narrated that:that Abu Sa'eed Al-Khudri said: “The Messenger of Allah said: 'There is no Sadaqah on any less then five camels, or for four. If the number of camels reaches five then one sheep must be given, up to nine. If the number reaches ten, then two sheep must be given, up to fourteen. If the number reaches fifteen, then three sheep must be given, up to nineteen. If the number reaches twenty, then four sheep must be given, up to twenty-four. If the number reaches twenty-five, then aBintMakhad (a one year old she-camel), must be given up to thirty-five; if there is notBintMakhad, then a Bin Labun (a two-year-old male camel). If there are more camels then aBintLabun (a two-year-old she-camel) up to forty-five. If there are more camels then a Hiqqah (a three-year-old she-camel) must be given up to sixty. If there are more camels then a Jadha'ah (a five-year-old she-camel) must be given up to seventy-five. If there are more camels, then twoBintLabun must be given, up to ninety. If there are more camels, then two Hiqqah must be given, up to one hundred and twenty. The for each fifty, one Hiqqah, and for each forty, aBintLabun.' ”"
        },
        {
          "body": "It was narrated from SafiyyahbintAbi 'Ubaid that she heard Hafsahbint'Umar, the wife of the Prophet, (narrate) that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "'Aishah narrated:\"When this Ayah was revealed: And warn your near kindred....(26:214), the Messenger of Allah (s.a.w) said:\n\"O Safiyyahbint'Abdul-Muttalib! O FatimahbintMuhammed! O Banu 'Abdul-Muttalib! I have no authority on your behalf over Allah for anything. Ask me for whatever you want of my wealth.\""
        },
        {
          "body": "Narrated Anas:Abu Bakr wrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who \nhad to pay oneBintMakhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had gotBintLabun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the \ncollector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not aBintMakhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he \nwould not be paid anything ."
        },
        {
          "body": "Yahya related. to me from Malik from Yahya ibn Said that AmrabintAbd ar-Rahman told him from HabibabintSahl al-Ansari that she\nhad been the wife of Thabit ibn Qays ibn Shammas. The Messenger of\nAllah, may Allah bless him and grant him peace, went out for the dawn\nprayer, and found HabibabintSahl at his door in the darkness. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nher, \"Who is this?\" She said, \"I am HabibabintSahl, Messenger of\nAllah.\" He said, \"What do you want?\" She said, \"That Thabit ibn Qays\nand I separate.\" When her husband, Thabit ibn Qays came, the Messenger\nof Allah, may Allah bless him and grant him peace, said to him, \"This\nis HabibabintSahl. She mentioned what Allah willed that she\nmention.\" Habiba said, \"Messenger of Allah, all that he has given me\nis with me!\" The Messenger of Allah, may Allah bless him and grant him\npeace, said to Thabit ibn Qays, \"Take it from her,\" and he took it\nfrom her, and she stayed in the house of her family."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir told him that she used to see AsmabintAbi Bakrat\nMuzdalifa telling whoever led the subh prayer for her and her\ncompanions to pray it as soon as the dawn broke, after which she would\nmount and go to Mina without stopping at all."
        },
        {
          "body": "Narrated 'Aishah:\"When this Ayah was revealed: 'And warn your tribe of near kindred (26:214).' The Messenger of Allah (SAW) said: 'O Safiyyahbint'Abdul-Muttalib! O FatimahbintMuhammad! O Banu 'Abdul-Muttalib! I have no power to help you at all before Allah! Ask of me whatever you want from my wealth.'\""
        },
        {
          "body": "Ibn Shihab narrated from Salim bin Abdullah, from his father, from the Prophet(saw):Ibn Shihab said: “Salim read to me a letter that the Messenger of Allah had written concerning Sadaqat, before Allah caused him to pass away, in which it was said: 'For five camels one sheep; for ten, two sheep; for twenty, four sheep. For twenty five, aBintMakhad(a one year old she-camel), up to thirty-five; if there is noBintMakhad, then a Bin Labun ( a two-year-old male camel). If there are more than thirty-five even one, then aBintLabun ( a two-year-old she-camel) must be given up to forty-five. If there are more than forty-five, even one, then a Hiqqah (a three-year-old she-camel), up to sixty camels. If there are more than sixty, even one more, then a Jadha'ah ( a four-year-old she-camel) must be given, up to seventy-five. If there are more than seventy-five, even one more, then twoBintLabun must be given, upto ninety. If there are more than ninety, even one more, then two Hiqqah must be given, up to one hundred and twenty. If there are many camels, then for each fifty, one Hiqqah must be given and for each forty aBintLabun' ”"
        },
        {
          "body": "Narrated Anas:Abu Bakr , wrote to me about the Zakat which Allah had ordered His Apostle to observe: Whoever \nhad to pay Jahda (Jahda means a four-year-old she-camel) as Zakat from his herd of camels and he \nhad not got one, and he had Hiqqa (three-year-old she-camel), that Hiqqa should be accepted from \nhim along with two sheep if they were available or twenty Dirhams (one Durham equals about 1/4 \nSaudi Riyal) and whoever had to pay Hiqqa as Zakat and he had no Hiqqa but had a Jadha, the Jadha \nshould be accepted from him, and the Zakat collector should repay him twenty Dirhams or two sheep; \nand whoever had to pay Hiqqa as Zakat and he had not got one, but had aBintLabun (two-year-old \nshe-camel), it should be accepted from him along with two sheep or twenty Dirhams; and whoever \nhad to payBintLabun and had a Hiqqa, that Hiqqa should be accepted from him and the Zakat \ncollector should repay him twenty Dirhams or two sheep; and whoever had to payBintLabun and he \nhad not got one but had aBintMakhad (one-year-old she camel), thatBintMakhad should be \naccepted from him along with twenty Dirhams or two sheep."
        },
        {
          "body": "Narrated ZainabbintSalama:Um Habiba said to Allah's Apostle \"We have heard that you want to marry DurrabintAbu-Salama.\" \nAllah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not \nmarried Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\""
        },
        {
          "body": "It was narrated from Anas bin Malik that Abu Bakar, may Allah be pleased with him, wrote to him:\"This is the obligation of Sadaqah which  the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah Whoever is asked for it in the manner explained (in the letter of Abu Bakar), let him give it, and whoever is asked for more than that, let him not give it. When there are less than twenty-five camels, for every five camels, one sheep (is to be given). If the number reaches twenty-five, then aBintMakhad (a one-year-old she-camel) is due, up to thirty-five. If aBintMakhad (a one-year-old male camel). If the number reaches thirty-six, then aBintLabun (a two-year-old she-camel) is due, up to forty five. If the number reaches forty-six, then a Hiqqah (a three year old she-camel) that was bred by a stallion camel is due, up to sixty. If the number reaches sixty-one, then a Jadh'ah (a four-year-old she-camel) is due, up to seventy-five. If the number reaches seventy-six, then twoBintLabun are due, up to ninety. If the number reaches ninety-one, then two Hiqqahs that have been bred by stallion camels are due, up to one hundred and twenty. If there are more than one hundred and twenty, then for every forty aBintLabun and for every fifty a Hiqqah. In the event that a person does not have a camel of the age specified according to the Sadaqah regulation, then if a person owes a Jadh'ah but he has a Hiqqah, then the Hiqqah should be accepted from him and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes a Hiqqah as Sadaqah but he only has a Jadh'ah, then it shold be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes a Hiqqah and does not have one but he has aBintLabun, it should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes aBintLabun as Sadaqah but he only has a Hiqqah, it should be accepted from him, and the Zakah collector should give him twenty Dirhams or two sheep. If a person owes aBintLabun as Sadaqah and he does not have aBintLabun, but he has aBintMakhad. It should be accepted from him, and he should give two sheep along with it, if they are available, or twenty Dirhams. If a person owes aBintMakhad as Sadaqah but he only has aBintLabun, a male, it shold be accepted from him and nothing else (need be given) with it. If a person has only four camels, then nothing is due on them, unless their owner wishes (to give something). With regard to the Sadaqah of grazing sheep, if there are forty then one sheep is due, up to one hundred and twenty. If there is one more than that, then two sheep are due, up to two hundred. If there is one more than that, then three sheep are due, up to three hundred. If there is one more than that, then for every hundred one sheep is due, and no decrepit or defecting sheep or male sheep should be taken as Sadaqah unless the Zakah collector wishes. Do not combine separate flocks or separate combined flocks for fear of Sadaqah, Each partner (who has a share in a combined flock) shold pay Sadaqah in proportion to his shares. If a man's flock is one less than forty sheep, then nothing is due from them unless their owner wishes. With regard to silver, one-quarter of one-tenth, and if there are only one hundred and ninety, nothing is due unless the owner wishes.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from Fatimabintal-Mundhir that whenever a woman who had a fever, was brought to\nAsmabintAbi Bakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\""
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Ata ibn\nAbi Rabah that a mawla of AsmabintAbi Bakr told him, \"We arrived at\nMina with AsmabintAbi Bakr at the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""
        },
        {
          "body": "FatimahbintQais narrated that :the Prophet said: \"Indeed there is a duty on wealth aside from Zakat.\""
        },
        {
          "body": "Anas bin Malik narrated:\"The Prophet had a banquet for SafiyyahbintHuyayy with Sawiq and dates.\""
        },
        {
          "body": "This hadith has been narrated on the authority of ZainabbintJahsh with a slight variation in the chain of transmitters."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that SafiyyabintAbi\nUbayd told him that Hafsa, umm al-muminin, sent Asim ibn Abdullah ibn\nSad to her sister FatimabintUmar ibn al-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her."
        },
        {
          "body": "It was narrated from 'Irak bin Malik that ZainabbintAbi Salamah told him, that Umm Habibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbi Salamah.\" The Messenger of Allah said: \"As a co-wife to Umm Salamah? Even if I were not married to Umm Salamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "Narrated 'Abdullah bin Hassan:that his grandmothers Safiyyahbint'Ulaibah and Dhuhaibahbint'Ulaibah narrated to him, from QailahbintMakhramah - and they were her wet nurses and Qailah was the grandmother of their father - his mother's mother - she said: \"We came to the Messenger of Allah (SAW)\" and she mentioned the Hadith in its entirety; \"until a man came when the sun had rose up, so he said: \"As-Salamu 'Alaika O Messenger of Allah!' So the Messenger of Allah (SAW) said: 'Wa 'Alaikas-Salamu Wa Rahmatullah' and upon him - meaning the Prophet (SAW) - were two tattered cloths, which had been dyed with saffron and had faded, and he had a small date-palm branch with him.\""
        },
        {
          "body": "Narrated AsmabintAbu Bakr:We slaughtered a horse (by Nahr) during the lifetime of the Prophet and ate it."
        },
        {
          "body": "It was narrated from FatimahbintQais that the Prophet said:\"The thrice-divorced woman is not entitled to provision and shelter.\""
        },
        {
          "body": "Narrated Asma'bintAbu Bakr:The Prophet ordered us to free slaves at the time of solar eclipses."
        },
        {
          "body": "Narrated Asma'bintAbu Bakr:We were ordered to free slaves at the time of lunar eclipses."
        },
        {
          "body": "It was narrated from 'Abdullah bin Masud that the Messenger of Allah (SAW) said:“The blood money of one who killed by mistake is twenty Hiqqah (three-year-old she camels), twenty Jadha'ah (four year old she camels), twentyBintMakhad (one year old she camel), twentyBintLabun (two year old she camels), and twenty Bani Makhad (one year old she camels).”"
        },
        {
          "body": "Narrated Asma'bintAbu Bakr:We slaughtered a horse (by Nahr) during the lifetime of Allah's Apostle and ate it."
        },
        {
          "body": "Narrated Um KhalidbintKhalid:I heard the Prophet seeking refuge with Allah from the punishment of the grave."
        },
        {
          "body": "It was narrated from Anas bin Malik that Abu Bakar wrote to them:\"This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah , the Mighty and Sublime, commanded the Messenger of Allah .Whoever is asked for it in the manner explained (in the letter of Abu Bakar), let him give it, and whoever is asked for more than that, let him not give it. When there are less than twenty-five camels, for every five camels, one sheep (is to be given). If the number reaches twenty five, then aBintMakhad (a one-year old she-camel) is due, up to thirty-five. If aBintMakhad is not available, then a Bin Labun (a two-year old male camel). If the number reaches thirty-six, then aBintLabun (a two-yer-old she-camel) is due, up to forty-five. If the number reaches forty-six, then a Hiqqqah (a three-year-old she-camel) that has been bred from a stallion camel is due, up to sixty. If the number reaches sixty-one, then a Jadhah (a four-year-old she-camel) is due, up to seventy-six, then twoBintLabuns (two-year-old she-camels0 are due, up to ninety. If the number reaches ninety-one, then two Hiqqahs (three-year-old she-camels) that have been bred from stallion camels are due, up to one hundred and twenty. If there are more than one hundred and twenty, then for every forty aBintLabun, and for every fifty a Hiqqah. In the event that a person does not have a camel of the age specified according to the Hiaqah regulations, then if a person owes a Jadhah as Sadaqah  but he does not have  a Jadhah, then a Hiqqah should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams, If he owes a Hiqqah as Sadaqah and he does not have Hiqqah but he has a Jadhah, then if should be accepted from him, and the Zakah collector should give him twenty Dirhams, or two sheep if they are available. If a person owes a Hiqqah as Sadaqah and he does not have one, but he has aBintLabun, it should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes aBintLabun as Sadaqah but he only has a Hiqaah, then it should be accepted from him and the Zakah collector should give him twenty Dirhams, or two sheep. If a person owes aBintLabun as Sadaqah but he only has aBintMakhad, then it should be accepted from him, and he should be accepted from him, and he should give two sheep along with it if they are available, or twenty Dirhams. If a person owes aBintMakhad as Sadaqah but he only has aBintLabun, a male; it should be accepted from him, and he does not have to give anything else along with it. If a person has only four camels he does not have to give anything unless their owner wants to. With regard to the Sadaqah on grazing sheep, if there are forty, then one sheep is due upon them, up to one hundred and twenty. If there is one more, then two sheep are due, up to two hundred. If there is one more, then three sheep are due, up to three hundred. If there are more than that, then for every hundred, one sheep is due. No feeble, defective or male sheep should be taken as Sadaqah unless the Zakah collector wishes. Do not combine separate flocks or separate combined flocks for fear of Sadaqah. Each partner (who has a share in a combined flock) should pay the Sadaqah in proportion to his shares. If a man's flock is one less than forty sheep, then nothing is due from them, unless their owner wishes. With regard to silver, one-quarter of one-tenth, and if there are only one hundred and ninety Dirhams, no Zakah is due unless the owner wishes.\""
        },
        {
          "body": "It was\nnarrated that Umm QaisbintMihsan said:“I brought a son of\nmine\nto the Prophet (saw), and I had pressed on an area of his throat\ndue\nto tonsillitis. He said: ‘Why do you poke your children with this\npressing?’ You should use this aloeswood, for in it there are seven\ncures. It should be inhaled for pustules in the throat, and given in\nthe side of the mouth for pleurisy.”\n\n(Another chain) from Umm QaisbintMihsan, from the Prophet (saw) with similar wording."
        },
        {
          "body": "Narrated ZainabbintUm Salama:When Um HabibabintAbi Sufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\""
        },
        {
          "body": "FatimabintQais narrated that:she heard him, meaning the Prophet say: “There is nothing due on wealth other then Zakat.”"
        },
        {
          "body": "Narrated Qasim bin Muhammad and Sulaiman bin Yasar:that Yahya bin Sa`id bin Al-`As divorced the daughter of `Abdur-Rahman bin Al-Hakarn. `Abdur- \nRahman took her to his house. On that `Aisha sent a message to Marwan bin Al-Hakam who was the \nruler of Medina, saying, \"Fear Allah, and urge your brother) to return her to her house.\" Marwan (in \nSulaiman's version) said, \"Abdur-Rahman bin Al-Hakam did not obey me (or had a convincing \nargument).\" (In Al-Qasim's versions Marwan said, \"Have you not heard of the case of FatimabintQais?\" Aisha said, \"The case of FatimabintQais is not in your favor.' Marwan bin Al-Hakam said to \n`Aisha, \"The reason that made FatimabintQais go to her father's house is just applicable to the \ndaughter of `Abdur-Rahman.\""
        },
        {
          "body": "Bintal-Harith b. al-Nu'man said:I memorized Surah al-Qaf from the mouth of the Messenger of Allah (saws); he would recite it in his speech on every friday. Our oven and his oven were same.Abu Dawud said: Rawh b. 'Ubadah reported on the authority of Shu'bah the nameBintHarithah b. al-Nu'man ; and Ibn Ishaq reported the name of Umm Hisham hint Harithah b. al-Nu'man."
        },
        {
          "body": "HamnabintJahsh said, \"The Prophet, may Allah bless him and grant\nhim peace, said, 'What is it, O person?'\""
        },
        {
          "body": "Asma'bintAbi Bakr (RAA) narrated, 'During the lifetime of the Prophet (PBUH), we slaughtered a horse and ate it.' Agreed upon."
        },
        {
          "body": "It was narrated from Rabi'bintMu'awwidh bin 'Afra' that:The Messenger of Allah performed ablution washing each part three times."
        },
        {
          "body": "It was narrated that Ar-Rubai'bintMu'awwidh bin 'Afra' said:\"The Messenger of Allah performed ablution and wiped his head twice.\""
        },
        {
          "body": "It was narrated that SafiyyahbintShaibah said:\"Aishah told me that the Messenger of Allah (SAW) said: 'There is no divorce and no manumission at the time of coercion.' \""
        },
        {
          "body": "BusrahbintSafwan narrated that :the Prophet said: \"Whoever touches his penis, then he is not to pray until he performs Wudu\""
        },
        {
          "body": "It was narrated that AsmabintAbi Bakr said:\"We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it\". (Sahih )"
        },
        {
          "body": "AsmabintYazid said:“The sleeve of the shirt of Allah’s Messenger (Allah bless him and give him peace) extended to the wrist.”"
        },
        {
          "body": "This hadith has been narrated on the authority of Ibn 'Aun and the name of Juwairiyabintal-Harith was mentioned beyond any doubt."
        },
        {
          "body": "It was narrated from ZainabbintJahsh that :She had a tub of brass. She said: \"I used to comb the hair of the Messenger of Allah in it.\""
        },
        {
          "body": "It was narrated that BusrahbintSafwan said:\"The Messenger of Allah said: 'If anyone of you touches his penis, let him perform ablution.'\""
        },
        {
          "body": "AsmabintYazid said:\"The Messenger of Allah(SAW) passed by us, among (a group of) women, and he greeted us with (the greeting of) peace.\""
        },
        {
          "body": "It was\nnarrated that Asm’abintAbu Bakr said:“We slaughtered a\nhorse\nand ate its meat during the time of the Messenger of Allah\n(saw).”"
        },
        {
          "body": "A similar report was narrated from SafiyyahbintAbi 'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet."
        },
        {
          "body": "'A'isha reported that Allah's Messenger (may peace he upon him) gave glad tidings to KhadijabintKhuwailid of a palace in Paradise."
        },
        {
          "body": "Ar-Rubayy'bintMu'awwidh bin 'Afra' narrated that Thabit bin Qais bin Shammas hit his wife and broke her arm --her name was Jamilahbint'Abdullah bin Ubayy. Her brother came to the Messenger of Allah to complain about him, and the Messenger of Allah sent for Thabit and said:\"Take what she owes you and let her go.\" He said: \"Yes.\" And the Messenger of Allah ordered her to wait for one menstrual cycle and then go to her family."
        },
        {
          "body": "Narrated ZainabbintJahsh:That the Prophet once came to her in a state of fear and said, \"None has the right to be worshipped but \nAllah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall \nof Gog and Magog like this,\" making a circle with his thumb and index finger. ZainabbintJahsh said, \n\"O Allah's Apostle! Shall we be destroyed even though there are pious persons among us?\" He said, \n\"Yes, when the evil person will increase.\""
        },
        {
          "body": "It was narrated that Rubai'bintMu'awwidh bin 'Afra' said:\"The Prophet performed ablution, and he put his fingers in the (holes) inside of his ears.\""
        },
        {
          "body": "Umm\nBilalbintHilal narrated from her father that the Messenger of\nAllah\n(saw) said:“It is permissible to offer a Jadha’a* among sheep\nas\na sacrifice.”"
        },
        {
          "body": "It was\nnarrated from ZainabbintUmm Salamah that her mother said\nthat her\nbed was in front of the place where the Messenger of Allah\n(saw)\nprostrated."
        },
        {
          "body": "It was\nnarrated that Umm Hani’bintAbi Talib said:“I used to hear\nthe\nProphet (saw) reciting at night when I was on the roof of my\nhouse.”"
        },
        {
          "body": "Narrated ZainabbintJahsh:That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index \nfinger and thumb. ZainabbintJahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) \nincreased.\""
        },
        {
          "body": "FatimabintQais (Allah be pleased with her) reported that she had been married to Abu 'Amr b. Hafs b. al-Mughira and he divorced her with three pronouncements. She stated that she went to Allah's Messenger (may peace be upon him) asking him about abandoning that house. He commanded her to move to the house of Ibn Umm Maktum, the blind. Marwan refused to testify the divorced woman abandoning her house (before the 'Idda was over). 'Urwa said that 'A'isha objected to (the words of) FatimabintQais."
        },
        {
          "body": "ZainabbintAbi Salamah said:\"I heard 'Aisha, the wife of the Prophet say: 'SahlahbintSuhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\""
        },
        {
          "body": "Umm QaisbintMihsan said:“The Messenger of Allah (saw) said: ‘You\nshould\nuse Indian aloeswood for it contains seven cures, including (a\ncure\nfor) pleurisy.’”"
        },
        {
          "body": "Narrated SafiyyabintShaiba:The Prophet gave a banquet with two Mudds of barley on marrying some of his wives. (1 Mudd= 1 \n3/4 of a kilogram) ."
        },
        {
          "body": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah married MaimunahbintAl-Harith when he was a Muhrim.\" According to the Hadith of Ya'la (one of the narrators): \"In Sarif.\""
        },
        {
          "body": "It was narrated that UmaimahbintRuqaiqah said:\"The Prophet (PBUH) had a vessel made from a date tree in which he would urinate and place it under the bed.\""
        },
        {
          "body": "Narrated Ar-Rubayyi 'bintMu'auwidh:We were in the company of the Prophet providing the wounded with water and treating them and \nbringing the killed to Medina (from the battle field) ."
        },
        {
          "body": "ZainabbintUmm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "Asma’bint’Umais (RAA) narrated that Fatimah (RAA) (the daughter of the prophet (P.B.U.H.) made a will that ‘Ali (RAA) was to wash her when she dies.’ Related by Ad-Daraqutni."
        },
        {
          "body": "It was narrated that Umm HaimbintWadda' Al-Khuza'iyyah said:\"I heard the Messenger of Allah (saas) say: 'The supplication of a father reaches the Veil (i.e. the place of repentance).'\""
        },
        {
          "body": "'Urwah narrated from 'Aishah:that when SaudahbintZam'ah grew old, she gave her day to 'Aishah, and the Messenger of Allah went to 'Aishah on Saudah's day."
        },
        {
          "body": "It was\nnarrated that ‘Aishah said:“Asma’bint‘Umais gave birth at\nShajarah, and the Messenger of Allah (saw) told Abu Bakr to tell her\nto take a bath and begin the Talbiyah.”"
        },
        {
          "body": "It was\nnarrated from Hafsahbint‘Umar that when the call for the\nSubh\nprayer was given, the Messenger of Allah (saw) would pray two\nshort\nRak’ah before going to the prayer."
        },
        {
          "body": "Asma'bintYazid (May Allah be pleased with them) reported:The sleeves of the shirt of Messenger of Allah (PBUH) reached his wrists.[At-Tirmidhi, who classified it as Hadith Hasan]."
        },
        {
          "body": "Asma'bintYazid (May Allah be pleased with her) reported:The sleeves of the Messenger of Allah (PBUH)'s Qamees reached down to his wrists.[Abu Dawud and At-Tirmidhi]."
        },
        {
          "body": "It was narrated that Umm HabibahbintAbi Sufyan said:\"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\""
        },
        {
          "body": "Narrated Asma'bintYazid bin As-Sakan Al-Ansariyyah:\"The sleeves of (the shirt) of the Messenger of Allah (saws) were to the wrist.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib."
        },
        {
          "body": "It was narrated from BusrahbintSafwan that the Prophet (PBUH) said:\"If any one of you touches his private part with his hand, let him perform Wudu'.\""
        },
        {
          "body": "'A’ishabintSa'd ibn Abi Waqqas reported that her father said:“The Prophet (Allah bless him and give him peace) used to drink while standing.”"
        },
        {
          "body": "SafiyyabintAbu 'Ubaid narrated this tradition of Allah's Prophet (may peace be upon him) on the authority of some wives of Allah's Apostle (may peace be upon him)"
        },
        {
          "body": "(Another chain) from Umm AmarahbintKa'b Al-Ansari:From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\""
        },
        {
          "body": "Umm HabibabintQays (Khawla) was heard to say, \"My hand and that\nof the Messenger of Allah, may Allah bless him and grant him peace, mixed\ntogether in the same vessel.\""
        },
        {
          "body": "It was narrated that Asma'bintAbi Bakr said:\"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\""
        },
        {
          "body": "It was\nnarrated from Umm HabibahbintAbi Sufyan that the Prophet\n(saw)\nsaid:“Whoever performs twelve Rak’ah (of Sunnah) during the day\nand night, a house will be built for him in Paradise.”"
        },
        {
          "body": "Asma'bintAbu Bakr narrated that :a woman asked the Prophet about a garment that was touched by some menstrual blood. So Allah's Messenger said: \"Remove it, and scrub it, then rinse it and pray in it\""
        },
        {
          "body": "Narrated `Aisha:SaudabintZam`a gave up her turn to me (`Aisha), and so the Prophet used to give me (`Aisha) both \nmy day and the day of Sauda."
        },
        {
          "body": "It was narrated that Umm HishambintHarithah bin An-Nu'man said:\"I only learned :Qaf. By the Glorious Quran.' Behind the Messenger of Allah (SAW); he used to recite it in Subh."
        },
        {
          "body": "It was narrated from SafiyyahbintShaimah that a woman said:I saw the Messenger of Allah hastening at the bottom of the valley and he said: \"The river bed should not be crossed except with vigor.\""
        },
        {
          "body": "Umm Kulthumbint'Uqbah narrated that the  Messenger of Allah said:\"One who brings peace between people is not a liar, he says something good, or reports something good.\""
        },
        {
          "body": "It as\nnarrated from Abu Bakr bin Muhammad that KhalidahbintAnas,\nthe\nmother of Banu Hazm As-Sa’idiyyah, came to the Prophet (saw) and\nrecited a Ruqyah to him, and he told her to use it."
        },
        {
          "body": "Narrated MaimunabintAl-Harith:My bed was beside the praying place (Musalla) of the Prophet and sometimes his garment fell on me \nwhile I used to lie in my bed."
        },
        {
          "body": "Narrated HafsabintSeereen:Um 'Atiyya said that they had entwined the hair of the daughter of Allah's Apostle in three braids. \nThey first undid her hair, washed and then entwined it in three braids.\""
        },
        {
          "body": "It was narrated from Asma'bintAbi Bakr that the Prophet said to her:\"Do not count what you give, otherwise Allah, the Mighty and Sublime, will count what He gives to you.\""
        },
        {
          "body": "It was narrated from SafiyyahbintShaibah, that 'Aishah said:\"The Messenger of Allah [SAW] said: 'May Allah curse the woman who affixes hair extensions and the woman who has that done.'\""
        },
        {
          "body": "Umm Hanibint'Ali ibn Talib said:\"Allah’s Messenger (Allah bless him and give him peace) arrived boldly at Mecca, and he had four braids of hair.”"
        },
        {
          "body": "Narrated Um Kulthumbint`Uqba:That she heard Allah's Apostle saying, \"He who makes peace between the people by inventing good \ninformation or saying good things, is not a liar.\""
        }
      ]
    }
  ]
}