{
  "data": [
    {
      "hadith": [
        {
          "body": "NarratedUmmSalamah:\"The Prophet (saws) slackened Fatimah's garment a hand-span.\"[Abu 'Eisa said:] Some of them reported it from Hammad bin Salamah, from 'Ali bin Zaid, fromAl-Hasan, from his father, fromUmmSalamah."
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (SAW) put a garment overAl-Hasan,Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" SoUmmSalamah said: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'"
        },
        {
          "body": "It was narrated thatUmmSubyahAl-Juhaniyyah said:\"Often my hand would touch the hand of the Messenger of Allah while performing ablution from a single vessel.\" (Hasan)\n\nAbu `Abdullah bin Majah said: \"I heard Muhammad say: 'UmmSubyah was Khawlah bint Qais. I mentioned that to Abu Zur`ah and he said: \"It is true.\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Al-Hasanreported on the authority of his mother that she wasUmmSalamah pouring water on the urine of the male child until the age when he did not eat food. When he began to eat food, she would wash (his urine). And she would wash the urine of the female child."
        },
        {
          "body": "NarratedUmmSalamah:That she brought a side of roasted meat to the Messenger of Allah (saws), so he ate it from it and stood for Salat, and did not perform Wudu'He said: There are narrations on this topic from 'Abdullah binAl-Harith,Al-Mughirah, and Abu Rafi'[Abu 'Eisa said:] This Hadith isHasanSahih Gharib from this route."
        },
        {
          "body": "Abu Nu'aim Wahb bin Kaisan narated that he heard Jabir bin  'Abdullah saying:\"Whoever prayed a Rak'ah in which he did not reciteUmmAl-Qur'an, then he did not pray except if he was behind an Imam.\"[Abu 'Eisa said:] This Hadith isHasanSahih."
        },
        {
          "body": "Narrated 'Ubaidullah bin Abi Burdah:From his father thatUmmAyyub informed him that the Prophet (saws) had stayed with them, and they prepared some food for him containing some of these vegetables. But he disliked eating it, so he said to his Companions: \"Eat it, for I am not like you are, I fear that I will offend my companion.\"[Abu 'Eisa said:] This Hadith isHasanSahih Gharib.UmmAyyub is the wife of Abu AyyubAl-Ansari."
        },
        {
          "body": "Narrated Abu Hurairah:That the Prophet (saws) said: \"Indeed a woman grants (assurances of protection) to a people\" - meaning it is to be honored - \"from the Muslims.\"There is something on this topic fromUmmHani, and this Hadith isHasanGharib.I asked Muhammad and he said: \"This Hadith is Sahih. Kathir bin Ziad heard fromAl-Walid bin Rabah, andAl-Walid bin Rabah heard from Abu Hurairah, and he is Muqarib (average) in Hadith."
        },
        {
          "body": "Narrated Abu MusaAl-Ash'ari:That the Messenger of Allah (saws) said: \"Wearing silk and gold has made unlawful for the males of my Ummah and lawful for its females.[Abu 'Eisa said:] There are narrations on this topic from 'Umar, 'Ali, 'Uqbah bin 'Amir, Anas,UmmHani, Hudhaifah, 'Abdullah bin 'Amr, 'Imran bin Husain, 'Abdullah bin Az-Zubair, Jabir, Abu Raihanah, Ibn 'Umar,Al-Bara', and Wathilah binAl-Asqa', and this Hadith isHasanSahih."
        },
        {
          "body": "NarratedUmmAl-HusainAl-Ahmasiyyah:I heard the Messenger of Allah (saws) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith isHasanSahih, it has been reported through other routes fromUmmHusain."
        },
        {
          "body": "NarratedUmmSalamah:\"The most loved garment to the Messenger of Allah (saws) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith isHasanGharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is fromAl-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, fromUmmSalamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, fromUmmSalamah is more correct, Abu Tumailah mentioned 'his mother' in it.\""
        },
        {
          "body": "NarratedUmmAtiyyahal-Ansariyyah:A woman used to perform circumcision in Medina. The Prophet (saws) said to her: Do not cut severely as that is better for a woman and more desirable for a husband.Abu Dawud said: It has been transmitted by 'Ubaid Allah b. 'Amr from 'Abdal-Malik to the same effect through a different chain.Abu Dawud said: It is not a strong tradition. It has been transmitted in mursal form (missing the link of the Companions)Abu Dawud said: Muhammad b.Hasanis obscure, and this tradition is weak."
        },
        {
          "body": "It was narrated from AbuAl-Hasan, the freed slave ofUmmQais bint Mihsan, thatUmmQais said:\"My son died, and I felt very sad. I said to the one who was washing him: 'Do not wash my son with cold water and kill him.\" 'Ukashah bin Mihsan went to the Messenger of Allah and told him what she had said, and he smiled then said: \"What did she say, may Allah give her long life?\" And we do not know of any woman who lived as long as she lived."
        },
        {
          "body": "Narrated Shu'bah binAl-Hakam:\"I heard Ibn Abi Laila narrating that Hudhaifah asked for water, so someone brought him a vessel made from silver. He threw it, and said: 'I have indeed forbade him, but he refused to stop! Indeed the Messenger of Allah (saws) prohibited drinking from silver and gold vessels, and from wearing silk and Dibaj, and he (saws) said: \"If is for them in this world, and for you in the Hereafter.\"He said: There are narrations on this topic fromUmmSalamah,Al-Bara', and 'Aishah.[Abu 'Eisa said:] This Hadith isHasanSahih."
        },
        {
          "body": "Abū Huraira said:When God’s Messenger once asked Ubayy b. Ka'b how he recited in the course of the prayer and he recitedUmmal- Qur’ān(Al-Qur’ān 1) , he said, “By Him in whose hand my soul is, nothing like it has been sent down in the Torah, the Injīl, the Zabūr, or the Qur’ān, and it is seven of the oft-repeated verses and the mighty Qur’ān (Qur’ān, 15:87) which I have been given.” \n\nTirmidhī transmitted it, and Dārimī transmitted from “nothing like it has been sent down,” but he did not mention Ubayy b. Ka‘b. Tirmidhī said this is ahasansahīhtradition."
        },
        {
          "body": "Narrated Abu Hurairah:That the Messenger of Allah (saws) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar,UmmHabibah, andUmmSalamah. This Hadith isHasanSahih."
        },
        {
          "body": "Narrated Anas:\"The Messenger of Allah (saws) was of average height, neither tall nor very short, he had a good build, brown in complexion, his hair was neither curly nor straight, and when he walked he swayed slightly.\"He said: There are narration on this topic from 'Aishah,Al-Bara', Abu Hurairah, Ibn 'Abbas, Abu Sa'eed, Jabir, Wa'il bin Hujr, andUmmHani'.[Abu 'Eisa said:] The Hadith of Anas is aHasanSahih Gharib Hadith from this route, as a narration of Humaid."
        },
        {
          "body": "NarratedAl-HasanAl-Basri:By Allah,Al-Hasanbin `Ali led large battalions like mountains against Muawiya. `Amr binAl-As \nsaid (to Muawiya), \"I surely see battalions which will not turn back before killing their opponents.\" \nMuawiya who was really the best of the two men said to him, \"O `Amr! If these killed those and those \nkilled these, who would be left with me for the jobs of the public, who would be left with me for their \nwomen, who would be left with me for their children?\" Then Muawiya sent two Quraishi men from \nthe tribe of `Abd-i-Shams called `Abdur Rahman bin Sumura and `Abdullah bin 'Amir bin Kuraiz toAl-Hasansaying to them, \"Go to this man (i.e.Al-Hasan) and negotiate peace with him and talk and \nappeal to him.\" So, they went toAl-Hasanand talked and appealed to him to accept peace.Al-Hasansaid, \"We, the offspring of `Abdul Muttalib, have got wealth and people have indulged in killing and \ncorruption (and money only will appease them).\" They said toAl-Hasan, \"Muawiya offers you so and \nso, and appeals to you and entreats you to accept peace.\"Al-Hasansaid to them, \"But who will be \nresponsible for what you have said?\" They said, \"We will be responsible for it.\" So, whateverAl-Hasanasked they said, \"We will be responsible for it for you.\" So,Al-Hasanconcluded a peace treaty \nwith Muawiya.Al-Hasan(Al-Basri) said: I heard Abu Bakr saying, \"I saw Allah's Apostle on the \npulpit andAl-Hasanbin `Ali was by his side. The Prophet was looking once at the people and once atAl-Hasanbin `Ali saying, 'This son of mine is a Saiyid (i.e. a noble) and may Allah make peace \nbetween two big groups of Muslims through him.\""
        },
        {
          "body": "It is fromal-Hasanal-Basri's narration on the authority of 'Imran. However, it has been said thatal-Hasandid not hear (Hadith) from 'Imran]."
        },
        {
          "body": "NarratedUmmSalamah:from the Prophet (SA), regarding: Your wives are a tilth for you, so go to your tilth when or how you will (2:223). [He (SAW) said]: \"Meaning one valve.\"\n\n[Abu 'Eisa said:] This Hadith isHasanSahih. Ibn Khuthaim is 'Abdullãh bin 'Uthmãn bin .\nKhuthaim. Ibn Sãbit is 'AbdurRahmãn bin 'Abdullah bin Sabit A1-JumahiAl-Makki, and Hafsah is the daughter of 'Abdur-Rahmãn bin Abi Bakr As-Siddiq (narrators in the chain). And it has been reported as: \"In one hole.\""
        },
        {
          "body": "NarratedAl-Bara' bin 'Azib:That the Messenger of Allah (saws) said: \"Bring me a shoulder blade or tablet.\" Then he wrote: Not equal are those of believers who sit. 'Amr binUmmMaktum who was behind him said: \"Is there an exemption for me?\" So the following was revealed: Except those who are disabled.There are narrations on this topic from Ibn 'Abbas, Jabir and Zaid bin Thabit.This Hadith isHasanSahih and it is a Hadith that is Gharib from  the narration of Sulaiman At-Taimi from Abu Ishaq.And Shu'bah and Ath-Thawri reported this Hadith from Abu Ishaq."
        },
        {
          "body": "Narrated Ibn 'Umar:That the Prophet (saws) \"Every intoxicant is unlawful.\"He said: There are narrations on this topic from 'Umar, 'Ali, Ibn Mas'ud, Anas, Abu Sa'eed, Abu Musa,Al-Ashajj,Al-Asri', Dailam, Maimunah, 'Aishah, Ibn 'Abbas, Qais bin Sa'd, An-Nu'man bin Bashir, Mu'awiyah, 'Abdullah bin Mughaffal,UmmSalamah, Buraidah, Abu Hurairah, Wa'il bin Hujr, and QurrahAl-Muzani.[Abu 'Eisa said:] This Hadith isHasan. Similar was reported from Abu Salamah, from Abu Hurairah, from the Prophet (saws). Both of these are Sahih. More than one narrator reported similarly from Muhammad bin 'Amr, from Abu Salamah, from Abu Hurairah, from the Prophet (saws), and from Abu Salamah, from Ibn 'Umar, from the Prophet (saws)."
        },
        {
          "body": "It was narrated from Muhammad that:a funeral passed byAl-Hasanbin 'Ali and Ibn 'Abbas.Al-Hasanstood up but Ibn 'Abbas did not/Al-Hasansaid: 'Didn't the Messenger of Allah stand up for the funeral of a Jew?' Ibn 'Abbas said: 'Yes, then he sat down.\"'"
        },
        {
          "body": "The aforesaid tradition (No. 2182) has also been transmitted by Ali (ibnal-Mubarak) through a different chain of narrators to the same effect.This version adds:Ibn Abbas said: There remained one more pronouncement of divorce for you. The Messenger of Allah (saws) took the same decision.Abu Dawud said: I heard Ahmad b. Hanbal say: 'Abdal-Razzaq said that Ibnal-Mubarak said to Ma'mar: Who is this Abual-Hasan? He bore a big rock.Abu Dawud said:Al-Zuhri has narrated (traditions) on the authority of this Abual-Hasan.Al-Zuhri said: He was lawyer, andal-Zuhri narrated many traditions from Abual-Hasan.Abu Dawud said: Abual-Hasanis well known narrator. This tradition is not practiced."
        },
        {
          "body": "NarratedAl-HasanAl-Basri:WhenAl-Hasanbin `Ali moved with army units against Muawiya, `Amr binAL-As said to Muawiya, \n\"I see an army that will not retreat unless and until the opposing army retreats.\" Muawiya said, \"(If the \nMuslims are killed) who will look after their children?\" `Amr binAl-As said: I (will look after them). \nOn that, `Abdullah bin 'Amir and `Abdur-Rahman bin Samura said, \"Let us meet Muawaiya and \nsuggest peace.\"Al-HasanAl-Basri added: No doubt, I heard that Abu Bakra said, \"Once while the \nProphet was addressing (the people),Al-Hasan(bin `Ali) came and the Prophet said, 'This son of mine \nis a chief, and Allah may make peace between two groups of Muslims through him.\""
        },
        {
          "body": "Al-Hasansaid Abu Huraira told him that God's messenger said, \"The sun and the moon are two oxen which will be cast away into hell on the day of resurrection.\"Al-Hasanasked what sin they had committed, and on receiving the reply, \"I am telling you on the authority of God's messenger,\"al-Hasansaid no more. \n\nBaihaqi transmitted it inKitabal-ba'th wan nushur."
        },
        {
          "body": "It was narrated that Ibn Sirin said:\"A funeral passed byAl-Hasanbin 'Ali and Ibn 'Abbas.Al-Hasanstood up but Ibn 'Abbas did not.Al-Hasansaid to Ibn 'Abbas: 'Didn't the Messengr of Allah stand up for it?' Ibn 'Abbas said: 'He stood up for it then he sat.\"'"
        },
        {
          "body": "Muhammad b. Sinn said that when a bier came pastal-Hasanb. ‘All and Ibn ‘Abbasal-Hasanstood up but Ibn ‘Abbas did not, soal-Hasansaid, “Did God’s messenger not stand up out of respect for the bier of a Jew ?” He replied, “Yes, but thereafter he sat.” \n\nNasa’i transmitted it."
        },
        {
          "body": "Narrated Ja'far bin Muhammad :Narrated from his father who said: \"Al-HasanandAl-Husain wore their ring on their left hand.\"This Hadith isHasanSahih."
        },
        {
          "body": "Bukhari said without a completeisnadthatal-Hasan(i.e.al-Hasanal-Basri (21-110. A.H ))  recitedFatihatal-Kitabover an infant and said, “O God, make him for us a righteous deed which has gone before us, a recompense gone ahead, a treasure and a reward.”"
        },
        {
          "body": "Al-Hasanal-Hulwānī narrated to us, he said, I heard Affān say, I heard Abū Awānah say:‘A Ḥadīth did not reach me on authority ofal-Hasanexcept I presented it to Abān bin Abī Ayyāsh , then he read it to me ’."
        },
        {
          "body": "NarratedAl-Hasan:from Samurah that the Prophet (SAW) said: \"Al-Hasab is wealth andAl-Karam is Taqwa.\""
        },
        {
          "body": "Abu Hurairah narrated:\"Al-Aqra' bin Habis saw the prophet kissingAl-Hasan\"- Ibn Abi 'Umar (one of the narrators) said:\"Al-HasanandAl-Husain.\" So he said: 'I have ten children and I do not kiss any one of them.' So the Messenger of Allah said: 'Whoever shows no mercy, he will be shown no mercy.\""
        },
        {
          "body": "Narrated Abu Huraira:I was with Allah's Apostle in one of the Markets of Medina. He left (the market) and so did I. Then he \nasked thrice, \"Where is the small (child)?\" Then he said, \"CallAl-Hasanbin `Ali.\" SoAl-Hasanbin \n`Ali got up and started walking with a necklace (of beads) around his neck. The Prophet stretched \nhis hand out like this, andAl-Hasandid the same. The Prophet embraced him and said, \"0 Allah! l \nlove him, so please love him and love those who love him.\" Since Allah's Apostle said that. nothing \nhas been dearer to me thanAl-Hasan."
        },
        {
          "body": "Mahmūd bin Ghaylān narrated to us, Abū Dāwud narrated to us, he said, Shu’bah said to me:‘Go to Jarīr bin Hāzim and say to him, ‘It is not allowed for you to transmit fromal-Hasanbin Umārah for indeed he lies’.’ Abū Dāwud said, I said to Shu’bah: ‘And how do you know that?’ So [Shu’bah] said: ‘He narrated to us on authority ofal-Hakam things that were not found to have any basis’. [Abū Dāwud] said: ‘What things?’ [Shu’bah] said, I said toal-Hakam: ‘Did the Prophet, peace and blessings of Allah upon him, pray over the martyrs of Uhud?’ [al-Hakam] said: ‘He did not pray over them’.Al-Hasanbin Umārah said, on authority ofal-Hakam, on authority of Miqsam, on authority of Ibn Abbās: ‘Indeed the Prophet, peace and blessings of Allah upon him, prayed over them and buried them ’. I [Shu’bah] said toal-Hakam: ‘What do you say about the children born from fornication?’ [Al-Hakam] said: ‘Pray over them ’. I [Shu’bah] said: ‘From whose Ḥadīth is it transmitted?’ [Al-Hakam] said: ‘It is transmitted on authority ofal-Hasanal-Basrī’.’Al-Hasanbin Umārah said: ‘Al-Hakam narrated to us, on authority of Yahyā binal-Jazzār, on authority of Alī."
        },
        {
          "body": "Narrated Abu Maryam `Abdullah bin ZiyadAl-Aasadi:When Talha, AzZubair and `Aisha moved to Basra, `Ali sent `Ammar bin Yasir andHasanbin `Ali \nwho came to us at Kufa and ascended the pulpit.Al-Hasanbin `Ali was at the top of the pulpit and \n`Ammar was belowAl-Hasan. We all gathered before him. I heard `Ammar saying, \"`Aisha has \nmoved toAl-Busra. By Allah! She is the wife of your Prophet in this world and in the Hereafter. But \nAllah has put you to test whether you obey Him (Allah) or her (`Aisha)."
        },
        {
          "body": "Narratedal-Hasanfrom Samurah (RA):The Prophet (SAW) said, \"If two guardians have given a woman in marriage, she marries the man she was first married to.\"\n\n[Reported by Ahmad andal-Arba'a. at-Tirmidhi graded itHasan(good)]."
        },
        {
          "body": "UmmSalamah (May Allah be pleased with her) reported:Messenger of Allah (PBUH) said, \"Any woman dies while her husband is pleased with her, she will enter Jannah\".[At- Tirmidhi, who classified it as HadithHasan]."
        },
        {
          "body": "Narrated Abu Hurairah:that the Messenger of Allah (SAW) said: \"Al-Hamdulillah isUmmAl-Qur'an andUmmAl-Kitab and the seven oft-repeated.\""
        },
        {
          "body": "It was narrated that the freed slave of `Abdullah binal-Harith said:I did ‘Umrah with ‘Ali bin Abi Talib (رضي الله عنه) at the time of `Umar - or at the time of `Uthman. He stayed with his sisterUmmHani` bint Abi Talib, and when he had finished his ‘Umrah he went back, and water was prepared for him and he washed himself. When he had finished washing himself, some of the people of Iraq entered upon him and said: O, AbuHasan, we have come to you to ask you about something we would like you to tell us about, He said: I thinkAl-Mugheerah bin Shu`bah is telling you that he was the last of the people to speak to the Messenger of Allah (ﷺ). They said: Yes, we have come to ask you about that. He said: The last of the people to speak to the Messenger of Allah (ﷺ) was Qutham binal-Abbas."
        },
        {
          "body": "It was narrated from Ayyub, fromAl-Hasan, from Abu Hurairah, that the Prophet said:\"Women who seek divorce and Khul' are like the female hypocrites.\"Al-Hasansaid: \"I did not hear it from anyone other than Abu Hurairah.\""
        },
        {
          "body": "Narrated Abu Az-Zubair:From Jabir that the Prophet (saws) prohibitedAl-Muhaqalah,Al-Muzabanah,Al-Mukhabarah, andAl-Mu'awamah, and he permitted it in the case ofAl-'Araya.[Abu 'Eisa said:] This Hadith isHasanSahih."
        },
        {
          "body": "‘Uthmanal-Batti said:Al-Hasannever interpreted any Quranic verse but to establish (Divine decree)."
        },
        {
          "body": "Narrated Abu Sa'eed:that the Messenger of Allah (SAW) said: \"Al-HasanandAl-Husain are the chiefs of the youths of Paradise.\""
        },
        {
          "body": "Ar-Rabi' ibnal-Hasansaid, \"I went withal-Hasanto visit Qatada.\nHe sat by his head and asked after him and made supplication for him. He\nsaid, 'O Allah, heal his heart and cure him of his illness!\""
        },
        {
          "body": "It was narrated from 'Abdullah bin Buraidah, from his father, that:the Messenger of Allah offered the 'Aqiqah forAl-HasanandAl-Husain."
        },
        {
          "body": "Ibn ‘Awn said:I was a prisoner in Syria. A man called me from behind. I turned towards him and suddenly found that it was Raja b. Haiwah. He said: Abu ‘Awn, what is this that the people are telling aboutal-Hasan? I said: They are much lying toal-Hasan."
        },
        {
          "body": "Ja'far ibn Muhammad reports that his father said:\"Al-Hasanandal-Husain used to wear signet rings on their left hands.\""
        },
        {
          "body": "Abu Sa'eedAl-Khudri narrated that :Allah's Messenger said: \"A mount is not saddled (for a journey) except to three Masajid:Al-MasjidAl-Haram, this Masjid of mine, and MasjidAl-Aqsa.\"\n\n[Abu `Eisa said:] This Hadith isHasanSahih."
        },
        {
          "body": "Narrated AbuAl-Minhal:From Iyas bin 'Abdal-Muzani who said: \"The Prophet (saws) prohibited selling water.\"[He said:] There are narrations on this topic from Jabir, Buhaisah from her father, Abu Hurairah, 'Aishah, Anas and 'Abdullah bin 'Amr.[Abu 'Eisa said:] The Hadith is Iyas is aHasanSahih Hadith. This is acted upon according to most of the people of knowledge, they dislike selling water. This is the view of IbnAl-Mubarak, Ash-Shafi'i, Ahmad, and Ishaq. Some of the people of knowledge permitted selling water,Al-Hasanal-Basri is one of them."
        },
        {
          "body": "Narrated Abdullah ibn Abbas:The Messenger of Allah (saws) sacrificed a ram for bothal-Hasanandal-Husayn each (Allah be pleased with them)."
        },
        {
          "body": "Khalidal-Hadhdha, askedal-Hasanabout the Quranic verse:“And for this did He create them.” He said: He created these for this and those for that."
        },
        {
          "body": "Hammad said:I heard Ayyub say: Two kinds of people have lied toal-Hasan: people who believed in free will and they intended that they publicise their belief by it; and people who had enmity with and hostility (foral-Hasan), saying: Did he not say so and so? Did he not say so and so?"
        },
        {
          "body": "Abu Bakrah said:\"I saw the Messenger of Allah (SAW) on the Minbar, andAl-Hasanwas with him. He would turn to the people sometimes and turn to him (Al-Hasan) sometimes, and he said: 'This son of mine is a leader (Sayyid) and Allah may make peace between two large groups of Muslims through him.'\""
        },
        {
          "body": "Al-Hasansaid, \"Be women who greet men.\""
        },
        {
          "body": "NarratedAl-Hasan:To remove the injury is the shaving of the head."
        },
        {
          "body": "Humaidal-Tawil askedal-Hasanabout the verse:“Even so do We let it creep into the hearts of the sinners.” He said: Polytheism"
        },
        {
          "body": "It was narrated that Ibn 'Abbas said:\"The Messenger of Allah offered an 'Aqiqah forAl-HasanandAl-Husain, may Allah be please with them, two rams for each.\""
        },
        {
          "body": "Al-HasanAl-Basri said:\"The Messenger of Allah (s.a.w) said:\n'On the Day of Judgement, 'Uthman bin 'Affan will intercede for (an amount) the likes of Rabi'ah and Mudar.'\""
        },
        {
          "body": "Narrated Abu Bakra:I heard the Prophet talking at the pulpit whileAl-Hasanwas sitting beside him, and he (i.e. the \nProphet ) was once looking at the people and at another timeAl-Hasan, and saying, \"This son of mine \nis a Saiyid (i.e. chief) and perhaps Allah will bring about an agreement between two sects of the \nMuslims through him.\""
        },
        {
          "body": "Abu Huraira told thatal-Hasanb. 'All took one of the dates of thesadaqaand put it in his mouth, whereupon the Prophet said, “Leave it alone, leave it alone,” in order that he might throw it away. He then said, \n“Do you not know that we* do not eat thesadaqa?’ \n\n(Bukhari and Muslim.)\n\n* The pronoun includes the Prophet and his family,alHasanbeing his grandson. The idea is more definitely expressed in 'Abdal-Muttalib's tradition."
        },
        {
          "body": "Ibn 'Abbas (RAA) narrated, \"The Messenger of Allah (PBUH) slaughtered a ram for bothal-Hasanandal-Husain (at their birth).' Related by Abu Dawud, Ibn Khuzaimah, Ibnal-Garud and 'Abdul Haqq graded it as Sahih."
        },
        {
          "body": "Ayyub said:Al-Hasansaid: I will never return to it."
        },
        {
          "body": "NarratedAl-Bara:The Prophet said toHassan, \"Abuse them (with your poems), and Gabriel is with you (i.e, supports \nyou).\" (Through another group of sub narrators)Al-Bara bin Azib said, \"On the day of Quraiza's \n(besiege), Allah's Apostle said toHassanbin Thabit, 'Abuse them (with your poems), and Gabriel is \nwith you (i.e. supports you).' \""
        },
        {
          "body": "Narrated Anas:\"The Messenger of Allah (saw) used to go to battle withUmmSulaim, and other women with her, from the Ansar, who would give water and attend to the wounded.\"[Abu 'Eisa said:] There is something on this topic from Ar-Rabi' bin Mu'awwidh. This Hadith isHasanSahih."
        },
        {
          "body": "Narrated Qatadah:FromAl-Hasan, from Samurah, that the Prophet (saws) said: \"Upon the hand is what it took, until it is returned.\" Qatadah said: \"ThenAl-Hasanforgot, so he said: 'It is something you entrusted, he is not liable for it.' \" Meaning the borrowed property.[Abu 'Eisa said:] This Hadith isHasanSahih. Some of the people pf knowledge, among the Companions of the Prophet (saws) and others, followed this Hadith. They said that the possessor of the borrowed thing is liable. This is the view of Ash-Shafi'i and Ahmad. Some of the people of knowledge among the Companions and others said that the possessor of the borrowed this is not liable unless there is dispute. This is the view of Sufyan Ath-Thawri and the people ofAl-Kufah, and it is the view of Ishaq."
        },
        {
          "body": "Abu Hurairah narrated that the Messenger of Allah (s.a.w) said:\"The people  will face three presentations on the Day of Judgement. As for (the first) two presentations, they are the arguments and the excuses, as for the third presentation, upon that the records will fly into the hands. Some will take them in their right hand, and some will take them in their left hand.\"[Abu 'Eisa said:] This Hadith is\nnot correct, becauseAl-Hasandid\nnot hear from Abu Hurairah. Some\nof them reported it from 'Ali bin\n'Ali - and he is Ar-Rifa'i - fromAl-Hasan, from Abu Musã from\nthe Prophet SAW.\n[Abu 'Eisa said:] This Hadith is\nnot correct, becauseAl-Hasandid\nnot hear from Abü Musa]."
        },
        {
          "body": "It was narrated thatAl-Qasim said:The Greatest Name of Allah, if He is called by which He will respond, is in three Surah:Al-Baqarah,Al'Imran and Ta-Ha. (Hasan)Another chain for something similar fromAl-Qasim, from Abu Umamah, from the Prophet (saas)."
        },
        {
          "body": "NarratedAl-Bara:I saw the Prophet carryingAl-Hasanon his shoulder an saying, \"O Allah! I love him, so please love \nhim.\""
        },
        {
          "body": "Narrated Abu Hurairah (RA):The Prophet (SAW) said, \"Give gifts to one another and you will love one another.\"\n\n[al-Bukhari reported it inal-Adabal-Mufrad; Abu Ya'la reported it with aHasan(good) chain of narrators]."
        },
        {
          "body": "Another chain fromUmmHani' who said:\"I granted asylum for two men among my brother-in-laws. So the Messeneger of Allah (saws) said: 'We grant security to whomever you have granted security.'\"[Abu 'Eisa said:] This Hadith isHasanSahih.This is acted upon according to the people of knowledge. They permit assurance of protection by a women. This is the view of Ahmad and Ishaq. They permitted the asylum of a woman and slaveIt has been related from other routes from 'Umar binAl-Khattab that he permitted the asylum granted by a slave.One of the narrators of this last narration Abu Murrah is the freed slave of 'Aqil bin Abi Talib - they also say that he was freed slave  ofUmmHani' - and his name was Yazid.It has been related from 'Ali bin Abi Talib and 'Abdullah bin 'Amr that the Prophet (saws) said: \"The covenants of the Muslims are one, it covers the rest of them.\"[Abu 'Eisa said:] According to the people of knowledge, the meaning of this Hadith is that whoever gives assurance of protection among the Muslims, then it is valis to all of them."
        },
        {
          "body": "Al-Hasansaid, \"Greeting is an act of obedience while the answer\nis a duty.\""
        },
        {
          "body": "Ibn ‘Abbas told that God’s messenger sacrificed a ram on the seventh day for bothal-Hasanandal-Husain. \n\nAbu Dawud transmitted it. Nasa’i says two rams each."
        },
        {
          "body": "Allāhumma’j`alhu lanā faraṭan, wa salafan, wa ajra.O Allah, make him for us a precursor, a forerunner and a cause of reward.Reference:Al-Hasan(Al-Basri) used to recite SuratAl-Fatihah for a child's funeral and then say this.Al-Bukhari, Kitabul-Jana'iz, p. 65."
        },
        {
          "body": "Abu Sa'idal-Khudri (Allah be pleased with him) reported that mention was made of 'azl in the presence of Allah's Apostle (may peace be upon him) whereupon he said:Why do you practise it? They said: There is a man whose wife has to suckle the child, and if that person has a sexual intercourse with her (she may conceive) which he does not like, and there is another person who has a slave-girl and he has a sexual intercourse with her, but he does not like her to have conception so that she may not becomeUmmWalad, whereupon he (the Holy Prophet) said: There is no harm if you do not do that, for that (the birth of the child) is something pre- ordained. Ibn 'Aun said: I made a mention of this hadith toHasan, and he said: By Allah, (it seems) as if there is upbraiding in it (for 'azl)."
        },
        {
          "body": "Narrated Abu Hurairah:\"It was said, 'O Messenger of Allah, what equals Jihad?' He said: 'Verily, you (people) are not capable of it.' So they repeated it to him two or three times, each time he said, 'You (people) are not capable of it.' Then he said the third time: 'The example of the Mujahid in the path of Allah is like the one who fasts and stands (in prayer) and does not slacken from Salat, nor fasting, until the Mujahid in the cause of Allah returns.'\"There are narrations on this topic from Ash-Shifa', 'Abdullah bin Hubshi, Abu Musa', Abu Sa'eed,UmmMalikAl-Bahziyyah, and Anas.This Hadith is aHasanSahih. And it has been reported through more than one route from Abu Hurairah from the Prophet (saws)."
        },
        {
          "body": "Al-Hasanquoted Abu Huraira who reported God's messenger as saying, \"On the day of resurrection mankind will be reviewed three times, the first two consisting of disputing and excuses, but at the third the records of men's deeds will go quickly into their hands, some getting them in their right hands and some in their left.\" \n\nAhmad and Tirmidhi transmitted it, but Tirmidhi said this tradition is not sound, asal-Hasandid not hear anything from Abu Huraira and some have transmitted it onal-Hasan's authority quoting Abu Musa as his authority."
        },
        {
          "body": "It was narrated that AbuAl-Hasan, the freed slave of Banu Nawfal, said:\"Ibn 'Abbas was asked about a slave who divorced his wife twice, then they were set free; could he marry her? He said: 'Yes.' He said: 'From whom (did you hear that)?' He said: 'The Messenger of Allah issued a Fatwa to that effect.'\"\n (One of the narrators) 'Abdur-Razzaq said: \"IbnAl-Mubarak said to Ma'mar: 'WhichAl-Hasanis this? He has taken on a heavy burden.'\""
        },
        {
          "body": "Al-Hasansaid, \"There should be not sense of respect between you\nand a deviant person.\""
        },
        {
          "body": "Qatadah narrated fromAl-Hasan, from Samurah that:The Prophet prohibited celibacy."
        },
        {
          "body": "Narrated Abu Juhaifa:I saw the Prophet, andAl-Hasanresembled him."
        },
        {
          "body": "Alhasansaid “Rikaz means treasure buried in pre Islamic times.”"
        },
        {
          "body": "Qatadah said:Hoarding does not apply to dried dates. Ibnal-Muthanna said that he (Yahya b. Fayyad) reported on the authority ofal-Hasan. We (Ibnal-Muthanna) said to him (Yahya): Do not say: \"on the authority ofal-Hasan.\"Abu Dawud said: This tradition according to us is false.Abu Dawud said: Sa'id b.al-Musayyab used to hoard kernel, fodder, and seeds.Abu Dawud said: I heard Ahmad b. Yunus say: I asked Sufyan about hoarding fodder. He replied: They (the people in the past) disapproved of hoarding. I asked Abu Bakr b. 'Ayyash (about it). He replied: Hoard it."
        },
        {
          "body": "UmmHani’ said:The Prophet came in to visit me and asked whether I had anything. When I replied that I had nothing but some dry bread and vinegar he said, “Produce it; a house in which there is vinegar is not devoid of condiments.” \n\nTirmidhi transmitted it, saying this is ahasangharibtradition."
        },
        {
          "body": "Yahya related to me from Malik from Jafar ibn Muhammad that his\nfather said, \"Fatima, the daughter of the Messenger of Allah, may\nAllah bless him and grant him peace, weighed the hair ofHasan,\nHusayn, Zaynab andUmmKulthum, and gave away in sadaqa an equivalent\nweight of silver.\""
        },
        {
          "body": "Abd Allah b. Abi Awfa said:When the Messenger of Allah (may peace be upon him) raised his head after bowing, he said: Allah listens to him who praises Him. O Allah, our lord, to Thee be the praise in the heavens and in all the earth, and all that it please Thee to create afterwards.Abu Dawud said: Sufyanal-Thawri and Shu’bah b.al-Hajjaj reported on authority of Ubaid b.al-Hasan: There is no mention of the words “after bowing” in this tradition. Sufyan said: we metal-shaikh ‘Ubaid b.al-Hasan; he did not say the words “bowing” in it.Abu dawud said: Shu’bah narrated this from Abi ‘Ismah, fromal-A’mash, on the authority of ‘Ubaid, saying: “after bowing”."
        },
        {
          "body": "It was narrated from Ja'far bin Muhammad from his father that:Al-Hasanbin 'Ali was sitting when a funeral passed by. The People stood until the funeral had passed, andAl-Hasansaid: \"The funeral of Jew passed by when the Messenger of Allah was sitting in its path, and he did not want the funeral of a Jew to pass over his head, so he stood up.\""
        },
        {
          "body": "Narrated Abu Ja'far 'Abd Allah b. Nafi', the slave ofal-Hasanb. 'Ali:Abu Musa paid a sick visit toal-Hasanb. 'Ali.Abu Dawud said: He narrated the tradition to the same effect as narrated by Shu'bah.Abu Dawud said: This tradition has been transmitted by 'Ali from the Prophet (saws) without any sound manner."
        },
        {
          "body": "Abu Mas'udal-Jurayri related to him that a man askedal-Hasanabout reading, \"In the Name of Allah, the All-Merciful, Most Merciful.\"\nHe said, \"That should be put at the beginning of letters.\""
        },
        {
          "body": "Al-Hasantold inmursalform that he heard God’s Messenger had said, “God curse the one who looks and the one who is looked at!” \n\nBaihaqi transmitted it inShu'abal-iman."
        },
        {
          "body": "Abu Rafi narrated that :He passed byAl-Hasanbin Ali while he was performing Salat and he had gathered his locks at the back of his head, so he (Abu Rafi) undid them, andAl-Hasanturned to him angrily. He said: \"Resume your Salat and do not be angry, for indeed I heard Allah's Messenger (S) saying: 'That is the seat of Ash-Shaitan.'\""
        },
        {
          "body": "Narrated 'Ali:said: \"Al-Hasanis greater in resemblance to the Messenger of Allah (SAW) with regards to what is between the chest and the head, andAl-Husain is greater in resemblance to the Messenger of Allah (SAW) with regards to what is below that.\""
        },
        {
          "body": "Narrated `Uqba binAl-Harith:I saw Abu Bakr carryingAl-Hasanand saying, \"Let my father be sacrificed for you; you resemble the \nProphet and not `Ali,\" while `Ali was laughing at this."
        },
        {
          "body": "It was narrated that ‘Ali (رضي الله عنه) said:The Messenger of Allah (ﷺ) entered upon me when I was sleeping on the mattress.Al-HasanorAl-Husain asked for a drink, so the Prophet (ﷺ) went to a young sheep and milked it, thenAl-Hasancame to him and the Prophet (ﷺ) told him to wait. Fatimah said: O Messenger of Allah (ﷺ), it is as if he is the dearer of the two to you? He said: “No, but he asked for a drink first.” Then he said: `You and I and these two and this one who is sleeping will be in the same place on the Day of Resurrection.”"
        },
        {
          "body": "Narrated Yunus bin 'Ubaid:the freed salve of Muhammad binAl-Qasim said: \"Muhammad binAl-Qasim sent me toAl-Bara' bin 'Azib to ask him about the flag of the Messenger of Allah (saws). He said: 'It was a black square of Namirah.'\"[Abu 'Eisa said:] There are narrations on this topic from 'Ali,Al-Harith binHassan, and Ibn 'Abbas.[Abu 'Eisa said:] This Hadith isHasanGharib, we don know know of it except from the report of Ibn Abi Za'idah. And Abu Ya'qub Ath-Thaqafi's name is Ishaq bin Ibrahim. 'Ubaidullah bin Musa also reports from him."
        },
        {
          "body": "Narrated Ibn `Umar:The Prophet burnt the date-palm trees of Bani An-Nadir.Hassanbin Thabit said the following poetic \nVerses about this event:-- \"the terrible burning ofAl-Buwaira Has been received indifferently By the \nnobles of Bani Luai (The masters and nobles of Quraish).\" Abu Sufyan binAl-Harith (i.e. the \nProphet's cousin who was still a disbeliever then) replied toHassan, saying in poetic verses:-- \"May \nAllah bless that burning And set all its (i.e. Medina's) Parts on burning fire. You will see who is far \nfrom it (i.e.Al-Buwaira) And which of our lands will be Harmed by it (i.e. the burning ofAl- \nBuwaira)."
        },
        {
          "body": "Hisham binHassannarrated fromAl-Hasan:concerning the saying of Allah: O our Lord, give us good in this world, and good in the Hereafter. He said: “Knowledge and worship in this world, and Paradise in the Hereafter.”"
        },
        {
          "body": "Imam Muslim has reported this hadith byHasanb. 'Alial-Halwani and other traditions."
        },
        {
          "body": "NarratedAl-Bara:The Prophet said toHassan, \"Lampoon them (the pagans) in verse, and Gabriel is with you.\""
        },
        {
          "body": "NarratedAlBara:The Prophet said toHassan, \"Lampoon them (i.e. the pagans) and Gabriel is with you.\""
        }
      ]
    }
  ]
}