{
  "data": [
    {
      "hadith": [
        {
          "body": "It was narrated that Iyas binAbiRamlahsaid:\"I heard Mu'awiyah asking Zaid bin Arqam: 'Did you attend two 'Eids with the Messenger of Allah (SAW)?' He said: 'Yes; he prayed 'Eid at the beginning of the day then he granted a concession with regard to jumu'ah.'\""
        },
        {
          "body": "It was\nnarrated that Iyas binAbiRamlahAsh-Shami said:“I heard a\nman\nasking Zaid bin Arqam: ‘Were you present with the Messenger of\nAllah (saw) when there were two ‘Eid on one day?’ He said: ‘Yes.’\nHe\nsaid: ‘What did he do?’ He said: ‘He prayed the ‘Eid\nprayer, then he\ngranted a concession not to pray the Friday, then he\nsaid: “Whoever\nwants to pray (Friday), let him do so.”’”"
        },
        {
          "body": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us,Sufyānnarrated to us, he said:‘The people would transmit from Jābir before there appeared what appeared, then when there appeared what appeared, the people imputed him in his Ḥadīth and some of the people abandoned him’. So it was said to [Sufyān]: ‘What appeared?’ [Sufyān] said: ‘Belief in ar-Raj’ah’."
        },
        {
          "body": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us,Sufyānnarrated to us, he said, I heard a man ask Jābir about the verse:{Thus I will never depart from the land until my father permits me or Allah decides for me, and He is the best of Judges}[Yūsuf: 80]. Jābir said: ‘An interpretation has not come to me about these [verses]’.Sufyānsaid: ‘He lied’. We said toSufyān: ‘What did he mean by this?’ [Sufyān] said: ‘Indeed the Rāfiḍah say, ‘Alī is in the clouds and we will not emerge along with he who will emerge from his children [the Khalīfah] until a caller calls from the heaven, meaning Alī: ‘Ride out along with so-and-so [meaning the promised Mahdī]’. Jābir said, ‘that is an interpretation for these verses’, and he would lie as they were regarding the brothers of Yūsuf, peace be upon him’."
        },
        {
          "body": "Amr an-Nāqid narrated to us,Sufyānbin Uyaynah narrated to us, on authority of Hishām bin Hujayr, on authority of Tāwus, he said:‘A book was brought to Ibn Abbās which contained the verdicts of Alī, may Allah be pleased with him, and he effaced but a small amount,’ andSufyānbin Uyaynah indicated with his arm [the amount]."
        },
        {
          "body": "Muhammad bin Abī Umar al-Makkī narrated to us,Sufyānnarrated to us; and Abū Bakr bin Khallād al-Bāhilī narrated to us – and the wording is his, he said, I heardSufyānbin Uyaynah, on authority of Mis’ar, he said, I heard Sa’d bin Ibrāhīm saying:‘There is to be no narrating on authority of the Messenger of Allah, may Allah send blessings and peace upon him, except by trustworthy narrators (Thiqāt)’."
        },
        {
          "body": "Al-Faḍl bin Sahl narrated to me, he said, I asked Mu’allā ar-Rāzī about Muhammad bin Sa’īd whom Abbād transmitted from, so he informed me about what Īsā bin Yūnus said:‘I was at his door andSufyānwas with [Muhammad bin Sa’īd], then when he came out I asked [Sufyān] about him. So he informed me that he was a liar.’"
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Ata ibnAbiRabah that a mawla of AsmabintAbiBakr told him, \"We arrived at\nMina with AsmabintAbiBakr at the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""
        },
        {
          "body": "Narrated 'Ali binAbiTalib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "It was narrated from 'Irak bin Malik that ZainabbintAbiSalamah told him, that Umm Habibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbiSalamah.\" The Messenger of Allah said: \"As a co-wife to Umm Salamah? Even if I were not married to Umm Salamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "Yahyā bin Yahyā narrated to us, Umar bin Alī bin Muqaddam informed us, on authority ofSufyānbin Husayn, he said:‘Iyās bin Mu’āwiyah asked me saying: ‘Indeed I see that you love knowledge of the Qur’ān, so recite for me a Sūrah and explain it until I can reflect on what you know’. [Sufyān] said, so I did that, and [Iyās] said to me: ‘Memorize from me what I am about to say to you- Beware of abominations in Ḥadīth for indeed rarely does anyone convey them except he lowers himself and his Ḥadīth are denied’.’"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of AsmabintAbiBakr as-Siddiq.\"20.7 Wearing\nPerfume during Hajj."
        },
        {
          "body": "Asma'bintAbiBakr (RAA) narrated, 'During the lifetime of the Prophet (PBUH), we slaughtered a horse and ate it.' Agreed upon."
        },
        {
          "body": "It was narrated that AsmabintAbiBakr said:\"We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it\". (Sahih )"
        },
        {
          "body": "A similar report was narrated from SafiyyahbintAbi'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet."
        },
        {
          "body": "It was narrated from Ata binAbiRabah that a freed slave of Asma binAbiBakr told him:\"I came with AsmabintAbiBakr to Mina at the end of the night and I said to her: 'We have come to Mina at the end of the night.' She said: 'We sued to do this one who was better than you.'\""
        },
        {
          "body": "It was\nnarrated that Umm Hani’bintAbiTalib said:“I used to hear\nthe\nProphet (saw) reciting at night when I was on the roof of my\nhouse.”"
        },
        {
          "body": "It was narrated from SafiyyahbintAbi'Ubaid that she heard Hafsahbint'Umar, the wife of the Prophet, (narrate) that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "It was narrated that Umm HabibahbintAbiSufyan said:\"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\""
        },
        {
          "body": "'A’ishabintSa'd ibnAbiWaqqas reported that her father said:“The Prophet (Allah bless him and give him peace) used to drink while standing.”"
        },
        {
          "body": "It was narrated that Asma'bintAbiBakr said:\"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\""
        },
        {
          "body": "It was\nnarrated from Umm HabibahbintAbiSufyan that the Prophet\n(saw)\nsaid:“Whoever performs twelve Rak’ah (of Sunnah) during the day\nand night, a house will be built for him in Paradise.”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir told him that she used to see AsmabintAbiBakrat\nMuzdalifa telling whoever led the subh prayer for her and her\ncompanions to pray it as soon as the dawn broke, after which she would\nmount and go to Mina without stopping at all."
        },
        {
          "body": "It was narrated from Asma'bintAbiBakr that the Prophet said to her:\"Do not count what you give, otherwise Allah, the Mighty and Sublime, will count what He gives to you.\""
        },
        {
          "body": "'Urwah narrated that ZainabbintAbiSalamah -whose mother was Umm Salamah, the wife of the Prophet- told him that Umm HabibahbintAbiSufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry DurrahbintAbiSalamah.' He said: 'The daughter of Umm Salamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "Sulaiman bin Musa narrated that:When Muhammad binAbiSufyan was dying, he was greatly distressed and said: \"My sister Umm HabibahbintAbiSufyan said: 'The Messenger of Allah (SAW) said: Whoever maintains four rak'ahs before Zuhr and four after, Allah (SWT) will forbid him from the Fire.'\""
        },
        {
          "body": "Narrated Asma'bintAbiBakr:Allah's Apostle once stood up delivering a sermon and mentioned the trial which people will face in \nthe grave. When he mentioned that, the Muslims started shouting loudly."
        },
        {
          "body": "It was narrated from Asma'bintAbiBakr that a woman asked the Messenger of Allah (PBUH) about menstrual blood that gets on clothes. He said:\"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\""
        },
        {
          "body": "Yahya related to me from Malik from Musa ibn Maysara from Abu\nMurra, the mawla of Aqil ibnAbiTalib, that Umm HanibintAbiTalib\ntold him that in the year of the conquest the Messenger of Allah, may\nAllah bless him and grant him peace, prayed eight rakas, covering\nhimself with one garment."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from Fatimabintal-Mundhir that whenever a woman who had a fever, was brought to\nAsmabintAbiBakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\""
        },
        {
          "body": "It was narrated from Asma'bintAbiBakr taht a woman asked the Messenger of Allah (PBUH) about menstrual blood that gets on clothes. He said:\"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\""
        },
        {
          "body": "Muhammad bin ul-Muthannā narrated to us, he said Abd ur-Rahman narrated to us, he saidSufyānnarrated to us, on authority of Abī Ishāq, on authority of Abīl-Ahwas, on authority of Abd Illah, he said:‘It is enough of a lie for a man that he narrates everything he hears’."
        },
        {
          "body": "Salamah bin Shabīb narrated to me, al-Humaydī narrated to us,Sufyānnarrated to us, he said I heard Abū Mūsā [Isrā’īl bin Mūsā al-Basrī] saying:‘Amr bin Ubayd narrated to us before what happened’ [i.e. before he became Mu’tazilī]."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that SafiyyabintAbiUbayd told him that Hafsa, umm al-muminin, sent Asim ibn Abdullah ibn\nSad to her sister FatimabintUmar ibn al-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her."
        },
        {
          "body": "It was\nnarrated from Abu ‘Umar, the freed slave of Asma’, from Asma’bintAbiBakr, that she brought out a cloak edged with brocade and\nsaid:“The Prophet (saw) used to wear this when he met the enemy.”"
        },
        {
          "body": "It was narrated from Hisham bin 'Urwah, from his wife Fatimah, from Asma'bintAbiBakr, that:The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done."
        },
        {
          "body": "It was\nnarrated that Jabir said:“Asma’bint‘Umais gave birth to\nMuhammad binAbiBakr and sent word to the Prophet (saw). He told her\nto take a bath, fasten a cloth around her private part and begin the\nTalbiyah.”"
        },
        {
          "body": "It was narrated from FatimahbintAbiHubaish that she suffered from Istihadah and the Messenger of Allah (PBUH) said to her:\"If it is menstrual blood then it is blood that is black and recognizable, so stop praying, and if it is other than that then perform Wudu', for it is just a vein.\""
        },
        {
          "body": "It was narrated from FatimahbintAbiHubaish that she suffered from Istihadah and the Messenger of Allah (PBUH) said to her:\"If it is menstrual blood then it is blood that is black and recognizable, so stop prying, and if it is other than that then perform Wudu', for it is just a vein.\""
        },
        {
          "body": "Narrated ZainabbintUm Salama:When Um HabibabintAbiSufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\""
        },
        {
          "body": "Narrated Um HanibintAbiTalib:I went to Allah's Apostle in the year of the conquest of Mecca and found him taking a bath while \nFatima was screening him. The Prophet asked, \"Who is it?\" I replied, \"I am Um-Hani.\""
        },
        {
          "body": "It was narrated from 'Aishah that FatimahbintAbiHubaish suffered from Istihadah (non-menstrual vaginal bleeding). The Messenger of Allah (PBUH) said to her:\"Menstrual blood is blood that is black and recognizable, so if it is like that, then stop praying, and if it is otherwise, then perform Wudu' and pray.\"\nAbu 'Abdur-Rahman said: Others reported this Hadith, and none of them mentioned what IbnAbi'Adi mentioned. And Allah Most High, knows best."
        },
        {
          "body": "Muhammad bin Abd Allah bin Quhzādh, from the people of Marw, narrated to me, he said Alī bin Husayn bin Wāqid informed me, he said Abd Allah bin al-Mubārak said, I said toSufyānath-Thawrī:‘Indeed Abbād bin Kathīr, about whose condition you are aware, when he related [narrations] he introduced a grave matter- do you believe that it should be said to the people ‘Do not take from him?’Sufyānsaid: ‘Indeed!’ Abd Allah [bin al-Mubārak] said: ‘So when I was in an assembly and Abbād was mentioned there, I praised him regarding his Dīn and said: ‘Do not take from him.’Muhammad said, Abd Allah bin Uthmān narrated to us, he said, my father said, Abd Allah bin al-Mubārak said: ‘I ended up in an assembly of Shu’bah, and he said: ‘This is Abbād bin Kathīr so be warned against him.’"
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that AsmabintUmays gave birth to Muhammad ibnAbiBakr\nat Dhu'l-Hulayfa and Abu Bakr told her to do ghusl and then enter\nihram."
        },
        {
          "body": "AsmabintAbiBakr  said:\" O the Messenger of Allah! I have nothing except what was given to me by (my husband) Az-Zubair, shall I give it (in charity)?'\" It was said: \"Do not hold (your wealth) so that Allah will hold against you.\""
        },
        {
          "body": "Amr bin Alī Abū Hafs narrated to us, he said I heard Yahyā bin Sa’īd, he said:‘I askedSufyānath-Thawrī , Shu’bah, Mālik, and Ibn Uyaynah about a man who is not reliable (Thabt) in Ḥadīth, and someone comes and asks me about him, and they said: ‘Inform [others] against him that he is not reliable’.’"
        },
        {
          "body": "Hasan al-Hulwānī narrated to us, Abū Yahyā al-Himmānī narrated to us, Qabīsah and his brother [Sufyānbin Uqbah] narrated to us, that they heard al-Jarrāh bin Malīh saying, I heard Jābir say:‘I have 70,000 Ḥadīth all of which are on authority of Abū Ja’far on authority of the Prophet, peace and blessings upon him’."
        },
        {
          "body": "It was narrated from ZainabbintAbiSalamah:that the wives of the Prophet all differed with 'Aishah and refused to allow anyone with ties of breastfeeding like Salim, the freed salve of Abu Hudhaifah, to enter upon them. They said: “How do we know? That may be a concession granted only to Salim.”"
        },
        {
          "body": "It was narrated that Abu Qatadah said:\"I saw the Messenger of Allah (SAW) leading the people in prayer, carrying UmamahbintAbiAl-'As on his shoulder. When he bowed he put her down and when he finished prostrating he picked her up again.\""
        },
        {
          "body": "It was narrated that Jabir said:\"Asma'bint'Umais gave birth to Muhammad binAbiBakr and she sent word to the Messenger of Allah asking him what she should do. He told here to perform Ghusl and wrap her private parts in a cloth, and to begin the talbiyah."
        },
        {
          "body": "Narrated Kulaib bin Wail:I asked ZainabbintAbiSalama (i.e. daughter of the wife of the Prophet, \"Tell me about the Prophet . \nDid he belong to the tribe of Mudar?\" She replied, \"Yes, he belonged to the tribe of Mudar and was \nfrom the offspring of An-Nadr bin Kinana.\""
        },
        {
          "body": "ZainabbintAbiSalamah said:\"I heard 'Aisha, the wife of the Prophet say: 'SahlahbintSuhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\""
        },
        {
          "body": "Yahya related to me from Malik from Muhammad ibnAbiHarmala, the\nmawla of Abd ar-Rahman ibnAbiSufyan ibn Huwaytib, that ZaynabbintAbiSalama died during the time that Tariq was amir of Madina and her\nbier was brought out after subh and put in al-Baqi. He said that Tariq\nused to pray subh right at the beginning of its time. He added, \"I\nheard Abdullah ibn Umar say to the family, 'You can either pray over\nyour dead now or you can wait until the sun comes up.' \""
        },
        {
          "body": "Ibn Quhzādh narrated to me, he said, I heard Wahb [bin Zam’ah] saying, on authority ofSufyān[bin Abd il-Mālik], on authority of Ibn al-Mubārak, he said:‘Baqiyyah [bin al-Walīd] is truthful of tongue however he transmits [Ḥadīth] from those who approach [the Muhaddithīn, i.e. are trustworthy] and from those who turn their backs on [the Muhaddithīn, i.e. and are weak]’."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that AsmabintAbiBakr said to her family, \"Perfume my clothes with incense\nwhen I die and then embalm me. Do not put any of the embalming\nsubstance on my shroud, and do not follow me with a burning torch.\""
        },
        {
          "body": "It was narrated that Abu Qatadah said:\"I saw the Messenger of Allah (saws)leading the people in prayer, carrying UmamahbintAbiAl-As on his shoulder. When he bowed he put her down and when he stood up from prostration he picked  her up again.\""
        },
        {
          "body": "Narrated `Aisha:FatimabintAbiHubaish used to have bleeding in between the periods, so she asked the Prophet about \nit. He replied, \"The bleeding is from a blood vessel and not the menses. So give up the prayers when \nthe (real) menses begins and when it has finished, take a bath and start praying.\""
        },
        {
          "body": "It was narrated from ZainabbintAbiSalamah that Umm Salamah said:\"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\""
        },
        {
          "body": "It was narrated from ZainabbintAbiSalamah that Umm Habibah said:\"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "Yahya related to me from Malik from Ishaq ibn Abdullah ibnAbiTalha from HumaydabintAbiUbayda ibn Farwa that her maternal aunt\nKabshabintKab ibn Malik, who was the wife of the son of Abu Qatada\nal-Ansari, told her that once Abu Qatada was visiting her and she\npoured out some water for him to do wudu with. Just then a cat came to\ndrink from it, so he tilted the vessel towards it to let it drink.\nKabsha continued, \"He saw me looking at him and said, 'Are you\nsurprised, daughter of my brother?' I said, 'Yes.' He replied that the\nMessenger of Allah, may Allah bless him and grant him peace, said,\ncats are not impure. They intermingle with you .' \"Yahya\nsaid that Malik said, \"There is no harm in that unless one sees\nimpurities on the cat's mouth.\""
        },
        {
          "body": "It was narrated from ZainabbintAbiSalamah that Umm Habibah, the wife of the Prophet said:\"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\" Umm Habibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry DurrahbintAbiSalamah.\" He said: \"The daughter of Umm Salamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.\""
        },
        {
          "body": "Asma'bintAbiBakr said, \"In the time of the Prophet, may Allah bless\nhim and grant him peace, my mother came to me hoping (I would be dutiful).\nI asked the Prophet, may Allah bless him and grant him peace, 'Do I have\nto treat her well?' 'Yes,' he replied.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakr that\nAsmabintUmays washed Abu Bakr as-Siddiq when he died. Then she went\nout and asked some of the muhajirun who were there, \"I am fasting and\nthis is an extremely cold day. Do I have to do ghusl?\" They said,\n\"No.\""
        },
        {
          "body": "Narrated Asma'bintAbiBakr:A woman asked Allah's Apostle, \"O Allah's Apostle! What should we do, if the blood of menses falls \non our clothes?\" Allah's Apostle replied, \"If the blood of menses falls on the garment of anyone of \nyou, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it)."
        },
        {
          "body": "It was narrated from SafiyyahbintAbi'Ubaid from one of the wives of the Prophet, and from Umm Salamah, that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "Asma'bintAbiBakr narrated:\"I heard the Messenger of Allah (s.a.w) while mentioning the Lote-Tree of the Utmost Boundary, saying: 'A rider will travel in the shade of one of its branches for a hundred years,' or 'a hundred riders will seek to shade themselves with its shade'-(lne of the narrators) Yahya' was in doubt- 'in it are butterflies of gold, it is as if its fruits are Qilal.\""
        },
        {
          "body": "HumaidahbintUbaid bin Rifa'ah narrated:\"KabshahbintKa'b bin Malik - she was (married) with IbnAbiQatadah - narrated \"That Abu Qatadah visited her, [so she said:] 'So I poured water for him to use for Wudu.' She said: 'A cat came to drink, so he lowered he container until it drank.' Kabshah said: 'So he saw me looking at it and said, \"O my niece! Are you surprised at that?\" So I said yes. He said: \"Indeed Allah's  Messenger said 'It is not impure, it is only one of those roam around among you.'\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakr ibn\nHazm from his father from AmrabintAbd ar-Rahman that A'isha umm al-\nmuminin said to the Messenger of Allah, may Allah bless him and grant\nhim peace, \"Messenger of Allah, SafiyyabintHuyy has begun her\nperiod,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Perhaps she will delay us. Has she done tawaf of the\nHouse with you?\" They said, \"Of course.\" He said, \"So you are free to\nleave.\""
        },
        {
          "body": "Yahya related to me from Malik from Alqama ibnAbiAlqama that\nhis mother said, \"HafsabintAbd ar-Rahman visited A'isha, the wife of\nthe Prophet, may Allah bless him and grant him peace, and Hafsa was\nwearing a long thin head scarf. A'isha tore it in two and made a thick\none for her.\""
        },
        {
          "body": "Narrated `Aisha:FatimabintAbiHubaish asked the Prophet, \"I got persistent bleeding (in between the periods) and do \nnot become clean. Shall I give up prayers?\" He replied, \"No, this is from a blood vessel. Give up the \nprayers only for the days on which you usually get the menses and then take a bath and offer your \nprayers.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"FatimahbintAbiHubaish said to the Messenger of Allah (PBUH): 'O Messenger of Allah (PBUH), I do not become pure. Should I stop praying?' The Messenger of Allah (PBUH) said: 'That is a vein and is not menstruation. When your period comes, stop praying, and when it has passed, then wash the blood from yourself and pray.'\""
        },
        {
          "body": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abu Murra, the mawla of Aqil ibnAbiTalib, told\nhim that he had heard Umm HanibintAbiTalib say, \"I went to the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the conquest and found him doing ghusl while his daughter\nFatima, was screening him with a garment. I said to him, 'Peace be\nupon you' and he said, 'Who is that?' I replied, 'Umm HanibintAbiTalib,' and he said, 'Welcome, Umm Hani!'  When he had finished his\nghusl, he stood and prayed eight rakas, covering himself with one\ngarment, and then came away. I said, 'Messenger of Allah, the son of\nmy mother, AIi, says that he is determined to kill so-and-so, son of\nHubayra, a man I have placed under my protection.'  The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'We give\nprotection to whoever you have given protection to, Umm Hani.' \"Umm Hani related that this incident happened in the morning."
        },
        {
          "body": "Al-Hasan al-Hulwānī narrated to us, he said Nu’aym bin Hammād narrated to us, he said Abū Ishāq Ibrāhīm bin Muhammad binSufyānsaid; and Muhammad bin Yahyā narrated to us, he said, Nu’aym bin Hammād narrated to us, Abū Dāwud at-Tayālisī narrated to us, on authority of Shu’bah, on authority of Yūnus bin Ubayd, he said:‘Amr bin Ubayd would lie regarding Ḥadīth’."
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair that ZainabbintAbiSalmah told him that Umm Habibah told her that she said to Messenger of Allah:“Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry DurrahbintAbiSalmah.” The Messenger of Allah said:  The daughter of Umm Salamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”"
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, umm al-muminin, proposed to QuraybabintAbiUmayya on behalf of Abd ar-Rahman ibnAbiBakr. They married her\nto him and her people found fault with Abd ar-Rahman and said, \"We\nonly gave in marriage because of A'isha.\" A'isha therefore sent for\nAbd ar-Rahman and told him about it. He gave Qurayba authority over\nherself and she chose her husband and so there was no divorce."
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair that FatimahbintAbiHubaish narrated to him that:She went to the Messenger of Allah and complained to him about bleeding. The Messenger of Allah said: \"Rather that is a vein, so look and see when your period comes, then do not perform the prayer. When the period is over, then purify yourself and perform the prayer between one period to the next.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakr from\nhis father from AmrabintAbd ar-Rahman that a thief stole a citron in\nthe time of Uthman Uthman ibn Affan ordered its value to be estimated\nand it was estimated at three dirhams at the rate of exchange of\ntwelve dirhams for the dinar, so Uthman cut off his hand."
        },
        {
          "body": "It was narrated from ZainabbintAbiSalamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:\"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\""
        },
        {
          "body": "It was narrated that 'Aishah said:FatimahbintAbiHubaish came to the Messenger of Allah (PBUH) and said: \"I am a woman who suffers from Istihadah and I never become pure. Should I stop praying?\" He said: \"No, that is a vein, it is not menstruation. When your period comes, stop praying, and when it goes, wash the blood from yourself and pray.\""
        },
        {
          "body": "It was narrated from 'Aishah that FatimahbintAbiHubaish suffered from Istihadah. The Messenger of Allah (PBUH) said to her:\"Menstrual blood is blood that is black and recognizable, so if it is like that, then stop praying, and if it is otherwise, then perform Wudu' and pray.\"\nAbu 'Abdur-Rahman said: Others reported this Hadith, and none of them mentioned what Ibn 'Adi mentioned, and Allah knows best."
        },
        {
          "body": "It was narrated from 'Amr bin Az-Zubair that FatimahbintAbiHubaish told him that she came to the Messenger of Allah and complained to him about (continual) bleeding. The Messenger of Allah said to her:\"That is a vein. Look and when your period comes, do not pray, and when your period ends, then purify yourself and pray during the time between one period and the next.\""
        },
        {
          "body": "Ibrahim ibn Marzuq ath-Thaqafi related that his father (who had\nbelonged to Allah ibn az-Zubayr) told him, \"'Abdullah ibn az-Zubayr sent\nme to his mother, Asma'bintAbiBakr and he told her how al-Hajjaj was\ntreating them. She made supplication for me and stroked my head. I was\na young boy at that time.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"FatimahbintAbiHubaish came to the Prophet: 'O Messenger of Allah! I am a woman who bleeds continuously and never becomes pure. Should I give up prayer?' he said: 'No, that is just a vein and is not menstruation. Do not perform prayer during the days of your period, then take a bath, and perform ablution for each prayer, even if drops of blood fall on the mat.'\""
        },
        {
          "body": "Aishah narrated:\"FatimahbintAbi-Hubaish came to the Prophet and said: 'O Messenger of Allah! I am a woman who suffers from persistent bleeding and I do not become clean. Shall I give up Salat?' He said: 'No. That is only a bIood vessel, it is not menstruation. When your menstruation begins then leave the Salat. And when it ends, then wash the blood from you and perform Salat.\""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from AsmabintUmays that she gave birth to Muhammad\nibnAbiBakr at al-Bayda. Abu Bakr mentioned this to the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, \"Tell her\nto do ghusl and then enter ihram.\""
        },
        {
          "body": "It was narrated that 'Aishah said:FatimahbintAbiHubaish came to the Messenger of Allah (PBUH) and said: \"I am a woman who suffers from Istihadah (non-menstrual vaginal bleeding) and I never become pure. Should I stop praying?\" He said: \"No, that is a vein, it is not menstruation. When you period comes, stop praying, and when it goes, wash the blood from yourself and pray.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"FatimahbintAbiHubaish said to the Messenger of Allah (PBUH): 'O Messenger of Allah (PBUH), I do not become pure. Should I stop praying? The Messenger of Allah (PBUH) said: 'That is a vein and is not menstruation. When your period comes, stop praying, and when the same amount of time as your regular period has passed, then wash the blood from yourself and pray.'\""
        },
        {
          "body": "It was narrated that 'Aishah said:FatimahbintAbiHubaish said to the Messenger of Allah (PBUH): \"O Messenger of Allah (PBUH), I do not become pure. Should I stop praying?\" The Messenger of Allah (PBUH) said: \"That is a vein and is not menstruation. When your period comes, stop praying, and when the same amount of time as your regular period has passed, then wash the blood from yourself and pray.\""
        },
        {
          "body": "Narrated Abu Usama from Hisham bin 'Urwa from Fatima:AsmabintAbiBakr said, \"We broke our fast during the lifetime of the Prophet on a cloudy day and \nthen the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \n\"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in \nlieu of that day or not.\""
        },
        {
          "body": "It was narrated from Asma'bintAbiBakr that she came to the Prophet and said:\"O Prophet of Allah, I do not have anything but that which Az-Zubair brings to me. Is there any sin on me if I give a small amount of that which he brings to me?\" He said: Give whatever you can, and do not withhold what you have, lest Allah withhold provision from you.\""
        },
        {
          "body": "Narrated Aslam:While I was in the company of `Abdullah bin `Umar on the way to Mecca, he received the news of the \nsevere illness of SafiyabintAbiUbaid (i.e. his wife), so he proceeded at greater speed, and when the \ntwilight disappeared, he dismounted and offered the Maghrib and `Isha 'prayers together and said, \" I \nsaw the Prophet delaying the Maghrib prayer to offer it along with the `Isha' when he was in a hurry \non a journey.\""
        },
        {
          "body": "Yahya related to me from Malik fromAbdullah ibnAbiBakr that a\nmawla of AmirbintAbd ar-Rahman called Ruqayya told him that she once\nset out with AmrabintAbd ar-Rahman to go to Makka. She said, ''Amra\nentered Makka on the eighth of Dhu'l-Hijja, and I was with her. She\ndid tawaf of the House, and say between Safa and Marwa, and then\nentered the back of the mosque. She asked me, 'Do you have a pair of\nscissors with you?' and I said, 'No.' She said, 'Then try and find\nsome for me.' I went and looked for some and brought them back and she\ncut some hair from the tresses of her head.Then, on the day of\nsacrifice, she slaughtered a sheep.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"FatimahbintAbiHubaish came to the Messenger of Allah and said: 'O Messenger of Allah! I am a woman who bleeds continuously and never becomes pure, should I give up the prayer?' He said: 'No, rather that is a vein and it is not menstruation. When the time of your period comes, leave off the prayer, and when it is over, take a bath and wash the blood from yourself and perform the prayer.\" This is the Hadith of Waki'."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that AsmabintAbiBakr had worn clothes that were completely\ndyed with safflower while she was in ihram, though there was not any\nsaffron in them.Yahya said that Malik was asked if a garment\nwhich had been perfumed could be used for ihram if the smell of the\nperfume had gone, and he said, \"Yes, as long as there is no saffron or\nyellow dye in it.\""
        },
        {
          "body": "Yahya related to me from Malik, from Rabia ibnAbiAbd ar-Rahman,\nfrom Sulayman ibn Yasar, that the Messenger of Allah, may Allah bless\nhim and grant him peace, sent Abu Rafi and a man of the Ansar to\narrange his marriage to Maymunabintal-Harith, and the Messenger of\nAllah, may Allah bless him and grant him peace, was in Madina before\nhe had left for umra."
        },
        {
          "body": "Sa`d binAbiWaqqas narrated:From KhawlahbintAl Hakim As-Sulamiyyah, that the Messenger of Allah (saws) said: “Whoever stops at a stopping place and then says: ‘I seek refuge in Allah’s Perfect Words from the evil of what He has created, (A`ūdhu bi-kalimātillāhit-tāmmāti min sharri mā khalaq)’ nothing shall harm him until he departs from that stopping place of his.”"
        },
        {
          "body": "Narrated Asma'bintAbiBakr:The Prophet prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my \nLord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was \nbeing scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. \nthe cat) till it died of hunger.\""
        },
        {
          "body": "Narrated Asma 'bintAbiBakr:During the period of the peace treaty of Quraish with Allah's Apostle, my mother, accompanied by her \nfather, came to visit me, and she was a pagan. I consulted Allah's Apostle, \"O Allah's Apostle! My \nmother has come to me and she desires to receive a reward from me, shall I keep good relation with \nher?\" He said, \"Yes, keep good relation with her.\""
        },
        {
          "body": "Yahya related to me from Malik from Nafi from SafiyyabintAbiUbayd from A'isha and Hafsa, the wives of the Prophet, may Allah bless\nhim and grant him peace, that the Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"It is not halal for a woman in\nmourning for someone who has died, if she trusts in Allah and the Last\nDay, to abstain from adornment for more than three nights, except for\na husband.\""
        },
        {
          "body": "Narrated `Aisha:FatimabintAbiHubaish said to Allah's Apostle, \"O Allah's Apostle! I do not become clean (from \nbleeding). Shall I give up my prayers?\" Allah's Apostle replied: \"No, because it is from a blood vessel \nand not the menses. So when the real menses begins give up your prayers and when it (the period) has \nfinished wash the blood off your body (take a bath) and offer your prayers.\""
        }
      ]
    }
  ]
}