{
  "data": [
    {
      "hadith": [
        {
          "body": "Jābir reported:“The Messenger of Allah ﷺ went out toaṣ-Ṣafā and said. We will start with that with which Allah started. Then he recited the verse: 'Verily, (the hills of)aṣ-Ṣafā and Al-Marwah are of the symbols of Allah… (Al-Baqarah, 2:158)'\"Reference:Sunan an-Nasa'i 2970"
        },
        {
          "body": "'A'isha (Allah be pleased with her) reported:We feared that Safiyyah might have entered the period of menses before performing Tawaf Ifada. Allah's Messenger (may peace be upon him) came to us and said: Is Safiyyah going to detain us? Thereupon we said: She has performed Tawaf Ifada. He (the Holy Prophet) said: Then there is no detention (for us) now."
        },
        {
          "body": "A version of the tradition narrated on the authority of Jabir (but through a different chain of transmitters) mentions the undesirability of coining to one's house like a night visitor, but does not contain the words:\" Doubting their fidelity or spying into their lapses.\""
        },
        {
          "body": "Ibn Majahadded, on the authority ofUmmSalamah (RAA), “with regards to it being a sin.”"
        },
        {
          "body": "Al-Harith ibn 'Abdullah al-Ansari said, \"I sawUmmad-Darda' going to visit (a sick) Ansari man from the mosque and she was on her mount in an uncovered howdah.\""
        },
        {
          "body": "UmmSalamah (RAA) narrated that she was wearing golden ornaments and asked the Messenger of Allah (P.B.U.H.), ‘Is it considered as a treasure?’ He said, “If you pay the due Zakah, then it is not considered as a treasure.” Related by Abu Dawud andAd-Daraqutni."
        },
        {
          "body": "UmmSalama said that the Prophet used to say after the dawn prayer, “O God, I ask Thee for beneficial knowledge, acceptable action, and good provision.” \n\nAhmad, Ibn Majah and Baihaqi, in [Kitab]ad- Da'awat al-kabir, transmitted it."
        },
        {
          "body": "Ummad-Darda' said, \"Abu'd-Darda' stood up in the night to pray.\nHe was weeping and said, 'O Allah! You made my physical form good, so make\nmy character good!' until morning. I said, 'Abu'd-Darda', your only supplication\nfor the entire night was for good character!' He replied, 'Ummad-Darda',\nthe Muslim perfects his character until good character\nenters him into Paradise; and taints his character until\nhis bad character enter him into Hellfire. The Muslim is forgiven while\nhe is asleep.' I asked, 'Abu'd-Darda', how can be forgiven while he is\nasleep?' He said, 'His brother arises in the night, performs the night\nprayer, and supplicates to Allah Almighty and is answered. He\nsupplicates for his Muslim brother and his supplication is answered.'\""
        },
        {
          "body": "AddedMuslim:UmmSalama said, “Does this happen (to a woman)?” He (saw) said, “Yes, otherwise where does the resemblance (of a child to its mother) come from?”"
        },
        {
          "body": "Ummad-Darda' reported that a man came up to her and said, \"A man\nhas said bad things about you in the presence of 'Abdu'l-Malik.' She said,\n\"We are suspected of something which we did not do. How often we have been\npraised for what we did not do!\""
        },
        {
          "body": "UmmSalama said:God’s Messenger taught me to say when theadhanfor the sunset prayer was called, “O God, this is the time when Thy night comes on, Thy day retires, and the voices of Thy summoners are heard, so forgive me.” \n\nAbu Dawud transmitted it, as did Baihaqi inad-Da'awat al-kabir."
        },
        {
          "body": "UmmSalama said the Prophet used to pray tworak'asafter thewitr. \n\nTirmidhi transmitted it, and Ibn Majahaddedthat they were short ones which he prayed while sitting."
        },
        {
          "body": "Ibn ‘Umar reported God’s Messenger as saying, “Bilal summons to prayer when it is still night, so eat and drink till IbnUmmMaktum makes the summons.” Headdedthat IbnUmmMaktum was a blind man who did not make the summons till someone said to him, “The morning has come, the morning has come.” \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "UmmHani' narrated that she entered upon the Prophet (PBUH) on the day of the Conquest of Makkah, when he was performing Ghusl - while a garment was screening him - from a vessel in which were traces of dough. She said:He prayedAd-Duha - but I do not know how many Rak'ahs he prayed - after he finished Ghusl.'\""
        },
        {
          "body": "UmmSalama reported Allah's Messenger (may peace be upon him) as saying:You bring to me, for (judgment)yourdisputes, some of you perhaps being more eloquent in their plea than others, so I give judgment on theirbehalfaccording to what I hear from them. (Bear in mind, in my judgment) ifIslice off anything for him from the right of his brother, he should not accept that, for I sliced off for him a portion from the Hell."
        },
        {
          "body": "UmmSalama told howUmmSulaim said, \"Messenger of God, God is not ashamed of the truth. Is any washing necessary for a woman when she has a sexual dream?” He replied, \"Yes, when she sees signs of liquid.”UmmSalama then covered her face and said, \"Messenger of God, does a woman have sexual dreams?” He replied, \"Of course she does. In what way does her child resemble her?” \n\n(Bukhari and Muslim.) Muslimaddedin the version ofUmmSulaim, \"The man’s liquid is coarse and white, the woman’s fine and yellow, so the resemblance comes from the one which prevails or comes first.”"
        },
        {
          "body": "Ummad-Darda’ said that on one occasion Abud Darda’ was angry when he came in, and on her asking what had made him angry, he replied, “I swear by God that the only good thing I know about Muhammad’s people is that they pray in congregation.”* \n\n* The suggestion is that they have become so corrupt that this is the only respect in which they obey the Prophet’s commands.\n\nBukhari transmitted it."
        },
        {
          "body": "Ummad-Darda' said, \"Salman came from al-Mada'in (Ctesiphon) to\nSyria to visit us on foot wearing a shirt (kisa') and trousers.\" Shawdhab\nsaid, \"Salman was seen wearing a short with all his hair shaved off and\nhis large ears showing. He was told, 'You have made yourself ugly.' He\nreplied, \"The real good is the good of the Next World.'\""
        },
        {
          "body": "Abdur-Rahman bin Abi Laila narrated:\"No one informed that they saw Allah's Messenger prayingAd-Duha exceptUmmHani. She narrated that Allah's Messenger entered her house on the Day of the Conquest of Makkah. He performed Ghusl and performed eight voluntary Rak'ah such that she had not ever seen him pray any Salat lighter than them, but that he completed the bowing and prostrations.\""
        },
        {
          "body": "'A'isha reported:UmmHabiba andUmmSalama made a mention before the Messenger of Allah (may peace be upon him) of a church which they had seen in Abyssinia and which had pictures in it. The Messenger of Allah (may peace be upon him) said: When a pious person amongst them (among the religious groups) dies they build a place of worship on his grave, and then decorate it with such pictures. They would be the worst of creatures on the Day of judgment in thesightof Allah."
        },
        {
          "body": "It was narrated thatUmmSalamah said:\"The Messenger of Allah [SAW] said: 'You refer your disputes to me, but I am only human. And some of you may be more eloquent in arguing their case than others, and I may pass judgment on thebasisof what I hear. If I pass judgment infavorof one of you against his brother's rights, then it is a piece of the fire that I am giving him.'\""
        },
        {
          "body": "UmmMa'bad said she heard God’s messenger say, “O God, purify my heart from hypocrisy, my action from vain show, my tongue from falsehood and my eyes from wrongful glances, for Thou knowest the surreptitious looks of the eyes and what is concealed in the breasts.” 2 \n\nBaihaqi transmitted the two traditions in [Kitab]ad-Da'awat al-kabir.\n\n2. cf. Qur’an, xl, 19."
        },
        {
          "body": "UmmHani’ said that the Prophet entered her house on the day of the Conquest of Mecca, bathed and prayed eightrak'as,adding, “I never saw a shorter prayer than it, except that he performed the bowing and the prostration completely.” In another version she said, “That was in the forenoon.” \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "Ibn 'Umar (May Allah be pleased with them) reported:The Messenger of Allah (PBUH) had two Mu'adhdhin: Bilal and IbnUmmMaktum (May Allah be pleased with them). The Messenger of Allah (PBUH) said, \"Bilal proclaims Adhan[call to Salat (prayer)]at fag end of night, so eat and drink till IbnUmmMaktum pronounces Adhan.\" Ibn 'Umar (May Allah be pleased with them)added: And the gap between their Adhan was not more than the time spent in one's getting down and the other's climbing (the minaret).[Al-Bukhari and Muslim]."
        },
        {
          "body": "Ubu Juhaifah narrated from his father who said:\"The Messenger of Allah (s.a.w) made a bond of brotherhood  between Salman and AbuAd-Darda. Salman went to visit AbuAd-Darda, and sawUmmAd-Darda wearing shabby clothes, So he said: 'Why are you wearing such shabby clothes?' She said: 'Your brother AbuAd-Darda has no interest in the world.' So when AbuAd-Darda arrived, he prepared some food for him (Salman) and said: 'Eat, for I am fasting.' He said: 'I shall not eat until you eat.'\" He said: \"So he ate. When night came AbuAd-Darda started to leave and stand (in prayer), but Salman said to him: 'Sleep.' So he slept. Then he went to stand (in prayer) but he said to him: 'Sleep'. So he slept. When the morning (Fajr) came,Salman said: 'Get up now.'So he got up to perform Salat. Then he (Salman) said: 'Indeed your self has a right upon you, your Lord has a right upon you, your guest has a right upon you, and your family has a right upon you. So give each the right they are due. The Prophet (s.a.w), and that was mentioned to him, so he said: 'Salman has told the truth.'\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The Messenger of Allah (saws) used to recite: \"In the name of Allah, the Cherisher and Sustainer of the worlds; most Gracious, most Merciful; Master of the Day of Judgment,\"breakingits recitation into verses, one after another.Abu Dawud said: I heard Ahmad (b. Hanbal) say: The early reading is: Maliki yawmi'l-din."
        },
        {
          "body": "It was narrated fromUmmSalamah that:The Messenger of Allah [SAW] said: \"You refer your disputes to me, but I am only human, and some of you may be more eloquent in arguing their case than others. If I pass judgment infavorof one of you, against his brother's rights, let him not take it, for it is a piece of fire that I am giving him.\""
        },
        {
          "body": "Ibrahim ibn Abi 'Abla said, \"My wife was ill and I used to go toUmmad-Darda'. She asked me, 'How's your family?' 'Ill,' I replied. She\ncalled for some food for me and I ate. Then I went back and she did the\nsame thing again. I visited her yet again and she asked, 'How are they?'\n'They are almost well,' I replied. She said, 'I called for good for you\nwhen you told me that your family were ill. Since they are almost well\nknow, we will not call for anything for you.'\""
        },
        {
          "body": "Yahya related to me from Malik from Abu'z-Zinad from Sulayman ibn\nYasar that Nufay, a mukatab ofUmmSalama the wife of the Prophet, may\nAllah bless him and grant him peace, or her slave, had a free woman as\na wife. He divorced her twice, and then he wanted to return to her.\nThe wives of the Prophet, may Allah bless him and grant him peace,\nordered him to go to Uthman ibn Affan to ask him about it. He found\nhim atad-Daraj with Zayd ibn Thabit. He asked them, and they both\nanticipated him and said, \"She is haram for you. She is haram for\nyou.\""
        },
        {
          "body": "Narrated AbudDarda' and Ubadah ibn as-Samit:Khalid ibn Dihqan said: When we were engaged in the battle of Constantinople at Dhuluqiyyah, a man of the people of Palestine, who was one of their nobility and elite and whose rank was known to them, came forward. He was called Hani ibn Kulthum ibn Sharik al-Kinani. He greeted Abdullah ibn Zakariyya who knew his rank.Khalid said to us: Abdullah ibn AbuZakariyya told us: I heardUmmad-Darda' say: I heard AbudDarda' say: I heard the Messenger of Allah (saws) say: It is hoped that Allah may forgive every sin, except in the case of one who dies a polytheist, or one who purposely kills a believer.Hani ibn Kulthum ar-Rabi' then said: I heard Mahmud ibn ar-Rabi' transmitting a tradition from Ubadah ibn as-Samit who transmitted from the Messenger of Allah (saws) who said: If a man kills a believer unjustly, Allah will not accept any action or duty of his, obligatory or supererogatory.Khalid then said to us: Ibn AbuZakariyya transmitted a tradition to us fromUmmad-Darda' on the authority of AbudDarda' from the Messenger of Allah (saws) who said: A believer will continue to go on quickly and well so long as he does not shed unlawful blood; when he sheds unlawful blood, he becomes slow and heavy-footed.A similar tradition has been transmitted by Hani ibn Kulthum from Mahmud ibn ar-Rabi' on the authority of Ubadah ibn as-Samit from the Messenger of Allah (saws)."
        },
        {
          "body": "Ummad-Darda’ said she heard Abud Darda’ say he heard Abul Qasim (i.e the Prophet) say that God who is blessed and exalted said, “I am sending after your time, Jesus, a people who will praise God when what they like happens to them, and seek their reward from God and show endurance when what they dislike afflicts them, though they do not possess forbearance and intelligence.” He asked, “My Lord, how can this be when they do not possess forbearance or intelligence?” God replied, “I shall give them some of my forbearance and my knowledge.” \n\nBaihaqi transmitted the two traditions inShu'ab al-lman."
        },
        {
          "body": "This tradition has also been narrated byUmm'Atiyyah in a similar manner through a different chain. Sheadded:The menstruating women should keep themselves away from the place of prayer of the Muslims. She did not mention the garment. She narrated this tradition from Hafsah mentioning a woman who asked about another woman saying: O Messenger of Allah ....She then reported the tradition like that narrated by Musa mentioning the garment."
        },
        {
          "body": "UmmSalama reported God’s Messenger as saying, “I am only a human being and you bring your disputes to me, some perhaps being more eloquent in their plea than others, so that I give judgment on theirbehalfaccording to what I hear from them. Therefore whatever I decide for anyone which by right belongs to his brother he must not take, for I am granting him only a portion of hell.” \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "UmmHabiba (the wife of the Holy Prophet) reported Allah's Messenger (may peace be upon him) as saying:A house will be built in Paradise, for anyone who prays in a day and a night twelve rak'ahs; and sheadded: I have never abandoned (observing them) since I heard it from the Messenger of Allah (may peace be upon him). Some of the other narrators said the same words: I have never abandoned (observing them) since I heard (from so and so)."
        },
        {
          "body": "UmmSalamah (May Allah bepleased with her) reported:Messenger of Allah (PBUH) said, \"Verily, I am only a human and the claimants bring to me (their disputes); perhaps some of them are more eloquent than others. I judge according to what I hear from them). So, he whom I, by my judgment, (givethe undue share) out of the right of a Muslim, I in fact give him a portion of (Hell) Fire\".[Al-Bukhari and Muslim]."
        },
        {
          "body": "Safwan ibn 'Abdullah ibn Safwan, who was married to the daughter\nof Abu'd-Darda', said, \"I visited them in Syria and foundUmmad-Darda'\nin the house, but not Abu'd-Darda'. She asked, 'Are you intending to go\non hajj this year?' 'Yes,' I replied. She said, 'Make supplication to Allah\nand ask for good for us. The Prophet, may Allah bless him and grant him\npeace, said, \"The supplication of a Muslim man for his absent brother is\nanswered. At his head there is a guardian angel. Whenever he asks Allah\nto give his brother good, the angel says, 'Amen, and may you have the same.'\"'\nI met Abu'd-Darda' in the market and he said something similar which was\nrelated from the Prophet, may Allah bless him and grant him peace.\""
        },
        {
          "body": "UmmKulthum bint 'Uqbah (May Allah be pleased with her) reported:Messenger of Allah (PBUH) said, 'The person who (lies) in order to conciliate between people is not a liar, when he conveys good or says (something) good\".[Al-Bukhari and Muslim].The narration in Muslimadded: She said, \"I never heard him (she meant the Prophet (PBUH)) giving permission of lying in anything except in three (things): war, conciliating between people and the conversation of man with his wife and the conversation of a woman with her husband\"."
        },
        {
          "body": "UmmSalamah (May Allah be pleased with her):The Messenger of Allah (PBUH) said, \"When you visit a sick or a dying person, you should utter good words because the angels say `Amin' at what you say.'' Sheadded: When Abu Salamah (May Allah be pleased with him) died, I came to the Prophet (PBUH) and said: \"O Messenger of Allah, Abu Salamah has died.\" He (PBUH) directed me to supplicate thus: \"Allahummaghfir li wa lahu, wa a`qibni minhu `uqba hasanatan [O Allah, forgive me and him, and bestow upon me a better future (give me a better substitute)].\" So I supplicated as he directed, and Allah gave me a man who was better for me than Abu Salamah (i.e., the Prophet Muhammad (PBUH)). (The Prophet (PBUH) marriedUmmSalamah afterwards.)[Muslim]."
        },
        {
          "body": "Abd al-Rahman b. Abu Laila reported:No one has ever narrated to me that he saw the Apostle of Allah (may peace be upon him) observing the forenoon prayer, exceptUmmHani. She, however, narrated that the Apostle of Allah (may peace be upon him) entered her house on the day of the Conquest of Mecca and prayed eight rak'ahs (adding): I never saw a shorter prayer than it except that he performed the bowing and prostration completely. But (one of the narrators) Ibn Bashshar in his narration made no mention of the word:\" Never\"."
        },
        {
          "body": "The tradition mentioned above has also been narrated by Al ‘UmmAthiyah from the Prophet (saws) through a different chain of narrators. The tradition narrated by Yazid bin Harun from Hisham does perfectly correspond to the tradition transmitted by Ibrahim bin Tahman and ‘Abd Allah Al Shami from Hisham. The narrator Al Misma’I reported Yazid as saying “I do not know but that he said “she should not dye herself.” To this the narrator Harunadded“She should not wear colored clothes except one of the types made of dyed yarn.”"
        },
        {
          "body": "UmmSalama, the wife of Allah's Apostle (may peace be upon him), reported that Allah's Messenger (may peace be upon him) heard the clamour of contenders at the door of his apartment. He went to them, and said:I am a human being and the claimants bring to me (the dispute) and perhaps some of them are more eloquent than the others. I judge him to be on the right, and thus decide in his favcur. So he whom I, by my judgment, (givethe undue share) out of the right of a Muslim,. I give him a portion of Fire; he may burden himself with it or abandon it."
        },
        {
          "body": "‘UmmAthiyah reported the Prophet(saws) as saying “A woman must not observe mourning for more than three (days) except for four months and ten days in the case of a husband  and she must not wear a dyed garment except one of the types made of dyed yarn or apply collyrium or touch perfume except for a little costus or azfar when she has been purified after her menstrual courses.The narrator Ya’qub mentioned the words “except washed clothes” instead of the words “one of the types made of dyed yarn”. Ya’qub alsoadded“She must not apply Henna”"
        },
        {
          "body": "UmmSalama reported Allah's Messenger (may peace be upon him) as saying:Whenever you visit the sick or the dead, supplicate for good because angels say\" Amen\" to whatever you say. Sheadded: When Abu Salama died, I went to the Apostle of Allah (may peace be upon him) and said: Messenger of Allah, Abu Salama has died. He told me to recite:\" O Allah! forgive me and him (Abu Salama) and give me a better substitute than he.\" So I said (this), and Allah gave me in exchange Muhammad, who is better for me than him (Abu Salama)."
        },
        {
          "body": "'Aishah said:UmmHabibah, daughter of Jahsh and sister-in-law of Messenger of Allah (saws)m and wife of 'Abd al-Rahman b. 'Awf, had a prolonged flow of blood for seven years. She inquired from the Messenger of Allah (saws) about it. The Messenger of Allah (saws) said: This is not menstruation, but this (due to) a vein. Therefore, wash yourself and pray.Abu Dawud said: In this tradition which is transmitted by al-Zuhri from 'Urwah and 'Urwah on the authority of 'Aishah, al-Awza'iadded: She ('Aishah) said:UmmHabibah daughter of Jahsh and wife of 'Abd al-Rahman b. 'Awf had a prolonged flow of blood for seven years. The Prophet (saws) commander her saying: When the menstruation begins, abandon prayer; when it is finished, take a bath and pray.Abu Dawud said: None of the disciple of al-Zuhri mentioned these words except al-Awza'i, from al-Zuhri it has been narrated by  'Amr b. al-Harith, al-Laith, Yunus, Ibn Abi Dhi'b, Ma'mar, Ibrahim b. Sa'd, Sulaiman b. Kathir, Ibn Ishaq and Sufyan b. 'Uyainah, they did not narrate these words.Abu Dawud said: These are the words of the version reported by Hisham b. 'Urwah from this father on the authority of 'Aishah.Abu Dawud said: In this tradition Ibn 'Uyainah alsoaddedthe words: He commander her to abandon prayer during her menstrual period. This is a misunderstanding on the part of Ibn 'Uyainah. The version of this tradition narrated by Muhammad b. 'Amr from al-Zuhri has the addition similar to that made by al-Awza'i in his version."
        },
        {
          "body": "Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) visitedUmmSa'ib orUmmMusayyib and said:UmmSa'ib orUmmMusayyib. why is it that you are shivering? She said:\" It is fever and may it not be blessed by Allah, whereupon he (the Holy Prophet) said: Don't curse fever for it expiates the sin of the children of Adam just as furnace removes the alloy of iron."
        },
        {
          "body": "Jabir (May Allah be pleased with him) reported:The Messenger of Allah (PBUH) visitedUmmSa'ib (orUmmMusaiyyab) and asked her, \"What ails you OUmmSa'ib (orUmmMusaiyyab)? You are shivering.\" She replied: \"It is a fever, may Allah not bless it!\" He said to her, \"Do not revile fever, for it cleanses out the sins of the sons of Adam in the same way that a furnace removes the dirt of iron.\"[Muslim]."
        },
        {
          "body": "It was narrated byAd-Dahhak bin QaisAd-Dimashqi:A similar report was narrated fromAd-Dahhak bin QaisAd-Dimashqi."
        },
        {
          "body": "Umm'Atiya reported God’? Messenger as saying, “A woman must not observe mourning for one who has died more than three nights, except for the four months and ten days in the case of a husband, and she must not wear a dyed garment except one of the type made of dyed yarn,1 or apply collyrium, or touch perfume except for a little costus or azfar2 when she has been purified after her courses.” \n    1.‘Asb. This word is applied to a type of Yemen garment which was made of cloth which\nwas dyed before being woven.\n    2. A certain odoriferous substance resembling finger-nails, used in incense.\n\n(Bukhari and Muslim.) Abu Dawudadded, “or apply henna.”"
        },
        {
          "body": "Abu Hurairah narrated that the Messenger of Allah (saws) said:“Indeed, Allah has ninety-nine Names, one hundred less one, whoever counts them shall enter Paradise. He is Allah, the one whom there is none worthy of worship except for Him (Allāhu Lā Ilāha Illā Huwa), the Most Merciful (to the creation) (Ar-Raḥmān), the Most Beneficent (to the believers) (Ar-Raḥīm), the King (Al-Malik), the Free of Deficiencies (Al-Quddūs), the Granter of Safety (As-Salām), the Granter of Security (Al-Mu’min), the Watcher (Al-Muhaimin), the Mighty (Al-`Azīz), the Compeller (Al-Jabbār), the Supreme (Al-Mutakabbir), the Creator (Al-Khāliq), the Originator (Al-Bāri’), the Fashioner (Al-Muṣawwir), the Pardoner (Al-Ghaffār), the Overwhelming (Al-Qahhār), the Giving (Al-Wahhāb), the Provider (Ar-Razzāq), the Opener (Al-Fattāḥ), the Knowing (Al-`Alīm), the Taker (Al-Qābiḍ), the Giver (Al-Bāsiṭ), the Abaser (Al-Khāfiḍ), the Exalter (Ar-Rāfi`), the One who grants honor (Al-Mu`izz), the One who humiliates (Al-Mudhil), the Hearing (As-Samī`), the Seeing (Al-Baṣīr), the Judge (Al-Ḥakam), the Just (Al-`Adl), the Kind (Al-Laṭīf), the Aware (Al-Khabīr), the Forbearing (Al-Ḥalīm), the Magnificent (Al-`Aẓīm), the Oft-Forgiving (Al-Ghafūr), the Grateful (Ash-Shakūr), the Most High (Al-`Aliyy), the Great (Al-Kabīr), the Guardian (Al-Ḥafīẓ), the Powerful (Al-Muqīt), the Reckoner (Al-Ḥasīb), the Glorious (Al-Jalīl), the Generous (Al-Karīm), the Watcher (Ar-Raqīb), the Responder (Al-Mujīb), the Liberal Giver (Al-Wāsi`), the Wise (Al-Ḥakīm), the Loving (Al-Wadūd), the Majestic (Al-Majīd), the Reviver (Al-Bā`ith), the Witness (Ash-Shahīd), the Truth (Al-Ḥaqq), the Guarantor (Al-Wakīl), the Strong (Al-Qawiyy), the Firm (Al-Matīn), the One Who Aids (Al-Waliyy), the Praiseworthy (Al-Ḥamīd), the Encompasser (Al-Muḥṣi), the One Who Begins things (Al-Mubdi’), the One Who brings things back (Al-Mu`īd), the One Who gives life (Al-Muḥyi), the One Who causes death (Al-Mumīt), the Living (Al-Ḥayyu), the Self-Sufficient (Al-Qayyūm), the One Who brings into existence (Al-Wājid), the Illustrious (Al-Mājid), the One (Al-Wāḥid), the Master (Aṣ-Ṣamad), the Able (Al-Qādir), the Powerful (Al-Muqtadir), the One who hastens (Al-Muqaddim), the One who delays (Al-Mu’akhkhir), the First (Al-Awwal), the Last (Al-Ākhir), the Apparent (Aẓ-Ẓāhir), the Inner (Al-Bāṭin), the Owner (Al-Wāli), the Exalted (Al-Muta`āli), the Doer of Good (Al-Barr), the Acceptor of repentance (At-Tawwāb), the Avenger (Al-Muntaqim), the Pardoning (Al-`Afuww), the Kind (Ar-Ra’ūf), the Owner of Dominion (Mālikul-Mulk), the Possessor of Glory and Generosity (Dhul Jalāli wal Ikrām), the One who does justice (Al-Muqsiṭ), the Gatherer (Al-Jāmi`), the Rich (Al-Ghaniyy), the Enricher (Al-Mughni), the Preventer (Al-Māni`), the Harmer (Aḍ-Ḍār), the One who benefits (An-Nāfi`), the Light (An-Nūr), the Guide (Al-Hādi), the Originator (Al-Badī`), the Lasting (Al-Bāqi), the Inheritor (Al-Wārith), the Guide (Ar-Rashīd), the Tolerant (Aṣ-Ṣabūr).”"
        },
        {
          "body": "UmmSalamah narrated:UmmSulaim bint Milhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\"UmmSalamah said: \"I said to her: 'OUmmSuIaim! You have disgraced the women!'\""
        },
        {
          "body": "Zainab the daughter ofUmmSalamah narrated fromUmmSalamah that:She and the Messenger of Allah used to take a bath from a single vessel."
        },
        {
          "body": "Narrated Abu Hurairah:that the Messenger of Allah (SAW) said: \"Al-Hamdulillah isUmmAl-Qur'an andUmmAl-Kitab and the seven oft-repeated.\""
        },
        {
          "body": "Ummul Mu'mineenUmmSalama said:\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt [qamis].”"
        },
        {
          "body": "Narrated Abu Juhaifa:The Prophet made a bond of brotherhood between Salman and AbuAd-Darda.' Salman paid a visit to \nAbuAd-Darda' and found UmAd-Darda' dressed in shabby clothes and asked her why she was in that \nstate. She replied, \"Your brother AbuAd-Darda' is not interested in (the luxuries of) this world.\" In \nthe meantime AbuAd-Darda' came and prepared a meal for Salman. Salman requested AbuAd- \nDarda' to eat (with him), but AbuAd-Darda' said, \"I am fasting.\" Salman said, \"I am not going to eat \nunless you eat.\" So, AbuAd-Darda' ate (with Salman). When it was night and (a part of the night \npassed), AbuAd-Darda' got up (to offer the night prayer), but Salman told him to sleep and AbuAd- \nDarda' slept. After sometime AbuAd-Darda' again got up but Salman told him to sleep. When it was \nthe last hours of the night, Salman told him to get up then, and both of them offered the prayer. \nSalman told AbuAd-Darda', \"Your Lord has a right on you, your soul has a right on you, and your \nfamily has a right on you; so you should give the rights of all those who has a right on you.\" AbuAd- \nDarda' came to the Prophet and narrated the whole story. The Prophet said, \"Salman has spoken the \ntruth.\""
        },
        {
          "body": "Malik related to me from Yahya ibn Said from Amra bint Abd ar-\nRahman that Barira came asking the help of A'isha,ummal-muminin.\nA'isha said, \"If your masters agree that I pay them your price in one\nlump sum and set you free I will do it.\" Barira mentioned that to her\nmasters and they said, \"No, not unless your wala' is ours.\" Yahya ibn\nSaidaddedthat Amra bint Abd ar-Rahman claimed that A'isha mentioned\nthat to the Messenger of Allah, may Allah bless him and grant him\npeace, and the Messenger of Allah, may Allah bless him and grant him\npeace said, \"Buy her and set her free. The wala' only belongs to the\none who sets free.\""
        },
        {
          "body": "Sulaiman bin Yasir narrated that :Abu Hurairah, Ibn Abbas and Abu Salamah bin Abdur-Rahman mentioned the pregnant women whose husband died and she gave birth after the death of her husband. So Ibn Abbas said: \"She observes Iddah until the end of the two terms.\" Abu Salamah said: \"Rather, she is allowed when she gives birth.\" Abu Hurairah said: \"I am with my nephew,\" meaning Abu Salamah.So he sent a message toUmmSalamah the wife of the Prophet. She said: \"Subai'ah Al-Aslamiyyah gave birth a short time after her husband died, so she sought the judgment of theMessengerof Allah and he ordered her to get married.\""
        },
        {
          "body": "Umm'Atiyya reported:The Messenger of Allah (may peace be upon him) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are)UmmSulaim, andUmmal-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh."
        },
        {
          "body": "NarratedUmmHani:\"I went to the Messenger of Allah (SAW) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I amUmmHani.' He said: 'WelcomeUmmHani'\""
        },
        {
          "body": "Zainab bintUmmSalama (the wife of the Holy Prophet) reported thatUmmSalama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Some relative ofUmmSalamah said: The bed of the Prophet (saws) was set as a man is laid in his grave; the mosque was towards his head."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The slave-mother of Ibrahim ibn AbdurRahman ibn Awf askedUmmSalamah, the wife of the Prophet (saws): I am a woman having a long border of clothe and I walk in filthy place; (then what should I do?).UmmSalamah replied: The Messenger of Allah ( peace be upon him) said: What comes after it cleanses it."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'ishaummal-muminin sent him away while\nhe was being nursed to her sisterUmmKulthum bint Abi Bakr as-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"Salim said, \"UmmKulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha becauseUmmKulthum did not finish for me the ten times.\""
        },
        {
          "body": "It was narrated fromUmmSalamah that she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:\"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it toUmmSalamah and he gave the dish ofUmmSalamah to 'Aishah."
        },
        {
          "body": "Narrated Abu Juhaifa:The Prophet established a bond of brotherhood between Salman and Abu Darda'. Salman paid a visit \nto Abuad-Darda and found UmAd-Darda' dressed in shabby clothes and asked her why she was in \nthat state.?\" She replied, \"Your brother, AbuAd-Darda is not interested in the luxuries of this world.\" \nIn the meantime AbuAd-Darda came and prepared a meal for him (Salman), and said to him, \n\"(Please) eat for I am fasting.\" Salman said, \"I am not going to eat, unless you eat.\" So AbuAd-Darda' \nate. When it was night, AbuAd-Darda' got up (for the night prayer). Salman said (to him), \"Sleep,\" \nand he slept. Again Abu-Ad-Darda' got up (for the prayer), and Salman said (to him), \"Sleep.\" When \nit was the last part of the night, Salman said to him, \"Get up now (for the prayer).\" So both of them \noffered their prayers and Salman said to AbuAd-Darda',\"Your Lord has a right on you; and your soul \nhas a right on you; and your family has a right on you; so you should give the rights of all those who \nhave a right on you). Later on AbuAd-Darda' visited the Prophet and mentioned that to him. The \nProphet, said, \"Salman has spoken the truth.\""
        },
        {
          "body": "NarratedUmmSalama:NarratedUmmSalama (rad):\nAllah’s Messenger (saw) said, “He who drinks in a silver utensil is only swallowing Hell-fire in his stomach”. [Agreed Upon]"
        },
        {
          "body": "UmmSalamah narrated that the Prophet (s.a.w) mentioned the army that the earth would swallow, soUmmSalamah said:'Perhaps there are those among them who are averse to it.\" He said: \"They will be resurrected on their intentions.\""
        },
        {
          "body": "Narrated Ibn `Abbas:The Prophet said, \"I was granted victory with As-Saba and the nation of 'Adwas destroyed byAd- \nDabur (westerly wind) ."
        },
        {
          "body": "It was narrated from 'Irak bin Malik that Zainab bint Abi Salamah told him, thatUmmHabibah said to the Messenger of Allah:\"We have been saying that you want to marry Durrah bint Abi Salamah.\" The Messenger of Allah said: \"As a co-wife toUmmSalamah? Even if I were not married toUmmSalamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "Narrated Anas (RA):The Prophet (SAW) appointed IbnUmmMaktum (RA) to lead the people in prayer in his absence and he [IbnUmmMaktum (RA)] was blind.\n\n[Reported by Ahmad and Abu Dawud]."
        },
        {
          "body": "Umm'Atiyya reported:We washed her an odd number of times, i. e. three, five or seven times; andUmm'Atiyya (further) said: We braided her hair in three plaits."
        },
        {
          "body": "NarratedUmmSharik:that the Messenger of Allah (SAW) said: \"The people will flee from the Dajjal such that they will go to the mountains.\"UmmSharik said: \"O Messenger of Allah! Where will the Arabs be that day?\" He said: \"They will be few.\""
        },
        {
          "body": "Abu Murra, the freed slave ofUmmHani, daughter of Abu Talib, reportedUmmHani to be saying:I went to the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca and found him taking a bath, and Fatimah, his daughter, had provided him privacy with the help of a cloth. I gave him salutation and he said: Who is she? I said: It isUmmHani, daughter of Abu Talib. He (the Holy Prophet) said: Greeting forUmmHani. When he had completed the bath, he stood up and observed eight rak'ahs wrapped up in one cloth. When he turned back (after the prayer), I said to him: Messenger of Allah, the son of my mother 'Ali b. Abu Talib is going to kill a person, Fulan b. Hubaira whom I have given protection. Upon this the Messenger of Allah (may peace be upon him) said: We too have given protection whom you have given protection, OUmmHani.UmmHani said: It was the forenoon (prayer)."
        },
        {
          "body": "Narrated Abu Sa`id:One day Allah's Apostle narrated to us a long narration aboutAd-Dajjal and among the things he \nnarrated to us, was: \"Ad-Dajjal will come, and he will be forbidden to enter the mountain passes of \nMedina. He will encamp in one of the salt areas neighboring Medina and there will appear to him a \nman who will be the best or one of the best of the people. He will say 'I testify that you areAd-Dajjal \nwhose story Allah's Apostle has told us.'Ad-Dajjal will say (to his audience), 'Look, if I kill this man \nand then give him life, will you have any doubt about my claim?' They will reply, 'No,' ThenAd- \nDajjal will kill that man and then will make him alive. The man will say, 'By Allah, now I recognize \nyou more than ever!'Ad-Dajjal will then try to kill him (again) but he will not be given the power to \ndo so.\""
        },
        {
          "body": "Narrated Sa'd ibn Ubadah:Sa'd asked: Messenger of Allah,UmmSa'd has died; what form of sadaqah is best? He replied: Water (is best). He dug a well and said: It is forUmmSa'd."
        },
        {
          "body": "It was\nnarrated thatUmmSalamah said:“The Prophet (saw) was\nperforming\nprayer in the house ofUmmSalamah, and ‘Abdullah or ‘Umar\nbin\nAbu Salamah passed in front of him; he gestured his hand, and he\nwent\nback. Then Zainab bintUmmSalamah passed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "Narrated Abdullah ibn Abbas:About the story of Haml ibn Malik, Ibn Abbas said: She aborted a child who had grown hair and was dead, and the woman also died. He (the Prophet) gave judgment that theblood-wit was to be paid by the woman's relatives on the father's side. Her uncle said: Messenger of Allah! She has aborted a child who had grown hair. The father of the woman who had slain said: He is a liar: I swear by Allah, he did not raise his voice, or drink or eat. No compensation is to be paid for an offence like this. The Prophet (saws) said: is it a rhymed prose of pre-Islamic Arabia and its soothsaying? Pay a male or female slave of the best quality in compensation for the child.Ibn 'Abbas said: The name of one of them was Mulaikah, and the name of the other wasUmmGhutaif."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that A'isha,ummal-muminin said, \"My paternal uncle by\nsuckling came to me and I refused to give him permission to enter\nuntil I had asked the Messenger of Allah, may Allah bless him and\ngrant him peace, about it. The Messenger of Allah, may Allah bless him\nand grant him peace, came and I asked him about it. He said, 'He is\nyour paternal uncle, so give him permission.' So I said, 'Messenger of\nAllah! The woman nursed me not the man.' He said, 'He is your paternal\nuncle, so let him enter.' \"A'isha said, \"That was after the\nveil had been imposed on us.\"A'ishaadded, \"What is haram by\nbirth is made haram by suckling.\""
        },
        {
          "body": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi\nTalha that Anas ibn Malik had said that when the Messenger of Allah,\nmay Allah bless him and grant him peace, went to Quba, he visitedUmmHaram bint Milhan and she fed him.UmmHaram was the wife of Ubada ibn\nas-Samit. One day the Messenger of Allah, may Allah bless him and\ngrant him peace, had called on her and she had fed him, and sat down\nto delouse his hair. The Messenger of Allah, may Allah bless him and\ngrant him peace, had dozed and woke up smiling.UmmHaram said, \"What\nis making you smile, Messenger of Allah?\" He said, \"Some of my\ncommunity were presented to me, raiding in the way of Allah. They were\nriding in the middle of the sea, kings on thrones, or like kings on\nthrones.\" (Ishaq wasn't sure). She said, \"O Messenger of Allah! Ask\nAllah to put me among them!\" So he had made a dua for her, and put his\nhead down and slept. Then he had woken up smiling, and she said to\nhim, \"Messenger of Allah, why are you smiling?\" He said, \"Some of my\ncommunity were presented to me, raiding in the way of Allah. They were\nkings on thrones or like kings on thrones,\" as he had said in the\nfirst one. She said, \"O Messenger of Allah! Ask Allah to put me among\nthem!\" He said, \"You are among the first.\"Ishaqadded, \"She\ntravelled on the sea in the time of Muawiya, and when she landed, she\nwas thrown from her mount and killed.\""
        },
        {
          "body": "Narrated Ibrahim:'Alqama went to Sham and when he entered the mosque, he said, \"O Allah ! Bless me with a pious \ncompanion.\" So he sat with AbuAd-Darda. AbuAd-Darda' asked him, \"Where are you from?\" \n'Alqama replied, \"From the people of Kufa.\" AbuAd-Darda said, \"Isn't there amongst you the Keeper \nof the secret which nobody else knows i.e. Hudhaifa?\" Al-qama said, \"Yes.\" Then AbuAd-Darda \nfurther said, \"Isn't there amongst you the person whom Allah gave Refuge from Satan through the \ninvocation of His Prophet namely `Ammar?\" Alqama replied in the affirmative AbuAd-Darda said, \n\"Isn't there amongst you the person who carries the Siwak (or the Secret) (i.e. of the Prophet namely \n`Abdullah bin Massud)?\" Alqama said, \"Yes.\" Then AbuAd-Darda asked, \"How (Abdullah bin \nMasud) used to recite the Sura starting with: \"By the night as it envelopes; By the day as it appears in \nbrightness?\" (92.1-2). Alqama said \"And by male and female.\" AbuAd-Darda then said, \"These \npeople (of Sham) tried hard to make me accept something other than what I had heard from the \nProphet.\""
        },
        {
          "body": "NarratedUmmHani:\"The Messenger of Allah (saws) arrived in Makkah, and he had four braids.\"[Abu 'Eisa said:] This Hadith is Gharib. Muhammad said: \"I do not know of Mujahid (a narrator) hearing fromUmmHani.\""
        },
        {
          "body": "Narrated Ibn `Abbas:The Prophet said, \"I have been made victorious by As-Saba (i.e. an easterly wind) and theAdnation \nwas destroyed byAd-Dabur (i.e. a westerly wind)."
        },
        {
          "body": "Narrated Anas bin Malik:Allah's Apostle said, \"Ad-Dajjal will come to Medina and find the angels guarding it. If Allah will, \nneitherAd-Dajjal nor plague will be able to come near it.\""
        },
        {
          "body": "Narrated Ibn `Abbas:The Prophet said, \"I have been made victorious with As-Saba (i.e. an easterly wind) and the people of 'Adwere destroyed byAd-Dabur (i.e. a westerly wind).\""
        },
        {
          "body": "NarratedUmmal-Ala:The Messenger of Allah (saws) visited me while I was sick. He said: Be glad,Ummal-Ala' for Allah removes the sins of a Muslim for his illness as fire removes the dross of gold and silver."
        },
        {
          "body": "Ibn Shawwal (the freed slave ofUmmHabiba) reported that he went toUmmHabiba (the wife of Allah's Apostle) who informed him that Allah's Apostle (may peace be upon him) sent her from Muzdalifa during the night."
        },
        {
          "body": "'Umm'Atiyyah has narrated this tradition through a different chain of transmitters.Abu DAwud said:The name ofUmmal-Hudhail is Hafsah daughter os Sirin. The name of her son was Hudhail and his husband 'Abd al-Rahman."
        },
        {
          "body": "Anas b. Malik reported:UmmSulaim who was the grandmother of Ishaq came to the Messenger of Allah (may peace be upon him) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: OUmmSulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressingUmmSulaim) said: Well, OUmmSulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream)."
        },
        {
          "body": "Narrated Anas bin Malik:The Prophet said, \"Ad-Dajjal will come to Medina and find the angels guarding it. So Allah willing, \nneitherAd-Dajjal, nor plague will be able to come near it.\""
        },
        {
          "body": "And in the version of Ahmad andAd-Daraqutni it isadded:“Bring me more (something other than dung)”]."
        },
        {
          "body": "Narrated `Abdullah:Ad-Dajjal was mentioned in the presence of the Prophet. The Prophet said, \"Allah is not hidden from \nyou; He is not one-eyed,\" and pointed with his hand towards his eye,adding, \"While Al-MasihAd- \nDajjal is blind in the right eye and his eye looks like a protruding grape.\""
        },
        {
          "body": "Narrated Salim:I heard UmAd-Darda' saying, \"AbuAd-Darda' entered the house in an angry mood. I said to him. \n'What makes you angry?' He replied, 'By Allah! I do not find the followers of Muhammad doing those \ngood things (which they used to do before) except the offering of congregational prayer.\" (This \nhappened in the last days of AbuAd-Darda' during the rule of `Uthman) ."
        },
        {
          "body": "Abu Hurayra reported that the Prophet, may Allah bless him and\ngrant him peace, said, \"None of you should say, 'May time (ad-Dahr)\nbe disappointed. Allah is time (ad-Dahr).\""
        },
        {
          "body": "'A'isha reported:They (some Companions of the Holy Prophet) were conversing with one another in the presence of the Messenger of Allah (may peace be upon him) (during his last) illness.UmmSalama andUmmHabiba made a mention of the church and then (the hadith was) narrated."
        },
        {
          "body": "UmmHani (May Allah be pleased with her) reported:I went to the Prophet (PBUH) who was taking a bath while Fatimah was screening him. He asked, \"Who is there?\" I replied: \"I amUmmHani.\"[Al- Bukhari and Muslim]."
        },
        {
          "body": "Narrated Abu Hurairah:That the Messenger of Allah (saws) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar,UmmHabibah, andUmmSalamah. This Hadith is Hasan Sahih."
        },
        {
          "body": "Narrated Abu Sa`id Al-Khudri:Allah's Apostle told us a long narrative aboutAd-Dajjal, and among the many things he mentioned, \nwas his saying, \"Ad-Dajjal will come and it will be forbidden for him to pass through the entrances of \nMedina. He will land in some of the salty barren areas (outside) Medina; on that day the best man or \none of the best men will come up to him and say, 'I testify that you are the same Dajjal whose \ndescription was given to us by Allah's Apostle .'Ad-Dajjal will say to the people, 'If I kill this man \nand bring him back to life again, will you doubt my claim?' They will say, 'No.' ThenAd-Dajjal will \nkill that man and bring him back to life. That man will say, 'Now I know your reality better than \nbefore.'Ad-Dajjal will say, 'I want to kill him but I cannot.' \""
        },
        {
          "body": "Sa‘d b. ‘Ubada told God’s messenger thatUmmSa'd had died and asked him what form ofsadaqawas best. When he replied that water was best, he dug a well and said it was forUmmSa'd. \n\nAbu Dawud and Nasa’i transmitted it."
        },
        {
          "body": "Umm'Atiyya reported that the Messenger of Allah (may peace be upon him) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) wasUmmSulaim."
        },
        {
          "body": "Abdur-Rahman bin Awf'sUmmWalad said, :\"I said toUmmSalamah: 'Indeed I am a woman with lengthy hems, and I walk in places of filth.' So she said: 'Allah's Messenger said: \"It is purified by what comes after it.\""
        },
        {
          "body": "Anas b. Malik said; the prophet (may peace be upon him) used to visitUmmSulaim. Sometimes the time for prayer would come and he would pray on out carpet that was really a mat. She (UmmSulaim) used to wash it with water."
        }
      ]
    }
  ]
}