{
  "data": [
    {
      "hadith": [
        {
          "body": "Narrated Abu Hurairah:that the Messenger of Allah (SAW) said: \"Al-Hamdulillah isUmmAl-Qur'an andUmmAl-Kitab and the seven oft-repeated.\""
        },
        {
          "body": "NarratedUmmal-Ala:The Messenger of Allah (saws) visited me while I was sick. He said: Be glad,Ummal-Ala' for Allah removes the sins of a Muslim for his illness as fire removes the dross of gold and silver."
        },
        {
          "body": "'Umm'Atiyyah has narrated this tradition through a different chain of transmitters.Abu DAwud said:The name ofUmmal-Hudhail is Hafsah daughter os Sirin. The name of her son was Hudhail and his husband 'Abdal-Rahman."
        },
        {
          "body": "Umm'Atiyya reported:The Messenger of Allah (may peace be upon him) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are)UmmSulaim, andUmmal-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh."
        },
        {
          "body": "Ummal-Fadl stated that God’s Prophet said, “Being suckled once or twice does not make marriage unlawful.” In ‘A’isha’s version he said, “One or two sucks do not make marriage unlawful.” In another byUmmal-Fadl he said, “One suckling or two does not make marriage unlawful.” \n\nThese are versions by Muslim."
        },
        {
          "body": "UmmHani (May Allah be pleased with her) reported:I went to the Prophet (PBUH) who was taking a bath while Fatimah was screening him. He asked, \"Who is there?\" I replied: \"I amUmmHani.\"[Al- Bukhari and Muslim]."
        },
        {
          "body": "Ummal-Fadl (Allah be pleased with her) is reported to have said that some people among the Companions of the Messenger of Allah (may peace be upon him) were in doubt about fasting on the day of 'Arafa and we were with him on that day. I (Ummal-Fadl) sent him a cup of milk and he was halting at 'Arafa, and he drank that."
        },
        {
          "body": "It was narrated from Abdullah bin Abi Qatadah that his father said:\"The Messenger of Allah (SAW) used to recite theUmmAl-Quran and two surahs in the first two rak'ahs of Zuhr and 'Asr, and in the last two withUmmAl-Quran, and he would make us hear a verse sometimes, and he used to make the first rak'ah lengthy.\""
        },
        {
          "body": "UmmSulaimAlRumaisa said “The Prophet(saws) slept and awoke while she was washing her head.” He awoke laughing. She asked “Apostle of Allaah(saws) are you laughing at my head?” He replied, No. She then narrated the rest of the tradition enlarging and reducing.Abu Dawud said:Al-Rumaisa was the foster sister ofUmmSulaim."
        },
        {
          "body": "Ummal-Fadl daughter ofal-Harith said that she heard God’s Messenger recitingal-Mursalat* at the sunset prayer. \n\n*Al-Qur'an; 77.\n\n(Bukhari and Muslim.)"
        },
        {
          "body": "NarratedUmmUmarah:Habibal-Ansari reported: I heard Abbad ibn Tamim who reported on the authority of my grandmother,UmmUmarah, saying: The Prophet (saws) wanted to perform ablution. A vessel containing 2/3 mudd of water was brought to him."
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (saws) slackened Fatimah's garment a hand-span.\"[Abu 'Eisa said:] Some of them reported it from Hammad bin Salamah, from 'Ali bin Zaid, fromAl-Hasan, from his father, fromUmmSalamah."
        },
        {
          "body": "Abu Qatada said that in the first tworak'asof the noon prayer the Prophet used to reciteUmmal-Kitaband twosuras, and in the last tworak'asUmmal-Kitab, and he would sometimes recite loud enough for them to hear the verse. He would prolong the firstrak'amore than the second; and he acted similarly in the afternoon and the Morning Prayer. \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (SAW) put a garment overAl-Hasan,Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" SoUmmSalamah said: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'"
        },
        {
          "body": "UmmSharikAl-Ansari said:“The Messenger of Allah (SAW) commanded us\nto recite the Opening of the Book (Al-Fatihah) in the funeral\nprayer.”"
        },
        {
          "body": "UmmSalamah narrated:\"The Prophet would pray two Rak'ah afterAl-Witr.\""
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'ishaummal-muminin sent him away while\nhe was being nursed to her sisterUmmKulthum bint Abi Bakr as-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"Salim said, \"UmmKulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha becauseUmmKulthum did not finish for me the ten times.\""
        },
        {
          "body": "NarratedUmmFarwah:The Messenger of Allah (saws) was asked: Which of the actions is best? He replied: Observing prayer early in its period.Al-Khuza'i narrated in his version from his aunt namedUmmFarwah who took the oath of allegiance to the Prophet (saws): He was questioned."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar\nused to recite in all four rakas as when he prayed alone - in every\nraka theummal-Qur'an and another sura from the Qur'an. Sometimes he\nwould recite two or three suras in one raka in the obligatory prayer.\nSimilarly, he recited theummal-Qur'an and two suras in the first two\nrakas of maghrib."
        },
        {
          "body": "Jabir told of God’s messenger visitingUmmas-Sa’ib (Ibn 'Abdal-Barr (Isti'ab, p. 781) gives her name in this form, but says she is called by someUmmal-Musayyib) and asking, “What is the matter with you that you are trembling?” She replied, “Fever; may God not bless it.” He said, “Do not revile fever, for it removes the sins of the sons of Adam just as the bellows remove the dross of iron.”\nMuslim transmitted it."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Hunaydahal-Khuza'i reported on the authority of her mother who said: I entered uponUmmSalamah and asked her about fasting. She said: The Messenger of Allah (saws) used to command me to fast three days every month beginning with Monday or Thursday."
        },
        {
          "body": "The Five Imams (Ahmad and the four Imams) transmitted a simialr hadith on the authority ofUmmKurzal-Ka-biyah."
        },
        {
          "body": "Kathir ibn 'Ubayd said, \"I visited 'A'isha, theUmmal-Mu'minin,\nmay Allah be pleased with her. She said, 'Wait until I sew up my garment.'\nSo I waited and said, 'Ummal-Mu'minin, when I go out, I will tell them\nthat your enemy is miserliness.' She said, 'Look to your own business.\nThere are no new clothes for anyone who does not wear shabby clothes.'\""
        },
        {
          "body": "It was narrated from Saeed binAl-Musayyab thatUmmSharik said:\"The Messenger of Allah told me to kill geckos.\""
        },
        {
          "body": "'Abdal-Malik b. Abu Bakr b. Abdal-Rahman b.al-Harith b. Hisham reported on the authority of his father fromUmmSalama (Allah be pleased with her) that when Allah's Messenger (may peace be upon him) marriedUmmSalama, he stayed with her for three nights, and said:There is no lack of estimation on the part of your husband for you. If you wish I can stay with you for a week, but in case I stay with you for a week, then I shall have to stay for a week with all my wives."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Shahr ibn Hawshab said: I askedUmmSalamah: How did the Messenger of Allah  (saws) read this verse: \"For his conduct is unrighteous (innahu 'amalun  ghayru salih\". She replied: He read it: \"He acted unrighteously\" (innahu 'amila ghayra salih).Abu Dawud said: This tradition has been transmitted by Harunal-Nahwi and Musa b. Khalaf from Thabit as reported by the narrator 'Abdal-Aziz."
        },
        {
          "body": "Yahya related to me from Malik from AIqama ibn Abi AIqama that\nhis mother, the mawla of A'isha,ummal-muminin, said, \"Women used to\nsend little boxes to A'isha,ummal-muminin, with a piece of cotton\ncloth in each one on which was yellowness from menstrual blood, asking\nher about the prayer. She said to them, 'Do not be hasty until you see\na white discharge.\" By that she meant purity from menses."
        },
        {
          "body": "It was narrated thatUmmSubyahAl-Juhaniyyah said:\"Often my hand would touch the hand of the Messenger of Allah while performing ablution from a single vessel.\" (Hasan)\n\nAbu `Abdullah bin Majah said: \"I heard Muhammad say: 'UmmSubyah was Khawlah bint Qais. I mentioned that to Abu Zur`ah and he said: \"It is true.\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Al-Hasan reported on the authority of his mother that she wasUmmSalamah pouring water on the urine of the male child until the age when he did not eat food. When he began to eat food, she would wash (his urine). And she would wash the urine of the female child."
        },
        {
          "body": "NarratedUmmKhalid, daughter of Sa'd b.al-'As:Once the Messenger of Allah (saws) was brought some garments among which was a small cloak with a border and black stripes. He said: Whom do you think to be more deserving for it ? The people kept silence. He said: BringUmmKhalid. The she was carried to him and he put it on her, saying: Wear it out and make it ragged twice. Then he went on looking at red or yellow marks on it, and said: This is sanah, sanah,UmmKhalid. It means \"beautiful\" in the language of the Abyssinians."
        },
        {
          "body": "Al-Bukhari and Muslim transmitted in the hadith ofUmmHani’, “We have given protection to whom you have granted (protection).”"
        },
        {
          "body": "Al-Harith ibn 'Abdullahal-Ansari said, \"I sawUmmad-Darda' going to visit (a sick) Ansari man from the mosque and she was on her mount in an uncovered howdah.\""
        },
        {
          "body": "This hadith has been narrated by Abu Nadr on the authority of Umair, the freed slave ofUmmal-Fadl, through the same chain of transmitters."
        },
        {
          "body": "It was\nnarrated thatUmmKurzAl-Ka’biyyah said:“I heard the\nMessenger\nof Allah (saw) say: ‘Prophecy is gone, but good dreams\nremain.’”"
        },
        {
          "body": "It was narrated thatUmmHabibah said:\"We used to leave JamAl-Muzdalifah for Mina at the end of the night, during the time of the Messenger of Allah.\""
        },
        {
          "body": "Ibn Juraij quoted Ibn Abū Mulaika who reportedUmmSalama as saying, ‘God’s messenger used to make pauses in his recitation. He would say, ‘Praise be to God, the Lord of the universe’, then stop. He would next say, ‘The Compassionate, the Merciful’, then stop.” \n\nTirmidhī transmitted it, but he said that itsisnādis not fully connected, becauseal-Laith transmitted this tradition from Ibn Abū Mulaika from Yā'lā b. Mamlak fromUmmSalama, andal-Laith's tradition is sounder."
        },
        {
          "body": "Kuraib said that Ibn ‘Abbas,al-Miswar b. Makhrama and ‘Abd ar-Rahman b.al-Azhar sent him to ‘A’isha telling him to give her their greetings and ask her about the tworak'asafter the afternoon prayer. He said that when he went to visit her and conveyed their message she told him to askUmmSalama, so he came out to them and they sent him back toUmmSalama who said :I heard the Prophet prohibiting them and afterwards saw him praying them. When he came in I sent the slavegirl to him telling her to say thatUmmSalama sent this query, “Messenger of God, I heard you prohibiting these two, and I see you praying them.” He replied, “Daughter of Abu Umayya,* you have asked about the tworak'asafter the afternoon prayer. Some people of ‘Abd Qais came and hindered me from praying the tworak'aswhich come after the noon prayer, so those are the two I have been praying.”\n\n* Abu Umayya wasUmmSalama’s father. Although the slavegirl conveyed the query, the reply is given as if addressed directly toUmmSalama.\n\n(Bukhari and Muslim)"
        },
        {
          "body": "It was narrated from Salim bin Shawwal that:UmmHabibah told him that the Prophet told her to leave Jam (Al-Muzdalifah) for Mina at the end of the night."
        },
        {
          "body": "Nafi’b. Mahmudb.Al-Rabi’Al-Ansari said:“Ubadah b.al-samit came to late to lead the morning prayer.  Abu Nu’aim, the mu’adhdhin, pronounced the takbir and he led the people in prayer. Then Ubadah came and I was with him. We Joined the row behind Abu Nu’aim, while Abu Nu’aim was reciting the Qur’an loudly. Then ‘Ubadah began to recite theUmmal-Quran (I.e SurahalFatihah). When he finished, I said to Ubadah: I heard you reciting theUmmal-Qur’an while Abu Nu’aim was reciting Qur’an loudly. He replied: yes> The Messenger of Allah (may peace be upon him) led us in a certain prayer in which the Qur’an is recited loudly, but he became confused in the recitation. When he finished he turned his face to us and said: Do you recite when I recite the Qur’an loudly? Some of us said: we do so; this is why I said to myself: What is that which confused me (in the recitation of ) the Qur’an. Do not recite anything from the Qur’an when I recite it loudly except theUmmal-Qur’an."
        },
        {
          "body": "Abu Huraira used to say:If one is in time for therak'ahe is credited with thesajda, but if one misses the recitation ofUmmal- Qur'an(Al-Qur’an; 1) a great amount of good has passed him by. \n\nMalik transmitted it."
        },
        {
          "body": "NarratedUmmHabibah:AbuSufyan ibn Sa'id ibnal-Mughirah reported that he entered uponUmmHabibah who presented him a glass of sawiq (a drink prepared with flour and water) to drink.  He called for water and rinsed his mouth. She said: O my cousin, don't you perform ablution? The Prophet (saws) said: Perform ablution after eating anything cooked with fire, or he said: anything touched by fire.Abu Dawud said: The version ofal-Zuhri has: O my paternal cousin."
        },
        {
          "body": "NarratedUmmal-Mundhar bint Qaysal-Ansariyyah:The Messenger of Allah (saws) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (saws) got up and began to eat from them.Ali also got up to eat, but the Messenger of Allah (saws) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.She said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (saws) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said:al-Adawiyyah (i.e.Ummal-Mundhar)."
        },
        {
          "body": "It was narrated from Anas thatUmmAl-Fadl bintAl-Harith said:\" The Messenger of Allah (SAW) led us in praying maghrib in his house and he recitedAl-Mursalat, then after that, he never offered any prayer until he died.\""
        },
        {
          "body": "Abu Burda said, \"I came to Abu Musa while he was in the house ofUmmal-Fadl ibnal-'Abbas and I sneezed and Abu Musa did not wish mercy\non me.Ummal-Fadl sneezed and he wished mercy on her. I told my mother,\nso when Abu Musa came to her, she confronted him and said, 'My son sneezed\nand you did not wish mercy on him. She (Ummal-Fadl) sneezed and you wished\nmercy on her.' Abu Musa replied, 'I heard the Prophet, may Allah bless\nhim and grant him peace, say, \"When one of you sneezes and praises Allah,\nyou should wish mercy on him, if he does not praise Allah, do not wish\nmercy on him.\" My son sneezed and did not praise Allah, so I did not wish\nmercy on him. She sneezed and praised Allah, so I wished mercy on her.'\nShe said, 'You did well.'\""
        },
        {
          "body": "'Abdur-Rahman bin HurmuzAl-A'raj said:\"Na'im the freed slave ofUmmSalamah narrated to me thatUmmSalamah was asked: 'Can a woman perform Ghusl with a man?' She said: 'Yes, if she is well-mannered.[1] I remember the Messenger of Allah (PBUH) and I performing Ghusl from a single wash tub. We would pour water on our hands until they were clean then pour water over them.'\"Al-A'raj said: \"Not mentioning the private area not paying attention to it.\"\n[1] Kaiysah:\" Well-mannered when using the water with the man\" (An-Nihayah) And the comments byAl-A'raj after the narration refer to its meaning."
        },
        {
          "body": "It was narrated thatUmmHaim bint Wadda'Al-Khuza'iyyah said:\"I heard the Messenger of Allah (saas) say: 'The supplication of a father reaches the Veil (i.e. the place of repentance).'\""
        },
        {
          "body": "(Another chain) fromUmmAmarah bint Ka'bAl-Ansari:From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\""
        },
        {
          "body": "NarratedAl-MusawirAl-Himyari:from his mother who said: \"I entered uponUmmSalamah, and I heard her saying: \"The Messenger of Allah (SAW) used to say: \"No hypocrite loves 'Ali, and no believer hates him.\""
        },
        {
          "body": "Ubada b. as-Samit reported:The Messenger of Allah (may peace be upon him) said: He who does not reciteUmmal-Qur'an is not credited with having observed the prayer."
        },
        {
          "body": "Narrated Anas (RA):Allah's Messenger (SAW) prayed and an orphan and I prayed behind him andUmmSulaim (RA) was behind us.\n\n[Agreed upon and the wording isal-Bukhari's]."
        },
        {
          "body": "‘A’ishah reported on the authority ofUmmSulaimal-Ansariyah, who was the mother of Anas b. Malik, said:Messenger of Allah. Allah is not ashamed of truth what do you think, if a woman sees what a man sees in dream, should she take a bath or not? The prophet (may peace be upon him) replied: Yes, she should take a bath if she finds the liquid (vaginal secretion) ‘A’ishah said : Then I came upon her and said her : Woe to you! Does a woman see that (sexual dream)? In the meantime, the Messenger of Allah (may peace be upon him) came upon me and said: May your right hand be covered with dust! How can there be the resemblance (i.e., between the child and the mother)?Abu Dawud said: A similar version has been narrated by Zubaid, ‘Uqail, Yunus, cousin ofAl-Zuhri, Ibn Abi-Wazir, on the authority ofal-Zuhr, musan,al-Hajabi, likeal-Zuhri, narrated on the authority of ‘Urwah from ‘A’ishah, but  Hisham b. ‘Urwah narrated from ‘Urwah on the authority of Zainab daughter of Abu Salamah fromUmmSalamah saying.UmmSulaim came to the Messenger of Allah (may peace be upon him)."
        },
        {
          "body": "NarratedUmmSalamah:\"The most loved garment to the Messenger of Allah (saws) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is fromAl-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, fromUmmSalamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, fromUmmSalamah is more correct, Abu Tumailah mentioned 'his mother' in it.\""
        },
        {
          "body": "NarratedUmmSalamah, wife of the Prophet (saws):The reading of the following verse by the Prophet (saws) goes: \"Nay, but there came to thee (ja'atki) my signs, and thou didst reject them (fakadhdhabti biha) ; thou wast haughty (wastakbarti) and became one of those who reject Faith (wa kunti).Abu Dawud said: This is a mursal tradition, i.e. the link of the Companion has been omitted, for the narratoral-Rabi' did not meetUmmSalamah."
        },
        {
          "body": "UmmAtiyyah (May Allah be pleased with her) reported:We (womenfolk) were prohibited from accompanying a funeral procession, but we were not compelled (not to do so).[Al-Bukhari and Muslim]."
        },
        {
          "body": "UmmHakim, daughter of Usayd, reported on the authority of her mother that her husband died and she was suffering from sore eyes. She therefore applied collyrium (jala'). Ahmad said:The correct version is \"glittering collyrium (kuhlal-jala'). She sent her slave-girl toUmmSalamah, and she asked her about the use of glittering collyrium (kuhlal-jala').She said: Do not apply it except in the case of dire need which is troubling you. In that case you can use it at night, but you should remove it in the daytime. ThenUmmSalamah said: The Messenger of Allah (saws) came to visit me when AbuSalamah died, and I had put the juice of aloes in my eye.He asked : What is this,UmmSalamah?  I replied: It is only the juice of aloes and contains no perfume.  He said: It gives the face a glow, so apply it only at night and remove it in daytime, and do not comb yourself with scent or henna, for it is a dye.  I asked: What should I use when I comb myself, Messenger of Allah?  He said: Use lote-tree leaves and smear your head copiously with them."
        },
        {
          "body": "Sharh as-sunnatells of the Prophet assigning to ‘Abdallah b. Mas'ud the open spaces in Medina between the dwellings and palm gardens of the Ansar, and when the B. 'Abd b. Zuhra said, “Remove from us the son ofUmm‘Abd,” (His mother wasUmm'Abd daughter ofal-Harith b. Zuhra b. Kitab) replying, “Why then did God send me? God does not bless a people among whom a weak man is not given his right.”Sharh as-sunna"
        },
        {
          "body": "Narrated 'Ubaidullah bin Abi Burdah:From his father thatUmmAyyub informed him that the Prophet (saws) had stayed with them, and they prepared some food for him containing some of these vegetables. But he disliked eating it, so he said to his Companions: \"Eat it, for I am not like you are, I fear that I will offend my companion.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih Gharib.UmmAyyub is the wife of Abu AyyubAl-Ansari."
        },
        {
          "body": "Narrated Mujahid:fromUmmSalamah that she said: \"The men fight and the women do not fight, and we only get half the inheritance.' So Allah, Blessed and Most High, revealed: 'And wish not for things in which Allah has made some of you excell over others... (4:32)' Mujahid said: \"And the following was revealed about that: 'Verily the Muslim men and the Muslim women... (33:35). AndUmmSalamah was the first camel-borne woman to arrive inAl-Madinah as an emigrant."
        },
        {
          "body": "NarratedUmmHani ibn AbuTalib:The Messenger of Allah (saws) prayed on the day of the Conquest (of Mecca) eight rak'ahs saluting after every two rak'ahs.Abu Dawud said: Ahmad b. Salih said that the Messenger of Allah offered prayer in the forenoon on the day of the Conquest of Mecca, and he narrated something similar. Ibnal-Sarh reported thatUmmHani said: The Messenger of Allah (saws) entered upon me. This version does not mention the prayer in the forenoon."
        },
        {
          "body": "'Abdal-Malik b. Abi Bakr reported from his father on the authority ofUmmSalamah:When the Messenger of Allah (saws) marriedUmmSalamah, he stayed with her three night, and said: Your people (i.e. clan) are not being humbled for you in my estimation. If you wish I shall stay with you seven nights; and if I stay with you seven nights, I shall stay with my other wives seven nights."
        },
        {
          "body": "And in the narration ofal-Khamsah, by her [UmmHabibah (RA)]:\"Whoever prays regularly four Rak'at before and four Rak'at after the Zuhr prayer, Allah will forbid for him (from entering) the Hellfire.\""
        },
        {
          "body": "Yahya related to me from Malik from Ibn Shihab that A'isha,ummal-muminin and Sad ibn Abi Waqqas did not see any harm in a man\ndrinking while standing."
        },
        {
          "body": "Umm'Atiyyah (May Allah be pleased with her) said:At the time of giving the pledge of allegiance, the Messenger of Allah (PBUH) took from us an oath that we would not wail.[Al-Bukhari and Muslim]."
        },
        {
          "body": "UmmSharik (May Allah be pleased with her) said:The Messenger of Allah (PBUH) ordered me to kill chameleon. He also said, \"It blew (fire) on Prophet Ibrahim.[Al-Bukhari and Muslim]."
        },
        {
          "body": "It was narrated fromAl-Aswad, thatUmmSalamah said:\"The Messenger of Allah (SAW) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers.\""
        },
        {
          "body": "Yahya related to me from Malik, from Abd ar-Rahman ibnal-Qasim,\nfrom his father, from A'isha,ummal-muminin, that the Messenger of\nAllah, may Allah bless him and grant him peace, did hajj on its own."
        },
        {
          "body": "Zaid b. Aslam reported that 'Abdal-Malik b. Marwan sent some domestic goods for decoration toUmmDarda' on his own behalf, and when it was night 'Abdal-Malik got up and called for the servant. It seemed as if he (the servant) was late (in responding to his call), so he ('Abdal-Malik) invoked curse upon him, and when it was morningUmmDarda' said to him:I heard you cursing your servant during the night when you called him, and she said: I heard Abu Darda' as saying that Allah's Messenger (may peace be upon him) said: The invoker of curse would neither be intercessor nor witness on the Day of Resurrection."
        },
        {
          "body": "Ummal-Husain reported God’s Messenger as saying, “If a slave who has been mutilated is made your commander and leads you in accordance with God’s Book, listen to him and obey.” \n\nMuslim transmitted it."
        },
        {
          "body": "It was\nnarrated thatUmm‘AtiyyahAl-Ansariyyah said:“I fought\nalongside the Messenger of Allah (saw) in seven campaigns, looking\nafter their goods, making food for them, tending the wounded and\nlooking after the sick.”"
        },
        {
          "body": "UmmAl-Fadl narrated:\"Allah's Messenger came out to us with his head bandaged from his illness. He prayed Maghrib, reciting (Surat)Al-Mursalat.\" [She said:] \"He did not pray it again until he met Allah the Might and Sublime.\""
        },
        {
          "body": "It was narrated fromUmmFadl that the Prophet of Allah was asked about breast-feeding and said:\"Suckling (Al-Imlajah) once or twice does not make (marriage) prohibited.\" And (one of the narrators) Qatadah said (in his narration): \"Suckling (Al-Massah) once or twice does not make (marriage) prohibited.\""
        },
        {
          "body": "NarratedUmm`Atiyah (RAA):After we were pure, we did not consider the yellow or muddy discharge to be anything (i.e. of the menses blood)\n[Reported byAl-Bukhari and Abu Dawud and the wording is of Abu Dawud]."
        },
        {
          "body": "UmmSalamah (RAA) narrated that the Messenger of Allah (PBUH) said, \"Allah did not make your cure in what He made Haram (unlawful) to you.\" Related byAl-Baihaqi and graded as Sahih by Ibn Hibban."
        },
        {
          "body": "UmmSalama told that the Prophet was saying during his illness, “Maintain the prayer and care for your slaves.” \n\nBaihaqi transmitted it inShu'abal-iman, and Ahmad and Abu Dawud transmitted something similar on the authority of ‘Ali."
        },
        {
          "body": "It was narrated that Aishah said:\"I would see the Messenger of Allah (SAW) praying two rak'ahs of Fajr and making them so brief that I said: 'Did he recite theUmmAl-Kitab in them?'\""
        },
        {
          "body": "Mansur reported fromAl-Hakam, from Miqsam, from Ibn 'Abbas thatUmmSalamah said:\"The Messenger of Allah (SAW) used to pray witr with seven or five (rak'ahs), not separating between them with the taslim.\""
        },
        {
          "body": "Amr b. Muslimal-Jundani reported that Ibn Musayyib had told him that it wasUmmSalama, the wife of Allah's Apostle (may peace be upon him), who had informed him of that as narrated above."
        },
        {
          "body": "‘Ubada b. as-Samit reported God’s Messenger as saying, “He who does not reciteFatihatal-Kitab* is not credited with having observed prayer.” \n\n*The firstsura.\n\n(Bukhari and Muslim.) A version by Muslim has “He who does not reciteUmmal-Qur’an(the firstsuraand something more.”"
        },
        {
          "body": "Mansur reported fromAl-Hakam, from Miqsam, thatUmmSalamah said:\"The Messenger of Allah (SAW) used to pray witr with five and seven rak'ahs which he did not separate with any taslim nor talk.\""
        },
        {
          "body": "It was narrated that Abu Umamah said:\"The Sunnah, when offering the funeral prayer, is to reciteUmmAl-Qur'an) the Exxence of the Qur'an) quietly in the first Takbir, Then to say three (more)  Takbir and to say the Taslim after the last one.\""
        },
        {
          "body": "This has bee\tn narrated though a different chain of narrators by 'Aishah. This version has the words:\"She used to take a bath for every prayer.\"Abu Dawud said:Al-Qasim b. Mabrur reported from Yunus from Ibn Shihab from 'Amrah from 'Aishah fromUmmHabibah daughter of Jahsh. Similarly, it was reported by Ma'mar fromal-Zuhri from 'Amrah from 'Aishah. Ma'mar sometimes reported from 'Amrah on the authority ofUmmHabibah to the same effect. Similarly, it was reported by Ibrahim b. Sa'd and Ibn 'Uyainah fromal-Zuhri from 'Amrah from 'Aishah. Ibn 'Uyainah said in his version: He (al-Zuhri) did not say that the Prophet (saws) commanded her to take bath.It has also been transmitted byal-Awza'i in a similar way. In this version he said: 'Aishah said: She used to take bath for very prayer."
        },
        {
          "body": "Narrated Anas bin Malik:Allah's Apostle used to visitUmmHaram bint Milhan, who would offer him meals.UmmHaram was the \nwife of Ubada bin As-Samit. Allah's Apostle, once visited her and she provided him with food and \nstarted looking for lice in his head. Then Allah's Apostle slept, and afterwards woke up smiling.UmmHaram asked, \"What causes you to smile, O Allah's Apostle?\" He said. \"Some of my followers who (in \na dream) were presented before me as fighters in Allah's cause (on board a ship) amidst this sea caused \nme to smile; they were as kings on the thrones (or like kings on the thrones).\" (Ishaq, a sub-narrator is \nnot sure as to which expression the Prophet used.)UmmHaram said, \"O Allah's Apostle! Invoke Allah \nthat he makes me one of them. Allah's Apostle invoked Allah for her and slept again and woke up \nsmiling. Once againUmmHaram asked, \"What makes you smile, O Allah's Apostle?\" He replied, \n\"Some of my followers were presented to me as fighters in Allah's Cause,\" repeating the same dream.UmmHaram said, \"O Allah's Apostle! Invoke Allah that He makes me one of them.\" He said, \"You are \namongst the first ones.\" It happened that she sailed on the sea during the Caliphate ofMu'awiyabin \nAbi Sufyan, and after she disembarked, she fell down from her riding animal and died."
        },
        {
          "body": "Al-Azdiyyah, viz. Mussah, said:I performed Hajj and came toUmmSalamah and said (to her): Mother of the believers, Samurah b. Jundub commands women to complete the prayers abandoned during their menstrual period. She said: They should not do so. The wives of the Prophet (saws) would refrain (from prayer) for forty nights (i.e. days) during the course of bleeding after child birth. The Prophet (saws) would not command them to complete the prayers abandoned during the period of bleeding.Muhammad b. Hatim said: The name ofAl-Azdiyyah is Mussah and her patronymic name isUmmBusrah.Abu Dawud said: The patronymic names of Kathir b. Ziyad s Abu Sahl."
        },
        {
          "body": "It was narrated from Sa'eed binal-Musayyab that 'Umar binal-Khattab said:A boy was born to the brother ofUmmSalamah, the wife of the Prophet ﷺ and they called himal-Waleed. The Prophet ﷺ said: “You have called him by the name of your pharaoh, for there will be among this ummah a man who is calledal-Waleed and he will be worse to them than Pharaoh was to his people.”"
        },
        {
          "body": "Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) visitedUmmSa'ib orUmmMusayyib and said:UmmSa'ib orUmmMusayyib. why is it that you are shivering? She said:\" It is fever and may it not be blessed by Allah, whereupon he (the Holy Prophet) said: Don't curse fever for it expiates the sin of the children of Adam just as furnace removes the alloy of iron."
        },
        {
          "body": "UmmSa'id bint Murraal-Fihri related from her father that the Prophet,\nmay Allah bless him and grant him peace, said, \"I and the guardian of an\norphan will be in the Garden like these two.\" (His two fingers)"
        },
        {
          "body": "Yahya related to me from Malik that he had heard that Abu Hurayra\nused to say, \"Whoever catches the ruku has caught the sajda and\nwhoever misses the recitation of theummal-Qur'an has missed much\ngood.\""
        },
        {
          "body": "Abu Salama reported that Fatima bint Qais, the sister ofal-Dahhak b. Qais informed him that Abu Hafs b. Mughiraal-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her:There is no maintenance allowance due to you from us. Khalid b. Walid along with a group of persons visited Allah's Messenger (may peace be upon him) in the house of Maimuna and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger (may peace be upon him) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house ofUmmSharik, and then sent her the message that as the first immigrants (frequently) visit the house ofUmmSharik, she should better go to the house of IbnUmmMaktum, the blind, (and further said: In case you put off your head-dress, he (IbnUmmMakhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger (may peace be upon him) married her to Usama b. Zaid b. Haritha."
        },
        {
          "body": "It was narrated that Ubayy bin Ka'b said:\"The Messenger of Allah (SAW) said: 'Allah, the Mighty and Sublime, did not reveal in the Tawrah or the Injil anything likeUmmAl-Quran (Al-Fatihah), which is the seven oft-recited, and (Allah said) it is divided between Myself and My slave will have what he asked for.'\""
        },
        {
          "body": "It was narrated from Abu 'Uthman, who was notAl-Hindi, that:UmmAl-Fadl sent word to Anas bin Malik, asking him about Nabidh made in an earthenware jar. He told her about his son An-Nadr, who used to make Nabidh in an earthenware jar in the morning and drink it in the evening."
        },
        {
          "body": "NarratedUmmHabibah:The Prophet (saws) said: If anyone keeps on praying regularly four rak'ahs before and four after the noon prayer, he will not enter the Hell-fire.Abu Dawud said:Al-'Ala' binAl-Harith and Sulaiman bin Musa reported it from Makhul with his chain, similarly."
        },
        {
          "body": "Ibn 'Umar (May Allah be pleased with them) reported:The Messenger of Allah (PBUH) had two Mu'adhdhin: Bilal and IbnUmmMaktum (May Allah be pleased with them). The Messenger of Allah (PBUH) said, \"Bilal proclaims Adhan[call to Salat (prayer)]at fag end of night, so eat and drink till IbnUmmMaktum pronounces Adhan.\" Ibn 'Umar (May Allah be pleased with them) added: And the gap between their Adhan was not more than the time spent in one's getting down and the other's climbing (the minaret).[Al-Bukhari and Muslim]."
        },
        {
          "body": "Safinah (RAA) narrated, ‘I was a slave ofUmmSalamah and she said, ‘I shall emancipate you, but on the condition that you serve Allah’s Messenger (P.B.U.H.) as long as you live.’ Related by Ahmad, Abu Dawud, An-Nasa’i andAl-Hakim."
        },
        {
          "body": "It was narrated that from MusawirAlHimyari from his mother that:she heardUmmSalamah say: “I heard the Messenger of Allah say: 'Any woman who dies when her husband is pleased with her, will enter Paradise.' ”"
        },
        {
          "body": "This hadith has been reported on the authority of Abu Bishr with the same the same chain of transmitters (with these words):That he recitedUmm-ul-Qur'an (SuraFatiha), and he collected his spittle and he applied that and the person became all right."
        },
        {
          "body": "Jabir (May Allah be pleased with him) reported:The Messenger of Allah (PBUH) visitedUmmSa'ib (orUmmMusaiyyab) and asked her, \"What ails you OUmmSa'ib (orUmmMusaiyyab)? You are shivering.\" She replied: \"It is a fever, may Allah not bless it!\" He said to her, \"Do not revile fever, for it cleanses out the sins of the sons of Adam in the same way that a furnace removes the dirt of iron.\"[Muslim]."
        },
        {
          "body": "Mahmud b.al-Rabi', on whose face the Messenger of Allah (may peace be upon him) squirted water from the well, reported on the authority of 'Ubada b. as- Samit that the Messenger of Allah (may peace be upon him) said:He who does not reciteUmmal-Qur'an is not credited with having observed prayer."
        },
        {
          "body": "NarratedUmmAl-HusainAl-Ahmasiyyah:I heard the Messenger of Allah (saws) delivering Khutbah during the farewell Hajj, and he was wearing a Burd which he had wrapped from under his armpit.\" She said: \"I was look at muscle of his upper arm quivering and I heard him saying: O you people! Have Taqwa of Allah. If a mutilated Ethiopian slave is put in command over you, then listen to him and obey him, as long as he upholds the Book of Allah among you.'\"[Abu 'Eisa said:] There are narrations on this topic from Abu Hurairah and 'Irbad bin Sariyah. This Hadith is Hasan Sahih, it has been reported through other routes fromUmmHusain."
        },
        {
          "body": "26 Yahya related to me from Malik from Abu Ubayd, the mawla of\nSulayman ibn Abd alMalik, from Ubada ibn Nusayy from Qays ibnalHarith that Abu Abdullah as-Sunabihi said, \"I arrived in Madina in the\nkhalifate of Abu Bakr as-Siddiq, and I prayed maghrib behind him. He\nrecited theummalQur'an and two suras from the shorter ones of the\nmufassal in the first two rakas. Then he stood up in the third and I\ndrew so near to him that my clothes were almost touching his clothes.\nI heard him reciting theummal-Qur'an and this ayat, 'Our Lord, do\nnot make our hearts go astray after You have guided us, and give us\nmercy from Your presence. Surely You are the Giver. ' \" (Sura 3 ayat\n8)"
        },
        {
          "body": "UmmSalama said that the Prophet used to say after the dawn prayer, “O God, I ask Thee for beneficial knowledge, acceptable action, and good provision.” \n\nAhmad, Ibn Majah and Baihaqi, in [Kitab]ad- Da'awatal-kabir, transmitted it."
        }
      ]
    }
  ]
}