{
  "data": [
    {
      "hadith": [
        {
          "body": "Zainab the daughter ofUmmSalamahnarrated fromUmmSalamahthat:She and the Messenger of Allah used to take a bath from a single vessel."
        },
        {
          "body": "It was narrated from 'Irak bin Malik that Zainab bint AbiSalamahtold him, thatUmmHabibah said to the Messenger of Allah:\"We have been saying that you want to marry Durrah bint AbiSalamah.\" The Messenger of Allah said: \"As a co-wife toUmmSalamah? Even if I were not married toUmmSalamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:“The Prophet (saw) was\nperforming\nprayer in the house ofUmmSalamah, and ‘Abdullah or ‘Umar\nbin\nAbuSalamahpassed in front of him; he gestured his hand, and he\nwent\nback. Then Zainab bintUmmSalamahpassed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Some relative ofUmmSalamahsaid: The bed of the Prophet (saws) was set as a man is laid in his grave; the mosque was towards his head."
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (saws) slackened Fatimah's garment a hand-span.\"[Abu 'Eisa said:] Some of them reported it from Hammad binSalamah, from 'Ali bin Zaid, from Al-Hasan, from his father, fromUmmSalamah."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The slave-mother of Ibrahim ibn AbdurRahman ibn Awf askedUmmSalamah, the wife of the Prophet (saws): I am a woman having a long border of clothe and I walk in filthy place; (then what should I do?).UmmSalamahreplied: The Messenger of Allah ( peace be upon him) said: What comes after it cleanses it."
        },
        {
          "body": "It was narrated fromUmmSalamahthat she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:\"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it toUmmSalamahand he gave the dish ofUmmSalamahto 'Aishah."
        },
        {
          "body": "UmmSalamahnarrated that the Prophet (s.a.w) mentioned the army that the earth would swallow, soUmmSalamahsaid:'Perhaps there are those among them who are averse to it.\" He said: \"They will be resurrected on their intentions.\""
        },
        {
          "body": "It was narrated thatUmmSalamahsaid:“The Prophet (saw) mentioned\nthe army that would be swallowed up by the earth, andUmmSalamahsaid: ‘O Messenger of Allah, perhaps there will be some among them\nwho were forced (to join them)?’ He said: ‘They will be\nresurrected according to their intentions.’”"
        },
        {
          "body": "It was narrated fromUmmSalamahthat:She mentioned women's hems to the Messenger of Allah [SAW], and the Messenger of Allah [SAW] said: \"Let it down a hand span.\"UmmSalamahsaid: \"But that will uncover (her feet).\" He said: \"Let it down a forearm's length, but no more than that.\""
        },
        {
          "body": "Umar bin AbiSalamahnarrated that he saw :Allah's Messenger performing Salat in the house ofUmmSalamahwrapped in one garment."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Kabshah, daughter of AbuMaryam, askedUmmSalamah(Allah be pleased with her): What did the Prophet (saws) prohibit? She replied: He forbade us to boil dates so much so that the kernels are spoiled, and to mix raisins and dried dates."
        },
        {
          "body": "Narrated Umar bin AbiSalamah:It was narrated from Umar bin AbiSalamahthat he saw Messenger of Allah(saws)praying in a single garment in the house ofUmmSalamah, putting the ends of it on his shoulders.\""
        },
        {
          "body": "UmmSalamahnarrated:UmmSulaim bint Milhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\"UmmSalamahsaid: \"I said to her: 'OUmmSuIaim! You have disgraced the women!'\""
        },
        {
          "body": "NarratedUmmSalamah(RA):She asked the Prophet (SAW), \"Can a woman pray in a long dress and a veil without wearing a lower garment?\" He replied, \"If the long dress is ample and covers the surface of her feet.\"\n\n[Reported by Abu Dawud and the Imams graded it Mawquf (a saying ofUmmSalamah)]."
        },
        {
          "body": "It was narrated fromUmmSalamahthat:When the Prophet [SAW] said what he said about the Izar,UmmSalamahsaid: \"What about women?\" He said: \"Let it down a hand span.\" She said: \"But then their feet will show.\" He said: \"Then (let it down) a forearm's length, but no more than that.\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Hunaydah al-Khuza'i reported on the authority of her mother who said: I entered uponUmmSalamahand asked her about fasting. She said: The Messenger of Allah (saws) used to command me to fast three days every month beginning with Monday or Thursday."
        },
        {
          "body": "UmmSalamahsaid that she asked the prophet (may peace be upon him); Can a woman pray in a shirt and veil without wearing a lower garment? He replied:if the shirt is ample and covers the surface of her feet.Abu Dawud said: This tradition has been transmitted by Malik b. Anas, Bakr b. Mudar, Hafs b. Ghiyaht, Isma'il b. Ja'far, Ibn Abu Dhi'b, and Ibn Ishaq from Muhammad b. Zaid on the authority of his mother who narrated fromUmmSalamah. None of these narrators mention the name of the Prophet (saws). They reported it directly fromUmmSalamah."
        },
        {
          "body": "It was narrated from AbuSalamahthatUmmSalamahsaid:\"U never saw the Messenger  of Allah fast two consecutive months, but he used to join shaban to Ramadan.\" '"
        },
        {
          "body": "Safiyyah, daughter of AbuUbayd, said:When the Messenger of Allah (saws) mentioned lower garment,UmmSalamah, wife of the Messenger of Allah (saws), asked him: And a woman, Messenger of Allah? He replied: She may hang down a span.UmmSalamahsaid: Still it (foot) will be uncovered. He said: Then a forearm's length, nor exceeding it."
        },
        {
          "body": "It was narrated from HIsham bin Urwah, from his father, fromUmmSalamah, that she said:\"O Messenger of Allah, by Allah! I have not performed the Farewell Tawaf.\" The Prophet said: \"When the Iqamah is said for prayer, perform Tawaf on your camel behind the people.\" Urwah did not hear fromUmmSalamah."
        },
        {
          "body": "'A’isha andUmmSalamah(RAA) narrated, The Messenger of Allah (P.B.U.H.) would rise in the morning (when it is already Fajr time) while he was Junub (in a state of major ritual impurity due to intercourse) on a day in Ramadan. He would then perform Ghusl and fast. Agreed upon. In the narration of Muslim on the authority ofUmmSalamah, ‘And he would not make up for it (that day).’"
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Al-Hasan reported on the authority of his mother that she wasUmmSalamahpouring water on the urine of the male child until the age when he did not eat food. When he began to eat food, she would wash (his urine). And she would wash the urine of the female child."
        },
        {
          "body": "Narrated 'Aishah:\"The people used to give their gifts [to the Prophet (SAW)] on 'Aishah's day.\" She said: \"So my companions gathered withUmmSalamahand they said 'OUmmSalamah! The people give their gifts on 'Aishah's day, and we desire good as 'Aishah desires, so tell the Messenger of Allah (SAW) to order the people to give (their gifts to) him no matter where he is.' SoUmmSalamahsaid that, and he turned away from her. Then he turned back to her and she repeated the words saying: 'O Messenger of Allah! My companions have mentioned that the people give their gifts on 'Aishah's day, so order the people to give them no matter where you are.' So upon the third time she said that, he said: 'OUmmSalamah! Do not bother me about 'Aishah! For Revelation has not been sent down upon me while I was under the blankets of a woman among you other than her.'\""
        },
        {
          "body": "NarratedUmmSalamah:\"The most loved garment to the Messenger of Allah (saws) was the Qamis (long shirt).\"[Abu 'Eisa said:] This Hadith is Hasan Gharib. We only know of it as a narration of 'Abdul-Mu'min bin Khalid (a narrator in the chain of this Hadith) who was alone in narrating it, and he is from Al-Marwaz. Some of them report this Hadith from Abu Tumailah, from 'Abdul-Mu'min bin Khalid, from 'Abdullah bin Buraidah, from his mother, fromUmmSalamah. He said: I heard Muhammad bin Ism'ail saying: \"The narration of Ibn Buraidah from his mother, fromUmmSalamahis more correct, Abu Tumailah mentioned 'his mother' in it.\""
        },
        {
          "body": "Ibn Majah added, on the authority ofUmmSalamah(RAA), “with regards to it being a sin.”"
        },
        {
          "body": "It was narrated thatUmmSalamahsaid:\"The Messenger of Allah used to join Shaban to Ramadan.\" '"
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Ya'la ibn Mumallak said that he askedUmmSalamahabout the recitation and prayer of the Messenger of Allah (saws).She said: What have you to do with his prayer? He would pray, then sleep as long as he had prayed, till morning. She then described his recitation and did so with an exposition word by word."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Safinah said: I was a slave ofUmmSalamah, and she said: I shall emancipate you, but I stipulate that you must serve the Messenger of Allah (saws) as long as you live. I said: Even if you do not make a stipulation, I shall not leave the Messenger of Allah (saws). She then emancipated me and made the stipulation with me."
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (SAW) put a garment over Al-Hasan, Al-Hussain, 'Ali and Fatimah, then he said: 'O Allah, these are the people of my house and the close ones, so remove the Rijs from them and purify them thoroughly.\" SoUmmSalamahsaid: 'And am I with them, O Messenger of Allah?' He said: \"You are upon good.\"'"
        },
        {
          "body": "UmmSalamahsaid:one of the Muslims asked, and Zubair reported:UmmSalamah(herself) asked: Messenger of Allah. I am a women who keeps her hair closely plaited; should I undo it when I wash after sexual defilement? He replied (no), it is enough for you to throw three handfuls over it. Then pour water over all your body and will be purified."
        },
        {
          "body": "It was narrated from Zainab, the daughter ofUmmSalamah, that :Her motherUmmSalamahsaid: \"UmmSulaim came to the Prophet and asked him about a woman who sees in her dream something like a man sees. He said: 'Yes, if she sees water (discharge), let her take a bath.' I said: 'You have embarrassed the women. Do women experience wet dreams?' The Prophet said: 'May your hands be rubbed with dust, how else does her child resemble her?'\""
        },
        {
          "body": "It was narrated from Zainab bintUmmSalamah, thatUmmSalamahandUmmHabibah said:\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\""
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:“The Messenger of Allah (saw)\nused\nto join Sha’ban to Ramadan.”"
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:“The Messenger of Allah (saw)\nwas\nforbidden to recite Qunut in Fajr.”"
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (SAW) would recite: 'Innahu 'Amila Ghaira Salih.'\""
        },
        {
          "body": "It was narrated fromUmmSalamahthat the Prophet (PBUH) said:\"The columns of this Minbar of mine will be in Paradise.\""
        },
        {
          "body": "UmmSalamahnarrated:\"The Prophet would pray two Rak'ah after Al-Witr.\""
        },
        {
          "body": "Narrated 'Amr bin Dinar:from a man among the children ofUmmSalamah, fromUmmSalamahthat she said: \"O Messenger of Allah! I have not heard Allah mentioning anything about women and emigration.\" So Allah, Blessed and Most High, revealed: \"Never will I allow to be lost the work of any of you, be he male or female. You are members one of another (3:195).\""
        },
        {
          "body": "It was narrated from Zainab bint AbiSalamahthatUmmHabibah, the wife of the Prophet said:\"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\"UmmHabibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry Durrah bint AbiSalamah.\" He said: \"The daughter ofUmmSalamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed AbuSalamahand I. So do not offer your daughters or sisters to me in marriage.\""
        },
        {
          "body": "'Urwah narrated that Zainab bint AbiSalamah-whose mother wasUmmSalamah, the wife of the Prophet- told him thatUmmHabibah bint Abi Sufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry Durrah bint AbiSalamah.' He said: 'The daughter ofUmmSalamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed AbuSalamahand I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:No clothing was dearer to be Messenger of Allah (saws) than shirt."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Her bedding was in front of the place of prayer of the Prophet (saws)."
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:There was no garment more\nbeloved to\nthe Messenger of Allah (saw) than the shirt.”"
        },
        {
          "body": "NarratedUmmSalamah:\"The most loved garment to the Messenger of Allah (saws) was the Qamis (long shirt).\""
        },
        {
          "body": "NarratedUmmSalamah:\"The Messenger of Allah (SAW) said: 'The one whose council is sought is entrusted.'\""
        },
        {
          "body": "NarratedUmmSalamah:\"The most loved garment to the Messenger of Allah (saws) was the Qamis (long shirt).\""
        },
        {
          "body": "It was narrated from Humaid bin Nafi' that:he heard Zainab the daughter ofUmmSalamahnarrating that she heardUmmSalamahandUmmHabibah mention that a woman came to the Prophet (SAW) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (SAW) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The clothing which the Messenger of Allah (saws) liked best was shirt."
        },
        {
          "body": "It was\nnarrated fromUmmSalamahthat the Messenger of Allah (saw)\nsaid:“Hajj is the Jihad of every weak person.”"
        },
        {
          "body": "NarratedUmmSalamah:\"The Messenger of Allah (SAW) recited this Ayah: 'Innahu 'Amalun Ghairu Salih'\" (11:46)"
        },
        {
          "body": "UmmSalamahnarrated:\"I did not see the Prophet fasting two consecutive months except for Sha'ban and Ramadan.\""
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:“The Messenger of Allah (SAW)\nentered upon AbuSalamah(after he had died), and his eyes were wide\nopen. He closed his eyes, then he said: ‘When the soul is taken,\nthe\nsight follows it.’”"
        },
        {
          "body": "It was narrated fromUmmSalamahthat a woman suffered constant bleeding at the time of the Messenger of Allah (PBUH), soUmmSalamahconsulted the Prophet (PBUH) for her. He said:\"Let her count the number of nights and says that she used to menstruate each month before this happened to her, and let her stop praying for that amount of time each month. Then when that is over let her perform Ghusl, then let her use a pad, and pray.\""
        },
        {
          "body": "NarratedUmmSalamah, wife of the Prophet (saws):The reading of the following verse by the Prophet (saws) goes: \"Nay, but there came to thee (ja'atki) my signs, and thou didst reject them (fakadhdhabti biha) ; thou wast haughty (wastakbarti) and became one of those who reject Faith (wa kunti).Abu Dawud said: This is a mursal tradition, i.e. the link of the Companion has been omitted, for the narrator al-Rabi' did not meetUmmSalamah."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The Messenger of Allah (saws) forbade every intoxicant and everything which produces languidness."
        },
        {
          "body": "It was\nnarrated fromUmmSalamahthat the Prophet (saw) used to pray\ntwo\nshort Rak’ah after Witr, sitting down."
        },
        {
          "body": "It was narrated thatUmmSalamahsaid:\"The Messenger of Allah used to enjoin fasting three days: The first Thursday, and Monday and Monday.\""
        },
        {
          "body": "It was narrated fromUmmSalamah:That the Messenger of Allah would not fast any two consecutive months except Shaban and Ramadan."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Shahr ibn Hawshab said: I askedUmmSalamah: How did the Messenger of Allah  (saws) read this verse: \"For his conduct is unrighteous (innahu 'amalun  ghayru salih\". She replied: He read it: \"He acted unrighteously\" (innahu 'amila ghayra salih).Abu Dawud said: This tradition has been transmitted by Harun al-Nahwi and Musa b. Khalaf from Thabit as reported by the narrator 'Abd al-Aziz."
        },
        {
          "body": "Narrated Mujahid:fromUmmSalamahthat she said: \"The men fight and the women do not fight, and we only get half the inheritance.' So Allah, Blessed and Most High, revealed: 'And wish not for things in which Allah has made some of you excell over others... (4:32)' Mujahid said: \"And the following was revealed about that: 'Verily the Muslim men and the Muslim women... (33:35). AndUmmSalamahwas the first camel-borne woman to arrive in Al-Madinah as an emigrant."
        },
        {
          "body": "It was narrated fromUmmSalamahthat a woman said:\"O Messenger of Allah, Allah is not shy to tell the truth. Does a women have to perform Ghusl if she has a wet dream?\" He said: \"Yes, if she sees water.\"[1]UmmSalamahlaughed and said: \"Do women really have wet dreams?\" The Messenger of Allah (PBUH) said: \"How else would her child resemble her?\"\n[1] That is, if she has an emission of the fluid of an orgasm."
        },
        {
          "body": "It was narrated fromUmmSalamahthat a woman suffered from constant bleeding during the time of the Messenger of Allah (PBUH), soUmmSalamahconsulted the Prophet (PBUH) for her. He said:\"Let her count the number of nights and days that she used to menstruate each month before this happened to her, and let her stop praying for that period of time each month. Then when that is over let her perform Ghusl, then wrap a cloth around herself, and pray.\""
        },
        {
          "body": "'Abd al-Malik b. Abi Bakr reported from his father on the authority ofUmmSalamah:When the Messenger of Allah (saws) marriedUmmSalamah, he stayed with her three night, and said: Your people (i.e. clan) are not being humbled for you in my estimation. If you wish I shall stay with you seven nights; and if I stay with you seven nights, I shall stay with my other wives seven nights."
        },
        {
          "body": "Narrated Nabhan the freed slave ofUmmSalamah:to Ibn Shihab, thatUmmSalamahnarrated to him, that she and Maimunah were with the Messenger of Allah (SAW), she said: \"So when we were with him, IbnUmmMaktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (SAW) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (SAW) said: 'Are you two blind such that you can not see him?'\""
        },
        {
          "body": "UmmSalamah(May Allah be pleased with her):The Messenger of Allah (PBUH) said, \"When you visit a sick or a dying person, you should utter good words because the angels say `Amin' at what you say.'' She added: When AbuSalamah(May Allah be pleased with him) died, I came to the Prophet (PBUH) and said: \"O Messenger of Allah, AbuSalamahhas died.\" He (PBUH) directed me to supplicate thus: \"Allahummaghfir li wa lahu, wa a`qibni minhu `uqba hasanatan [O Allah, forgive me and him, and bestow upon me a better future (give me a better substitute)].\" So I supplicated as he directed, and Allah gave me a man who was better for me than AbuSalamah(i.e., the Prophet Muhammad (PBUH)). (The Prophet (PBUH) marriedUmmSalamahafterwards.)[Muslim]."
        },
        {
          "body": "Narrated Abu Hurairah:That the Messenger of Allah (saws) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar,UmmHabibah, andUmmSalamah. This Hadith is Hasan Sahih."
        },
        {
          "body": "It was narrated fromUmmSalamahthat:\"the Prophet(SAW) would coat (with hair removing chemical) and remove the pubic hairs with his hand.\""
        },
        {
          "body": "It was\nnarrated fromUmmSalamahthat the Messenger of Allah (saw)\nsaid:“Whoever begins the Talbiyah for ‘Umrah from Baitul-Maqdis, will\nbe forgiven.”"
        },
        {
          "body": "Abdur-Rahman bin Awf'sUmmWalad said, :\"I said toUmmSalamah: 'Indeed I am a woman with lengthy hems, and I walk in places of filth.' So she said: 'Allah's Messenger said: \"It is purified by what comes after it.\""
        },
        {
          "body": "UmmSalamah(RAA) narrated that The Messenger of Allah (P.B.U.H.) said, “The transgressing party will kill 'Ammar ('Ammar bin Yasir).” Related by Muslim."
        },
        {
          "body": "It was narrated thatUmmSalamah, the wife of the Prophet, said:\"The Messenger of Allah said: 'If you drink milk, then rinse your mouths, for there is some greasiness in it.'\""
        },
        {
          "body": "It was\nnarrated from Abu Hurairah that the Prophet (saw) said to\nFatimah, or\ntoUmmSalamah:“Let your hem down one forearm’s length.”"
        },
        {
          "body": "It was narrated fromUmmSalamah:That the Prophet would not fast any month of the year in full except Shaban and he used to join it to Ramadan."
        },
        {
          "body": "A similar report was narrated from Safiyyah bint Abi 'Ubaid from one of the wives of the Prophet -and she isUmmSalamah- from the Prophet."
        },
        {
          "body": "UmmSalamahnarrated that The Messenger of Allah said:“Whichever woman dies while her husband is pleased with her, then she enters Paradise.”"
        },
        {
          "body": "Umar bin AbuSalamahnarrated from his mother,UmmSalamah, that the Messenger of Allah (saws) said:“When a calamity strikes one of you, then let him say: ‘Indeed, to Allah we belong and to Him we shall return. O Allah, I seek reward with You for my affliction, so reward me for it, and replace it for me with something better (Innā lillāhi wa innā ilaihi rāji`ūn, Allāhumma `indaka aḥtasibu muṣībatī fa’jurnī fīhā wa abdilnī minhā khair).’” When the time of death was near AbuSalamah, he said: ‘O Allah, replace me for my wife, with better than me.” So when he died,UmmSalamahsaid: “Indeed, to Allah we belong and to Him we shall return. I seek reward with  Allah for my affliction, so reward me for it.”"
        },
        {
          "body": "It was narrated from AbuSalamah, thatUmmSalamahsaid:\"The Messenger of Allah (SAW) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few.\""
        },
        {
          "body": "It was\nnarrated from Zainab bintUmmSalamahthat her mother said\nthat her\nbed was in front of the place where the Messenger of Allah\n(saw)\nprostrated."
        },
        {
          "body": "It was\nnarrated fromUmmSalamahfrom the Prophet (SAW) regarding:“And\nthat they will not disobey you in Ma’ruf (all that is good in\nIslam);” he said: “(It is about) wailing.”"
        },
        {
          "body": "It was\nnarrated fromUmmSalamahthat the Prophet (SAW) said:“Breaking\nthe bones of the deceased is, in sin, like breaking his\nbones when he\nis alive.”"
        },
        {
          "body": "UmmSalamahnarrated:\"The Prophet would perform Witr with thirteen [Rak'ah]. When he was older and became weak he performed Witr with seven.\""
        },
        {
          "body": "UmmSalamahnarrated that The Messenger of Allah said:“No prohibition results from suckling except for what penetrates the intestines while on the breast before weaning.”"
        },
        {
          "body": "UmmSalamahreportedUmmHabibah said “Are you interested in my sister, Apostle of Allaah(saws)?” He said “What should I do?” She said “You marry her” He said “Your sister?” She said “Yes”. He said “Do you like that?” she said “I am not alone with you of those who share me in this good, my sister is most to my liking. He said “She is not lawful for me.” She said “By Allaah, I was told that you were going to betroth with you Darrah to Durrah , the narrator Zuhair doubted the daughter of AbuSalamah. He said “The daughter ofUmmSalamah? She said “Yes”. He said “(She is my step daughter). Even if she had not been my step daughter under my protection, she would not have been lawful for me. She is my foster niece (daughter of my brother by fosterage). Thuwaibah suckled me as well as his father (AbuSalamah). So do not present to me your daughters and your sisters."
        },
        {
          "body": "Narrated 'Umar bin AbiSalamah- the step-son of the Prophet (SAW):\"When these Ayat were revealed to the Prophet (SAW): 'Allah only wishes to remove the Rijs from you, O members of the family, and to purify you with a thorough purification...' (33:33) in the home ofUmmSalamah, he called for Fatimah, Hasan, Husain, and wrapped them in a cloak, and 'Ali was behind him, so he wrapped him in the cloak, then he said: 'O Allah! These are the people of my house, so remove the Rijs from them, and purify them with a thorough purification.' SoUmmSalamahsaid: 'And am I with them O Messenger of Allah?' He said: 'You are in your place, and you are more virtuous to me.'\""
        },
        {
          "body": "Narrated 'Umar bin AbiSalamah- the step-son of the Prophet (SAW):\"When these Ayat were revealed to the Prophet (SAW): 'Allah only wishes to remove the Rijs from you, O members of the family, and to purify you with a thorough purification (33:33)' in the home ofUmmSalamah, he called for Fatimah, Hasan, Husain, and wrapped him in the cloak, and 'Ali was behind him, so he wrapped him in the cloak, then he said: 'O Allah! These are the people of my house, so remove the Rijs from them, and purify them with a thorough purification.' SoUmmSalamahsaid: 'And I, Prophet of Allah?' He said: 'You are in your place (meaning you are already a member of my household), and you are goodness.'\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:She never saw the Prophet (saws) fasting the whole month except Sha'ban which he combined with Ramadan."
        },
        {
          "body": "It was\nnarrated fromUmmSalamahthat the Messenger of Allah (saw)\nsaid:“The one who drinks from a silver vessel is swallowing Hell-fire\ninto his belly.”"
        },
        {
          "body": "It was narrated thatUmmSalamahsaid:\"The Messenger of Allah used to fast three days of every month: the Monday and Thursday of the first week and the Monday of the following week.\""
        },
        {
          "body": "'Imran bin Hudair said:\"I asked Lahiq about the two Rak'ahs before sunset. He said: \"Abdullah bin Az-Zubair used to pray them, and Mu'awiyah sent word to him asking: 'What are these two Rak'ahs at sunset?' He had to refer toUmmSalamah, andUmmSalamahsaid: 'The Messenger of Allah (PBUH) used to pray two Rak'ahs before 'Asr, then he was distracted and did not pray them, so he prayed them when the sun set, and I never saw him pray them before or after that.'\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:In the time of the Messenger of Allah (saws) there was a woman who had an issue of blood. SoUmmSalamahasked the Messenger of Allah (saws) to give a decision about her. He said: She should consider the number of nights and days during which she used to menstruate each month before she was afflicted with this trouble and abandon prayer during that period each month. When those days and nights are over, she should take a bath, tie a cloth over her private parts and pray."
        },
        {
          "body": "It was narrated from Zainab bint AbiSalamahthatUmmSalamahsaid:\"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\""
        },
        {
          "body": "It was narrated from 'Abdul-Malik bin Harith bin Hisham, from his father, that:the Prophet marriedUmmSalamahin Shawwal, and consummated the marriage with her in Shawwal."
        },
        {
          "body": "It was narrated from that Safinah - Abu 'Abdur-Rahman-said :“UmmSalamahfreed me but stipulated that I should serve the Prophet (SAW) as long he lived.”"
        },
        {
          "body": "It was\nnarrated thatUmmSalamahsaid:“The Messenger of Allah (saw)\nused\nto pray Witr with seven or five Rak’ah, and he would not say\nSalam\nor speak in between them.”"
        },
        {
          "body": "UmmSalamahnarrated:\"The time of waiting for Nifas during the time of AIlah's Messenger was forty days. We used to cover our faces with reddish-brown Wars.\""
        },
        {
          "body": "UmmSalamahnarrated:\"Allah's Messenger would hasten Zuhr more than you (people), while you (people) hasten Asr more than him.\""
        },
        {
          "body": "It was narrated thatUmmSalamahsaid:\"Subai'ah gave birth a few days after her husband died, and the Messenger of Allah told her to get married.\""
        },
        {
          "body": "The tradition mentioned above has also been transmitted byUmmSalamahfrom the Prophet (saws) through a different chain of narrators. The tradition of Mu'adh is more perfect."
        },
        {
          "body": "It was narrated from AbuSalamah, thatUmmSalamahsaid:\"By the One in Whose Hand is my soul. The Messenger of Allah (SAW) did not pass away until most of his prayers were offered sitting down, except for the obligatory prayers, and the dearest of actions to him were those which were done persistently, even if they were few.\""
        }
      ]
    }
  ]
}