{
  "data": [
    {
      "hadith": [
        {
          "body": "UmmHishāmbintḤārithahreported:\"I only learned Qāf. By the Glorious Quran from praying behind the Messenger of Allah (ﷺ); he used to recite it in the morning prayer.”Reference:Sunan an-Nasa'i 949"
        },
        {
          "body": "Hasan bin ur-Rabī’ narrated to us, Hammād bin Zayd narrated to us, on authority of Ayyūb andHishām[bin Hassān], on authority of Muhammad [bin Sīrīn] ; and Fuḍayl [bin Īyāḍ] narrated to us on authority ofHishām[bin Hassān]; he said Mukhlad bin Husayn narrated to us, on authority ofHishām[bin Hassān], on authority of Muhammad bin Sīrīn , that he said:‘Indeed this knowledge is faith, so carefully consider from whom you take your faith’."
        },
        {
          "body": "The daughter ofḤārithahbin An-Nu’mān said:\"I memorized 'Qaf. By the Glorious Qur'an,'\" from the mouth of the Messenger of Allah (ﷺ) when he was on the minbar (pulpit) on Friday.\"Reference:Sunan an-Nasa'i 1411"
        },
        {
          "body": "Al-Faḍl bin Sahl narrated to me, he said Yazīd bin Hārūn narrated to us, he said Khalīfah bin Mūsā informed me, he said:‘I entered upon Ghālib bin Ubayd Allah so he began dictating to me ‘Mak’hūl narrated to me this’ and ‘Mak’hūl narrated to me that’. So he prepared to answer the call of nature and stood up, then I looked in his notebook and in it was ‘Abān narrated to me, on authority of Anas’ and ‘Abān on authority of so-and-so’. So I abandoned [listening to his Ḥadīth] and stood up [to leave]’.I heard al-Hasan bin Alī al-Hulwānī saying: ‘I saw in one of the books of Affān a Ḥadīth ofHishāmAbīl-Miqdām meaning a Ḥadīth of Umar bin Abd il-Azīz. [In it was written] ‘Hishāmsaid: ‘A man said to be Yahyā bin so-and-so narrated to me, on authority of Muhammad bin Ka’b…’ [Al-Hulwānī] said, I said to Affān: ‘They would sayHishāmheard it [directly] from Muhammad bin Ka’b’. So [Affān] said: ‘IndeedHishāmwas stricken [with accusations of lying] with regards to this Ḥadīth for he would say ‘Yahyā narrated to me on authority of Muhammad’, then he claimed afterwards that he heard it from Muhammad [directly]’.’"
        },
        {
          "body": "It was narrated from 'Irak bin Malik that ZainabbintAbi Salamah told him, thatUmmHabibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbi Salamah.\" The Messenger of Allah said: \"As a co-wife toUmmSalamah? Even if I were not married toUmmSalamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "ZainabbintUmmSalama (the wife of the Holy Prophet) reported thatUmmSalama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "It was\nnarrated thatUmmQaisbintMihsan said:“I brought a son of\nmine\nto the Prophet (saw), and I had pressed on an area of his throat\ndue\nto tonsillitis. He said: ‘Why do you poke your children with this\npressing?’ You should use this aloeswood, for in it there are seven\ncures. It should be inhaled for pustules in the throat, and given in\nthe side of the mouth for pleurisy.”\n\n(Another chain) fromUmmQaisbintMihsan, from the Prophet (saw) with similar wording."
        },
        {
          "body": "He reported God's messenger as saying, “If anyone recitesHā’ Mīm ad-Dukhānon a Thursday night his sins will be forgiven.” \n\nTirmidhī transmitted it, saying that this is agharīb da’īftradition and thatHishāmAbūl Miqdām its transmitter is declared to be weak."
        },
        {
          "body": "A similar report was narrated from SafiyyahbintAbi 'Ubaid from one of the wives of the Prophet -and she isUmmSalamah- from the Prophet."
        },
        {
          "body": "UmmBilalbintHilal narrated from her father that the Messenger of\nAllah\n(saw) said:“It is permissible to offer a Jadha’a* among sheep\nas\na sacrifice.”"
        },
        {
          "body": "It was\nnarrated from ZainabbintUmmSalamah that her mother said\nthat her\nbed was in front of the place where the Messenger of Allah\n(saw)\nprostrated."
        },
        {
          "body": "It was\nnarrated thatUmmHani’bintAbi Talib said:“I used to hear\nthe\nProphet (saw) reciting at night when I was on the roof of my\nhouse.”"
        },
        {
          "body": "UmmQaisbintMihsan said:“The Messenger of Allah (saw) said: ‘You\nshould\nuse Indian aloeswood for it contains seven cures, including (a\ncure\nfor) pleurisy.’”"
        },
        {
          "body": "UmmSalamah narrated:UmmSulaimbintMilhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\"UmmSalamah said: \"I said to her: 'OUmmSuIaim! You have disgraced the women!'\""
        },
        {
          "body": "It was narrated thatUmmHaimbintWadda' Al-Khuza'iyyah said:\"I heard the Messenger of Allah (saas) say: 'The supplication of a father reaches the Veil (i.e. the place of repentance).'\""
        },
        {
          "body": "It was narrated thatUmmHabibahbintAbi Sufyan said:\"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\""
        },
        {
          "body": "(Another chain) fromUmmAmarahbintKa'b Al-Ansari:From the Prophet, that is similar, except that he did not mention \"Until they finish, or they have eating their fill.\""
        },
        {
          "body": "It was narrated that ZainabbintUmmSalamah said:\"UmmHabibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\""
        },
        {
          "body": "UmmHabibabintQays (Khawla) was heard to say, \"My hand and that\nof the Messenger of Allah, may Allah bless him and grant him peace, mixed\ntogether in the same vessel.\""
        },
        {
          "body": "It was\nnarrated fromUmmHabibahbintAbi Sufyan that the Prophet\n(saw)\nsaid:“Whoever performs twelve Rak’ah (of Sunnah) during the day\nand night, a house will be built for him in Paradise.”"
        },
        {
          "body": "It was narrated thatUmmHishambintHarithah bin An-Nu'man said:\"I only learned :Qaf. By the Glorious Quran.' Behind the Messenger of Allah (SAW); he used to recite it in Subh."
        },
        {
          "body": "UmmKulthumbint'Uqbah narrated that the  Messenger of Allah said:\"One who brings peace between people is not a liar, he says something good, or reports something good.\""
        },
        {
          "body": "It was\nnarrated thatUmmSalamah said:“The Prophet (saw) was\nperforming\nprayer in the house ofUmmSalamah, and ‘Abdullah or ‘Umar\nbin\nAbu Salamah passed in front of him; he gestured his hand, and he\nwent\nback. Then ZainabbintUmmSalamah passed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "UmmHanibint'Ali ibn Talib said:\"Allah’s Messenger (Allah bless him and give him peace) arrived boldly at Mecca, and he had four braids of hair.”"
        },
        {
          "body": "'Urwah narrated that ZainabbintAbi Salamah -whose mother wasUmmSalamah, the wife of the Prophet- told him thatUmmHabibahbintAbi Sufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry DurrahbintAbi Salamah.' He said: 'The daughter ofUmmSalamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "It was\nnarrated fromUmmHani’bintAbu Talib that on the day of the\nConquest (of Makkah) the Messenger of Allah (saw) prayed voluntary\nDuha with eight Rak’ah, saying the Salam after each two Rak’ah."
        },
        {
          "body": "It was narrated thatUmmSubyah Al-Juhaniyyah said:\"Often my hand would touch the hand of the Messenger of Allah while performing ablution from a single vessel.\" (Hasan)\n\nAbu `Abdullah bin Majah said: \"I heard Muhammad say: 'UmmSubyah was KhawlahbintQais. I mentioned that to Abu Zur`ah and he said: \"It is true.\""
        },
        {
          "body": "It was narrated from Urwah from ZainabbintUmmSalamab, fromUmmSalamah, that:she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\""
        },
        {
          "body": "It was narrated thatUmmQaisbintMihsan said:\"I asked the Messenger of Allah about menstrual blood that gets on clothing. He said, 'Wash it with water and lote leaves, and rub it, even with a piece of stick.'\""
        },
        {
          "body": "Amr an-Nāqid narrated to us, Sufyān bin Uyaynah narrated to us, on authority ofHishāmbin Hujayr, on authority of Tāwus, he said:‘A book was brought to Ibn Abbās which contained the verdicts of Alī, may Allah be pleased with him, and he effaced but a small amount,’ and Sufyān bin Uyaynah indicated with his arm [the amount]."
        },
        {
          "body": "It was narrated thatUmmQaisbintMihsan said:\"I came to the Messenger of Allah with a son of mine who was not yet eating solid food, and he (the baby) urinated on him. He called for water and sprinkled it over (the urine).\""
        },
        {
          "body": "Yahya related to me from Malik from Nafi that SafiyyabintAbi\nUbayd told him that Hafsa,ummal-muminin, sent Asim ibn Abdullah ibn\nSad to her sister FatimabintUmar ibn al-Khattab for her to suckle\nhim ten times so that he could come in to see her. She did it, so he\nused to come in to see her."
        },
        {
          "body": "It was narrated from ZainabbintUmmSalamah, thatUmmSalamah andUmmHabibah said:\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\""
        },
        {
          "body": "UmmSa'idbintMurra al-Fihri related from her father that the Prophet,\nmay Allah bless him and grant him peace, said, \"I and the guardian of an\norphan will be in the Garden like these two.\" (His two fingers)"
        },
        {
          "body": "It was narrated from ZainabbintAbi Salamah thatUmmHabibah, the wife of the Prophet said:\"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\"UmmHabibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry DurrahbintAbi Salamah.\" He said: \"The daughter ofUmmSalamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.\""
        },
        {
          "body": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abu Murra, the mawla of Aqil ibn Abi Talib, told\nhim that he had heardUmmHanibintAbi Talib say, \"I went to the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the conquest and found him doing ghusl while his daughter\nFatima, was screening him with a garment. I said to him, 'Peace be\nupon you' and he said, 'Who is that?' I replied, 'UmmHanibintAbi\nTalib,' and he said, 'Welcome,UmmHani!'  When he had finished his\nghusl, he stood and prayed eight rakas, covering himself with one\ngarment, and then came away. I said, 'Messenger of Allah, the son of\nmy mother, AIi, says that he is determined to kill so-and-so, son of\nHubayra, a man I have placed under my protection.'  The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'We give\nprotection to whoever you have given protection to,UmmHani.' \"UmmHani related that this incident happened in the morning."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'ishaummal-muminin sent him away while\nhe was being nursed to her sisterUmmKulthumbintAbi Bakr as-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"Salim said, \"UmmKulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha becauseUmmKulthum did not finish for me the ten times.\""
        },
        {
          "body": "It was narrated from SafiyyahbintShaibah, fromUmmSalamah, the wife of the Prophet, that the Prophet said:\"The woman whose husband has died should not wear clothes that are dyed with safflower or red clay, and she should not use dye nor kohl.\""
        },
        {
          "body": "UmmHani'bintAbu Talib narrated that :When it was the year of the Conquest (of Makkah), the Messenger of Allah got up to perform a bath and Fatimah screened him. Then he took his garment and wrapped himself in it (such that it became like the towel used to dry oneself)."
        },
        {
          "body": "It was narrated that 'Adi bin Dinar said:\"I heardUmmQaisbintMihsan say that she asked the Messenger of Allah (PBUH) about menstrual blood that gets on one's clothes. He said: 'Scratch it with a stick and wash it with water and lotus leaves.'\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"UmmHabibahbintJahsh asked the Messenger of Allah (PBUH): 'O Messenger of Allah, I suffer from Istihadah.' He said: 'That is a vein, so perform Ghusl, then pray.' And she used to perform Ghusl for each prayer.\""
        },
        {
          "body": "It was narrated that 'Adi bin Dinar said:\"I heardUmmQaisbintMihsan say that she asked the Messenger of Allah (PBUH) about menstrual blood that gets on one's clothes. He said: 'Scratch it with a stick and wash it with water and lotus leaves.'\""
        },
        {
          "body": "Bintal-Harith b. al-Nu'man said:I memorized Surah al-Qaf from the mouth of the Messenger of Allah (saws); he would recite it in his speech on every friday. Our oven and his oven were same.Abu Dawud said: Rawh b. 'Ubadah reported on the authority of Shu'bah the nameBintHarithah b. al-Nu'man ; and Ibn Ishaq reported the name ofUmmHisham hint Harithah b. al-Nu'man."
        },
        {
          "body": "It was narrated from Anas thatUmmAl-FadlbintAl-Harith said:\" The Messenger of Allah (SAW) led us in praying maghrib in his house and he recited Al-Mursalat, then after that, he never offered any prayer until he died.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"UmmHabibahbintJahsh suffered Istihadah (non-menstrual vaginal bleeding) for seven years. She complained about that to the Messenger of Allah (PBUH) and the Messenger of Allah (PBUH) said: 'That is not menstruation; rather that is (bleeding from) a vein, so perform Ghusl then pray.'\""
        },
        {
          "body": "ZainabbintUmmSalama (Allah be pleased with her) reported that a relative ofUmmHabiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days."
        },
        {
          "body": "It was narrated from Jabir that:a woman from Banu Makhzum stole (something), and she was brought to the Prophet. She sought the protection ofUmmSalamah, but the Prophet said: \"If FatimahbintMuhammad were to steal, I would cut off her hand.\" And he ordered that her hand be cut off."
        },
        {
          "body": "It was narrated that 'Aishah said:\"UmmHabibahbintJahsh consulted the Messenger of Allah (PBUH) and said: 'O Messenger of Allah, I suffer from Istihadah (non-menstrual vaginal bleeding).' He said: 'That is a vein, so perform Ghusl and pray.' And she used to perform Ghusl for every prayer.\""
        },
        {
          "body": "Yahya related to me from Malik from Abu Bakr ibn Nafi from his\nfather Nafi, the mawla of Ibn Umar that SafiyyabintAbi Ubayd\ninformed him thatUmmSalama, the wife of the Prophet, may Allah bless\nhim and grant him peace, said that when the lower garment of women was\nmentioned to the Messenger of Allah, he said, \"She lets it down a\nhandspan.\"UmmSalama said, \"If it leaves her uncovered?\" He said,\n\"Then the length of a forearm and let her not increase it.\""
        },
        {
          "body": "FatimabintQais (Allah be pleased with her) reported that she had been married to Abu 'Amr b. Hafs b. al-Mughira and he divorced her with three pronouncements. She stated that she went to Allah's Messenger (may peace be upon him) asking him about abandoning that house. He commanded her to move to the house of IbnUmmMaktum, the blind. Marwan refused to testify the divorced woman abandoning her house (before the 'Idda was over). 'Urwa said that 'A'isha objected to (the words of) FatimabintQais."
        },
        {
          "body": "Narrated SafiyyahbintHuyayy:Ibn Harmalah said:UmmHabib gave us a sa' and told us narration from the nephew of Safiyyah on the authority of Safiyyah that it was the sa' of the Prophet (saws).Anas ibn Ayyad said: I tested it and found its capacity two and half mudd according to the mudd of Hisham."
        },
        {
          "body": "It was narrated from ZainabbintAbi Salamah thatUmmSalamah said:\"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\""
        },
        {
          "body": "It was narrated from ZainabbintAbi Salamah thatUmmHabibah said:\"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "ZainabbintAbu Salama reported:UmmSalama andUmmHabiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wanted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days."
        },
        {
          "body": "Sulaiman bin Musa narrated that:When Muhammad bin Abi Sufyan was dying, he was greatly distressed and said: \"My sisterUmmHabibahbintAbi Sufyan said: 'The Messenger of Allah (SAW) said: Whoever maintains four rak'ahs before Zuhr and four after, Allah (SWT) will forbid him from the Fire.'\""
        },
        {
          "body": "It was narrated from SafiyyahbintAbi 'Ubaid from one of the wives of the Prophet, and fromUmmSalamah, that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "Yahya related to me from Malik from Musa ibn Maysara from Abu\nMurra, the mawla of Aqil ibn Abi Talib, thatUmmHanibintAbi Talib\ntold him that in the year of the conquest the Messenger of Allah, may\nAllah bless him and grant him peace, prayed eight rakas, covering\nhimself with one garment."
        },
        {
          "body": "It was narrated from 'Aishah thatUmmHabibahbintJahsh used to suffer from Istihadah for seven years. She asked the Prophet (PBUH) and he said:\"That is not menstruation, rather it is a vein. Tell her not to pray for the period of time that her period used to last, then let her perform Ghusl and pray.\" She used to perform Ghusl for every prayer."
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nHazm from his father from AmrabintAbd ar-Rahman that A'ishaummal-\nmuminin said to the Messenger of Allah, may Allah bless him and grant\nhim peace, \"Messenger of Allah, SafiyyabintHuyy has begun her\nperiod,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Perhaps she will delay us. Has she done tawaf of the\nHouse with you?\" They said, \"Of course.\" He said, \"So you are free to\nleave.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from ZaynabbintAbi Salama thatUmmSalama, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"UmmSalama,\nthe wife of Abu Talha al-Ansari, came to the Messenger of Allah, may\nAllah bless him and grant him peace, and said, 'Messenger of Allah!\nAllah is not ashamed of the truth-does a woman have to do ghusl if she\nhas had an erotic dream?' He said, 'Yes, if she sees any liquid.' \""
        },
        {
          "body": "It was narrated from Abu Al-Hasan, the freed slave ofUmmQaisbintMihsan, thatUmmQais said:\"My son died, and I felt very sad. I said to the one who was washing him: 'Do not wash my son with cold water and kill him.\" 'Ukashah bin Mihsan went to the Messenger of Allah and told him what she had said, and he smiled then said: \"What did she say, may Allah give her long life?\" And we do not know of any woman who lived as long as she lived."
        },
        {
          "body": "Muhammad ibn 'Ata' related that he visited ZaynabbintSalama and\nshe asked him about the name of one of his sisters. He reports:\"I said,\n'Her name is Barra.' She said, 'Change her name. The Prophet, may Allah\nbless him and grant him peace, married ZaynabbintJahsh. Her name was\nBarra and he changed it to Zaynab. I visitedUmmSalama when she married\nhim and my name was Barra. He heard her call me Barra and said, 'Do not\nadorn yourselves. Allah is the One who knows those who are pious (barra)\namong you and those who are deviant. Call her Zaynab.'UmmSalama said,\n'She is Zaynab.' I said to Zaynab, 'Give her a name.' Zaynab said, 'Change\nit to what the Messenger of Allah, may Allah bless him and grant him peace,\nchanged it.'\" So he called her Zaynab."
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair that ZainabbintAbi Salmah told him thatUmmHabibah told her that she said to Messenger of Allah:“Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry DurrahbintAbi Salmah.” The Messenger of Allah said:  The daughter ofUmmSalamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”"
        },
        {
          "body": "FatimabintQais (Allah be pleased with her) reported:My husband divorced me with three pronouncements. I decided to move (from his house to another place). So I came to Allah's Messenger (may peace be upon him), and he said: Move to the house of your cousin 'Amr b.UmmMaktum and spend your period of 'Idda there."
        },
        {
          "body": "NarratedUmmHani'bintAbi Talib:\"The Messenger of Allah (saws) entered upon me and said: 'Do you have anything?' I said: 'No, except a piece of hard bread and vinegar.' so he said: 'Bring it, for a house that has vinegar is not impoverished of condiments.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it as a Hadith ofUmmHani' except through this route. Abu Hamzah Ath-Thumali's (a narrator in the chain) name is Thabit bin Abi Safiyyah. AndUmmHani' died some time after 'Ali bin Abi Talib. I asked Muhammad about this Hadith. He said: \"I do not know Ash-Sha'bi hearing fromUmmHani'.\" So I said: \"How is Abu Hamzah according to you?\" He said: \"Ahmad bin Hanbal criticized him, but he is Muqarib (average) in Hadith to me.\""
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair and 'Amrahbint'Abdur-Rahman that :'Aishah the wife of the Prophet said: \"UmmHabibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahman bin 'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.'\" 'Aishah said: \"She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sister ZainabbintJahsh and the blood would turn the water red.\""
        },
        {
          "body": "Narrated `A'ishah (RAA):UmmHabibabintJahsh complained to Allah's Messenger (Peace be upon him) about a prolonged flow of blood. He said to her, \"Keep away (from prayer) as long as your normal period used to prevent you (from praying), and afterwards she should perform Ghusl (and pray)\". (She used to take a bath for every prayer).\n[Reported by Muslim.]"
        },
        {
          "body": "Ummal-Fadlbint- al-Harith reported that some people argued about the fasting of the Messenger of Allah (may peace be upon him) on the day of 'Arafa. Some of them said that he had been fasting, whereas the others said that he had not been fasting. I sent a cup of milk to him while he was riding his camel at 'Arafa, and he drank it."
        },
        {
          "body": "HindbintAl-Harith Al-Farrasiyyah narrated that:UmmSalamah told her that during the time of the Messenger of Allah (SAW), when the women said the taslim at the end of the prayer, the Messenger of Allah (SAW) and the men who had prayed with him would stay put for as long as Allah (SAW) willed. Then, when the Messenger of Allah (SAW) got up, the men did too."
        },
        {
          "body": "It was narrated from 'Aishah thatUmmHabibahbintJahsh used to suffer from Istihadah (non-menstrual vaginal bleeding) for seven years. She asked the Prophet (PBUH) and he said:\"That is not menstruation, rather it is a vein. Tell her not to pray for the amount of time that her period used to last, then let her perform Ghusl and pray.' She used to perform Ghusl for every prayer."
        },
        {
          "body": "'Abdur-Rahman bin 'Asim narrated that FatimahbintQais -who was married to a man of Banu Makhzum- told him that he divorced her three times. He went out on a military campaign and told his representative to give her some provision. She thought it was too little, so she went to one of the wives of the Prophet, and the Messenger of Allah came in while she was with her. She said:\"O Messenger of Allah, this is FatimahbintQais who has been divorced by so-and-so. He sent her some provision but she rejected it. He said that it was something he did not have to do (a favor).\" He said: \"He is telling the truth.\" The Prophet said: \"Go toUmmKulthum and observe your 'Iddah in her house.\" Then he said: \"UmmKulthum is a woman who has a lot of visitors. Go to 'Abdullah binUmmMaktum for he is blind.\" So she went to 'Abdullah and observed her 'Iddah in his house, until her 'Iddah was over. Then Abu Al-Jahm and Mu'awiyah bin Abi Sufyan proposed to her. So she came to the Messenger of Allah to consult him about them. He said: \"As for Abu Al-Jahm, he is a man the waving of whose stick I fear for you. And as for Mu'awiyah he is a man who does not have any money.\" So she married Usamah bin Zaid after that."
        },
        {
          "body": "It was\nnarrated from ‘Abdur-Rahman bin Ka’b bin Malik, about Ka’b:“When Ka’b was dying,UmmBishrbintBara’ bin Ma’rur came to\nhim and\nsaid: ‘O Abu ‘Abdur-Rahman! If you meet so-and-so, convey\nSalam to him\nfrom me.’ He said: ‘May Allah forgive you, OUmmBishr! We are too\nbusy to think of that.’ She said: ‘O Abu\n‘Abdur-Rahman! Did you not\nhear the Messenger of Allah (SAW) say:\n“The souls of the believers are\nin green birds, eating from the\ntrees of Paradise”?’ He said: ‘Yes.’\nShe said: ‘That is\nwhat I mean.’”"
        },
        {
          "body": "NarratedUmmal-MundharbintQays al-Ansariyyah:The Messenger of Allah (saws) came to visit me, accompanied by Ali who was convalescing. We had some ripe dates hung up. The Messenger of Allah (saws) got up and began to eat from them.Ali also got up to eat, but the Messenger of Allah (saws) said repeatedly to Ali: Stop, Ali, for you are convalescing, and Ali stopped.She said: I then prepared some barley and beer-root and brought it.  The Messenger of Allah (saws) then said: Take some of this, Ali, for it will be more beneficial for you.  AbuDawud said: The narrator Harun said: al-Adawiyyah (i.e.Ummal-Mundhar)."
        },
        {
          "body": "It was narrated from Humaid bin Nafi' that ZainabbintAbi Salamah told him these three Hadiths. Zainab said:\"I entered uponUmmHabibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died.UmmHabibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "ZainabbintAbu Salamah narrated that her motherUmmSalamah, the wife of the Prophet, used to say:\"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that this is a concession which the Messenger of Allah granted only to Salim. No one will enter upon us, nor see us on the basis of this type of breast-feeding.'\""
        },
        {
          "body": "It was narrated that Ash-Sha'bi said:\"I came to FatimahbintQais and asked her about the ruling of the Messenger of Allah concerning her. She said that her husband divorced her irrevocably, and she referred her dispute with him, concerning accommodation and maintenance, to the Messenger of Allah. She said: 'He did not give me (the right to) accommodation and maintenance, and he told me to observe my 'Iddah in the house of IbnUmmMaktum,'\""
        },
        {
          "body": "It was narrated from 'Aishah thatUmmHabibahbintJahsh who was married to 'Abdur-Rahman bin 'Awf suffered from Istihadah and did not become pure. Her situation was mentioned to the Messenger of Allah (PBUH) and he said:\"That is not menstruation, rather it is a kick in the womb, so let her work out the length of the menses that she used to have, and stop praying (for that period of time), then after that let her perform Ghusl for every for every prayer.\""
        },
        {
          "body": "Malik related to me from Yahya ibn Said from AmrabintAbd ar-\nRahman that Barira came asking the help of A'isha,ummal-muminin.\nA'isha said, \"If your masters agree that I pay them your price in one\nlump sum and set you free I will do it.\" Barira mentioned that to her\nmasters and they said, \"No, not unless your wala' is ours.\" Yahya ibn\nSaid added that AmrabintAbd ar-Rahman claimed that A'isha mentioned\nthat to the Messenger of Allah, may Allah bless him and grant him\npeace, and the Messenger of Allah, may Allah bless him and grant him\npeace said, \"Buy her and set her free. The wala' only belongs to the\none who sets free.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"UmmHabibahbintJahsh- the wife of 'Abdur-Rahman bin 'Awf and the sister of ZainabbintJahsh - suffered Istihadah (non-mentrual vaginal bleeding).\" She said: \"She consulted the Messenger of Allah (PBUH) and the Messenger of Allah (PBUH) said to her: 'That is not menstruation, rather that is a vein. When you period goes, perform Ghusl and pray, and when it comes, stop praying (for that period).'\" 'Aishah said: \"She used to perform Ghusl for every prayer and pray. Sometimes she would perform Ghusl in a washtub in the room of her sister Zainab when she was with the Messenger of Allah (PBUH) and the water would turn red with blood, then she would go out and pray with the Messenger of Allah (PBUH). That did not stop her from praying.\""
        },
        {
          "body": "Narrated Ishaq bin 'Abdullah bin Abi Talhah:That he heard Anas [bin Malik] saying: \"The Messenger of Allah (saws) used to visitUmmHarambintMilhan, who would offer him meals.UmmHaram was the wife of 'Ubadah bin As-Samit. Once the Messenger of Allah (saws) visited her and she provide him with some food and started inspecting this head for lice. Then the Messenger of Allah (saws) slept and afterwards he awoke smiling.She said: 'I said: \"What causes you to smile, O the Messenger of Allah (saws) ?\" He said: \"Some of my followers who were displayed before me )in a dream) as fighters in Allah's cause, riding on a ship this ocean who were kings upon thrones, or like kings upon thrones.\" I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.'\" So he supplicated for her. Then he lay down his head to sleep. Then he woke up and he was smiling. She said: 'So I said to him: \"What causes you to smile, O the Messenger of Allah (saws)?\" He said: \"Some of my followers who were displayed before me (in a dream) as fighters in Allah's cause,\" and he said similar to what he said earlier. She said: 'I said: \"O Messenger of Allah! Supplicate to Allah to make me among them.\" He said: \"You are the earlier ones.'\" He said: \"SoUmmHaram rode on the sea during the time of Mu'awiyah bin Abu Sufyan. She was thrown from the riding animal after she arrived from the ocean voyage, and she died.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.UmmHarambintMilhan is the daughter ofUmmSulaim, the maternal aunt of Anas bin Malik."
        },
        {
          "body": "It was narrated that 'Abdullah bin Harith bin Nawfal said:\"I asked whether the Messenger of Allah prayed voluntary prayer when traveling, but I could not find anyone to tell me untilUmmHani'bintAbu Talib told me that he had come during the year of the Conquest (of Makkah). He ordered that a screen be held up, and that was done, and he took a bath; then he prayed eight Rak'ah (units) of voluntary prayer.\""
        },
        {
          "body": "Yahya related to me from Malik from AbuRijal Muhammad ibn Abd ar-\nRahman from AmrabintAbd ar-Rahman that when A'ishaummal-muminin\nwas doing hajj with women who were expecting their periods, she would\nhurry them to do the tawaf al-ifada on the Day of Sacrifice. If they\nstarted to menstruate after the tawaf al-ifada she did not stop for\nthem but left with them while they were menstruating."
        },
        {
          "body": "It was narrated from ZainabbintUmmSalamah -I (the narrator) said:\"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\""
        },
        {
          "body": "It was narrated from Shu'bah that Habib said:\"I heard 'Abbad bin Tamim narrate from my grandmother - who wasUmm'UmarahbintKa'b - that the Prophet (PBUH) performed Wudu', and he was brought a vessel in which there were two-thirds of a Mudd.\" Shu'bah said: \"I remember that he washed his forearms and started rubbing them, and he wiped the inside of his ear, but I do not remember whether he wiped the outside of them.\""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from A'ishaummal-muminin that SafiyyabintHuyy\nbegan menstruating and so she mentioned it to the Messenger of Allah,\nmay Allah bless him and grant him peace, and he asked, \"Will she delay\nus?\" and he was told, \"She has already done the tawaf al-ifada,\" and\nhe said, \"Then she will not delay us. \""
        },
        {
          "body": "UmmHakimbintAsid narrated from her mother that her husband died and she had a problem in her eye, so she applied kohl to clear her eyes. She sent a freed slave woman of hers toUmmSalamah to ask her about using kohl to clear her eyes. She said:\"Do not use kohl unless it cannot be avoided. The Messenger of Allah entered upon me when Abu Salamah died and I had put some aloe juice on my eyes. He said: 'What is this, OUmmSalamah?' I said: 'It is aloe juice, O Messenger of Allah, there is no perfume in it.' He said: 'It makes the face look bright, so only use it at night, and do not comb your hair with perfume or henna, for it is a dye.' I said: 'With what can I comb it, O Messenger of Allah?' He said: 'With lote leaves -cover your head with them.'\""
        },
        {
          "body": "Narrated Anas bin Malik:Allah's Apostle used to visitUmmHarambintMilhan, who would offer him meals.UmmHaram was the \nwife of Ubada bin As-Samit. Allah's Apostle, once visited her and she provided him with food and \nstarted looking for lice in his head. Then Allah's Apostle slept, and afterwards woke up smiling.UmmHaram asked, \"What causes you to smile, O Allah's Apostle?\" He said. \"Some of my followers who (in \na dream) were presented before me as fighters in Allah's cause (on board a ship) amidst this sea caused \nme to smile; they were as kings on the thrones (or like kings on the thrones).\" (Ishaq, a sub-narrator is \nnot sure as to which expression the Prophet used.)UmmHaram said, \"O Allah's Apostle! Invoke Allah \nthat he makes me one of them. Allah's Apostle invoked Allah for her and slept again and woke up \nsmiling. Once againUmmHaram asked, \"What makes you smile, O Allah's Apostle?\" He replied, \n\"Some of my followers were presented to me as fighters in Allah's Cause,\" repeating the same dream.UmmHaram said, \"O Allah's Apostle! Invoke Allah that He makes me one of them.\" He said, \"You are \namongst the first ones.\" It happened that she sailed on the sea during the Caliphate of Mu'awiya bin \nAbi Sufyan, and after she disembarked, she fell down from her riding animal and died."
        },
        {
          "body": "UmmKulthumbint'Uqbah (May Allah be pleased with her) reported:Messenger of Allah (PBUH) said, 'The person who (lies) in order to conciliate between people is not a liar, when he conveys good or says (something) good\".[Al-Bukhari and Muslim].The narration in Muslim added: She said, \"I never heard him (she meant the Prophet (PBUH)) giving permission of lying in anything except in three (things): war, conciliating between people and the conversation of man with his wife and the conversation of a woman with her husband\"."
        },
        {
          "body": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah\nibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas thatUmmal-\nFadlbintal-Harith heard him reciting al Mursalat (sura 77) and she\nsaid to him, \"My son, you have reminded me by reciting this sura that\nit was what I last heard the Messenger of Allah, may Allah bless him\nand grant him peace, recite in the maghrib prayer.\""
        },
        {
          "body": "FatimabintQais reported that her husband al-Makhzulmi divorced her and refused to pay her maintenance allowance. So she came to Allah's Messenger (may peace he upon him) and informed him, whereupon he said:There is no maintenance allowance for you, and you better go to the house of IbnUmmMaktum and live with him for he is a blind man and you can put off your clothes in his house (i. e. you shall not face much difficulty in observing purdah there)."
        },
        {
          "body": "ZainabbintAbu Salama reported that when the news of the death of Abu Safyan came toUmmHabiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days."
        },
        {
          "body": "Habib bin Zaid said:\"I heard a freed slave of ours called Laila narrated from [his (Habib's) grandmother]UmmAmarahbintKa'b Al-Ansar, that the Prophet entered upon her and some food was brought to him. He said: 'Eat.' She said: 'I am fasting.' So the Messenger of Allah said: 'Indeed the angels send Salat upon the fasting person when (others) eat in his presence, until they finish.' And perhaps he said: 'Until they have eaten their fill.'\""
        },
        {
          "body": "NarratedUmmQaysbintMihsan:Hilal ibn Yasaf said: I came to ar-Raqqah (a place in Syria). One of my companions said to me: Do you want to see any of the Companions of the Prophet (saws)? I said: A good opportunity. So we went to Wabisah.I said to my friend: Let us first see his mode of living. He had a cap with two ears stuck (to his head), and wearing a brown silken robe. He was resting on a staff during prayer. We asked him (about resting on the staff) after salutation; He said:UmmQays daughter of Mihsan said to me that when the Messenger of Allah (saws) became aged and the flesh grew increasingly on him, he took a prop at his place of prayer and rested on it."
        },
        {
          "body": "Narrated 'Amir bin Shurahbil Ash-Sha'bi:'Amir bin Shurahbil Ash-Sha'bi narrated that he heard FatimahbintQais--who was one of the first Muhajir women-- say: 'Abdur-Rahman bin 'Awf proposed marriage to me, along with others of the Companions of Muhammad. And the Messenger of Allah proposed that I marry his freed slave, Usamah bin Zaid. I was told that the Messenger of Allah had said: 'Whoever loves me, let him love Usamah.' When the Messenger of Allah spoke to me I said: 'My affairs are in your hands; marry me to whomever you wish.' He said: 'Go toUmmSharik.'UmmSharik was a rich Ansari woman who used to spend a great deal in the cause of Allah, and she always had a lot of guests. I said: 'I will do that.' He said: 'Do not do that, forUmmSharik has a lot of guests, and I would not like your Khimar to fall off, or your shins to become uncovered, and the people to see something of you that you do not want them to see. Rather go to your cousin (son of your paternal uncle) 'Abdullah bin 'Amr binUmmMaktum, who is a man of Banu Fihr.' So I went to him.\""
        },
        {
          "body": "It was narrated from Zubair bin 'Awwam that:he was married toUmmKulthumbint'Uqbah, and she said to him when she was pregnant. \"I will accept one divorce.\" So he divorced her once. Then he went out for prayer, and when he came back she had given birth. He said: \"What is wrong with her? She misled me may Allah mislead her!\" Then he came to the Prophet (SAW), who said: \"Her waiting period is over (and she is divorced); propose marriage a new to her.\""
        },
        {
          "body": "NarratedUmmSalamah:that the Messenger of Allah (SAW) called for Fatimah in the Year of the Conquest to speak to her, and she cried. Then he spoke to her and she laughed. She said: \"When the Messenger of Allah (SAW) died I asked her about her crying and her laughing. She said: 'The Messenger of Allah (SAW) informed me that he would (soon) die, so I cried. Then, he informed me that I was the master over all of the women among the inhabitants of Paradise, except for Mariambint'Imran, so I laughed.'\""
        },
        {
          "body": "It was narrated from Abu Salamah bin 'Abdur-Rahman that FatimahbintQais told him that she was married to Abu 'Amr bin Hafs bin Al-Mughirah, who divorced her by giving her the last of three divorces. Fatimah said that she came to the Messenger of Allah and consulted him about leaving her house. He told her to move to the house of IbnUmmMaktum, the blind man. Marwan refused to believe Fatimah about the divorced woman leaving her house. 'Urwah said:\"Aishah denounced Fatimah for that.\""
        },
        {
          "body": "Sha'bi reported:I visited FatimabintQais and asked her about the verdict of Allah's Messenger (may peace be upon him) about (board and lodging during the 'Idda) and she said that her husband divorced her with an irrevocable divorce. She (further. said): I contended with him before Allah's Messerger (may peace be upon him) about lodging and maintenance allowance, and she said: He did not provide me with any lodging or maintenance allowance, and he commanded me to spend the 'Idda in the house of IbnUmmMaktum."
        },
        {
          "body": "Abu Salama reported that FatimabintQais, the sister of al-Dahhak b. Qais informed him that Abu Hafs b. Mughira al-Makhzumi divorced her three times and then he proceeded on to the Yemen. The members of his family said to her:There is no maintenance allowance due to you from us. Khalid b. Walid along with a group of persons visited Allah's Messenger (may peace be upon him) in the house of Maimuna and they said: Abu Hafs has divorced his wife with three pronouncements; is there any maintenance allowance due to her? Thereupon Allah's Messenger (may peace be upon him) said: No maintenance allowance is due to her, but she is required to spend the 'Idda; and he sent her the message that she should not be hasty in making a decision about herself and commanded her to move to the house ofUmmSharik, and then sent her the message that as the first immigrants (frequently) visit the house ofUmmSharik, she should better go to the house of IbnUmmMaktum, the blind, (and further said: In case you put off your head-dress, he (IbnUmmMakhtum) will not see you. So she went to his house, and when the 'Idda was over, Allah's Messenger (may peace be upon him) married her to Usama b. Zaid b. Haritha."
        },
        {
          "body": "It was\nnarrated thatUmmMundhirbintQais Ansariyyah said:“The\nMessenger\nof Allah (saw) entered upon us, and with him was ‘Ali bin\nAbu\nTalib, who had recently recovered from an illness. We had bunches\nof\nunripe dates hanging up, and the Prophet (saw) was eating from\nthem.\n‘Ali reached out to eat some, and the Prophet (saw) said to\n‘Ali:\n‘Stop, O ‘Ali! You have just recovered from an illness.’ I made\nsome greens and barley for the Prophet (saw), and the Prophet (saw)\nsaid to ‘Ali: ‘O ‘Ali, eat some of this, for it is better for\nyou.’”"
        }
      ]
    }
  ]
}