{
  "data": [
    {
      "hadith": [
        {
          "body": "Jabir b. Abdullah reported that Allah's Messenger (may peace be upon him) visitedUmmSa'ib orUmmMusayyib and said:UmmSa'ib orUmmMusayyib. why is it that you are shivering? She said:\" It is fever and may it not be blessed by Allah, whereupon he (the Holy Prophet) said: Don't curse fever for it expiates the sin of the children of Adam just as furnace removes the alloy of iron."
        },
        {
          "body": "Jabir (May Allah be pleased with him) reported:The Messenger of Allah (PBUH) visitedUmmSa'ib (orUmmMusaiyyab) and asked her, \"What ails you OUmmSa'ib (orUmmMusaiyyab)? You are shivering.\" She replied: \"It is a fever, may Allah not bless it!\" He said to her, \"Do not revile fever, for it cleanses out the sins of the sons of Adam in the same way that a furnace removes the dirt of iron.\"[Muslim]."
        },
        {
          "body": "UmmSalamah narrated:UmmSulaim bint Milhan came to the Prophet and she said: 'O Messenger of Allah! Indeed Allah is not embarrassed of the truth. So is it required of a woman - meaning Ghusl - when she sees in her sleep similar to what a man sees?' He replied: 'Yes. When she finds water (wetness), then she is perform Ghusl.'\"UmmSalamah said: \"I said to her: 'OUmmSuIaim! You have disgraced the women!'\""
        },
        {
          "body": "Zainab the daughter ofUmmSalamah narrated fromUmmSalamah that:She and the Messenger of Allah used to take a bath from a single vessel."
        },
        {
          "body": "Narrated Abu Hurairah:that the Messenger of Allah (SAW) said: \"Al-Hamdulillah isUmmAl-Qur'an andUmmAl-Kitab and the seven oft-repeated.\""
        },
        {
          "body": "Ummul Mu'mineenUmmSalama said:\"The apparel dearest to Allah’s Messenger (Allah bless him and give him peace) was the shirt [qamis].”"
        },
        {
          "body": "Umm'Atiyya reported:The Messenger of Allah (may peace be upon him) took a promise from us along with the oath of Allegiance that we would not lament. But only five among us fulfilled the promise (and they are)UmmSulaim, andUmmal-'Ala', and the daughter of Abu Sabra the wife of Mu'adh, or daughter of Abu Sabra and wife of Mu'adh."
        },
        {
          "body": "NarratedUmmHani:\"I went to the Messenger of Allah (SAW) during the Year of the Conquest, and I found him performing Ghusl, while Fatimah was screening him with a garment. She said: \"So I gave Salam and he said: 'Who is this?' I said: 'I amUmmHani.' He said: 'WelcomeUmmHani'\""
        },
        {
          "body": "Zainab bintUmmSalama (the wife of the Holy Prophet) reported thatUmmSalama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Some relative ofUmmSalamah said: The bed of the Prophet (saws) was set as a man is laid in his grave; the mosque was towards his head."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:The slave-mother of Ibrahim ibn AbdurRahman ibn Awf askedUmmSalamah, the wife of the Prophet (saws): I am a woman having a long border of clothe and I walk in filthy place; (then what should I do?).UmmSalamah replied: The Messenger of Allah ( peace be upon him) said: What comes after it cleanses it."
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'ishaummal-muminin sent him away while\nhe was being nursed to her sisterUmmKulthum bint Abi Bakr as-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"Salim said, \"UmmKulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha becauseUmmKulthum did not finish for me the ten times.\""
        },
        {
          "body": "It was narrated fromUmmSalamah that she brought some food in a dish of hers to the Messenger of Allah and his Companions, then 'Aishah came, wrapped up in a garment, with a stone pestle and broke the dish. The Prophet gathered the broken pieces of the dish and said:\"Eat; your mother got jealous,\" twice. Then the Messenger of Allah took the dish of 'Aishah and sent it toUmmSalamah and he gave the dish ofUmmSalamah to 'Aishah."
        },
        {
          "body": "NarratedUmmSalama:NarratedUmmSalama (rad):\nAllah’s Messenger (saw) said, “He who drinks in a silver utensil is only swallowing Hell-fire in his stomach”. [Agreed Upon]"
        },
        {
          "body": "UmmSalamah narrated that the Prophet (s.a.w) mentioned the army that the earth would swallow, soUmmSalamah said:'Perhaps there are those among them who are averse to it.\" He said: \"They will be resurrected on their intentions.\""
        },
        {
          "body": "It was narrated from 'Irak bin Malik that Zainab bint Abi Salamah told him, thatUmmHabibah said to the Messenger of Allah:\"We have been saying that you want to marry Durrah bint Abi Salamah.\" The Messenger of Allah said: \"As a co-wife toUmmSalamah? Even if I were not married toUmmSalamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "Narrated Anas (RA):The Prophet (SAW) appointed IbnUmmMaktum (RA) to lead the people in prayer in his absence and he [IbnUmmMaktum (RA)] was blind.\n\n[Reported by Ahmad and Abu Dawud]."
        },
        {
          "body": "Umm'Atiyya reported:We washed her an odd number of times, i. e. three, five or seven times; andUmm'Atiyya (further) said: We braided her hair in three plaits."
        },
        {
          "body": "NarratedUmmSharik:that the Messenger of Allah (SAW) said: \"The people will flee from the Dajjal such that they will go to the mountains.\"UmmSharik said: \"O Messenger of Allah! Where will the Arabs be that day?\" He said: \"They will be few.\""
        },
        {
          "body": "UmmSalama told howUmmSulaim said, \"Messenger of God, God is not ashamed of the truth. Is any washing necessary for a woman when she has a sexual dream?” He replied, \"Yes, when she sees signs of liquid.”UmmSalama then covered her face and said, \"Messenger of God, does a woman have sexual dreams?” He replied, \"Of course she does. In what way does her child resemble her?” \n\n(Bukhari and Muslim.) Muslim added in the version ofUmmSulaim, \"The man’s liquid is coarse and white, the woman’s fine and yellow, so the resemblance comes from the one which prevails or comes first.”"
        },
        {
          "body": "Abu Murra, the freed slave ofUmmHani, daughter of Abu Talib, reportedUmmHani to be saying:I went to the Messenger of Allah (may peace be upon him) on the day of the Conquest of Mecca and found him taking a bath, and Fatimah, his daughter, had provided him privacy with the help of a cloth. I gave him salutation and he said: Who is she? I said: It isUmmHani, daughter of Abu Talib. He (the Holy Prophet) said: Greeting forUmmHani. When he had completed the bath, he stood up and observed eight rak'ahs wrapped up in one cloth. When he turned back (after the prayer), I said to him: Messenger of Allah, the son of my mother 'Ali b. Abu Talib is going to kill a person, Fulan b. Hubaira whom I have given protection. Upon this the Messenger of Allah (may peace be upon him) said: We too have given protection whom you have given protection, OUmmHani.UmmHani said: It was the forenoon (prayer)."
        },
        {
          "body": "Narrated Sa'd ibn Ubadah:Sa'd asked: Messenger of Allah,UmmSa'd has died; what form of sadaqah is best? He replied: Water (is best). He dug a well and said: It is forUmmSa'd."
        },
        {
          "body": "It was\nnarrated thatUmmSalamah said:“The Prophet (saw) was\nperforming\nprayer in the house ofUmmSalamah, and ‘Abdullah or ‘Umar\nbin\nAbu Salamah passed in front of him; he gestured his hand, and he\nwent\nback. Then Zainab bintUmmSalamah passed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "NarratedUmmHani:\"The Messenger of Allah (saws) arrived in Makkah, and he had four braids.\"[Abu 'Eisa said:] This Hadith is Gharib. Muhammad said: \"I do not know of Mujahid (a narrator) hearing fromUmmHani.\""
        },
        {
          "body": "NarratedUmmal-Ala:The Messenger of Allah (saws) visited me while I was sick. He said: Be glad,Ummal-Ala' for Allah removes the sins of a Muslim for his illness as fire removes the dross of gold and silver."
        },
        {
          "body": "Ibn Shawwal (the freed slave ofUmmHabiba) reported that he went toUmmHabiba (the wife of Allah's Apostle) who informed him that Allah's Apostle (may peace be upon him) sent her from Muzdalifa during the night."
        },
        {
          "body": "'Umm'Atiyyah has narrated this tradition through a different chain of transmitters.Abu DAwud said:The name ofUmmal-Hudhail is Hafsah daughter os Sirin. The name of her son was Hudhail and his husband 'Abd al-Rahman."
        },
        {
          "body": "Anas b. Malik reported:UmmSulaim who was the grandmother of Ishaq came to the Messenger of Allah (may peace be upon him) in the presence of 'A'isha and said to him: Messenger of Allah, in case or woman sees what a man sees in dream and she experiences in dream what a man experiences (i. e. experiences orgasm)? Upon this 'A'isha remarked: OUmmSulaim, you brought humiliation to women;may your right hand be covered with dust. He (the Holy Prophet) said to 'A'isha: Let your hand be covered with dust, and (addressingUmmSulaim) said: Well, OUmmSulaim, she should take a bath if she sees that (i. e. she experiences orgasm in dream)."
        },
        {
          "body": "'A'isha reported:They (some Companions of the Holy Prophet) were conversing with one another in the presence of the Messenger of Allah (may peace be upon him) (during his last) illness.UmmSalama andUmmHabiba made a mention of the church and then (the hadith was) narrated."
        },
        {
          "body": "UmmHani (May Allah be pleased with her) reported:I went to the Prophet (PBUH) who was taking a bath while Fatimah was screening him. He asked, \"Who is there?\" I replied: \"I amUmmHani.\"[Al- Bukhari and Muslim]."
        },
        {
          "body": "Narrated Abu Hurairah:That the Messenger of Allah (saws) said: \"The angels do no accompany a group among whom there is a dog or a bell.\"[Abu 'Eisa said:] There are narrations on this topic from Ibn 'Umar,UmmHabibah, andUmmSalamah. This Hadith is Hasan Sahih."
        },
        {
          "body": "Sa‘d b. ‘Ubada told God’s messenger thatUmmSa'd had died and asked him what form ofsadaqawas best. When he replied that water was best, he dug a well and said it was forUmmSa'd. \n\nAbu Dawud and Nasa’i transmitted it."
        },
        {
          "body": "Umm'Atiyya reported that the Messenger of Allah (may peace be upon him) took pledge from us (including this promise) that we would not lament. Only five amongst us fulfilled the promise, and one of them (who fulfilled the promise) wasUmmSulaim."
        },
        {
          "body": "Abdur-Rahman bin Awf'sUmmWalad said, :\"I said toUmmSalamah: 'Indeed I am a woman with lengthy hems, and I walk in places of filth.' So she said: 'Allah's Messenger said: \"It is purified by what comes after it.\""
        },
        {
          "body": "Anas b. Malik said; the prophet (may peace be upon him) used to visitUmmSulaim. Sometimes the time for prayer would come and he would pray on out carpet that was really a mat. She (UmmSulaim) used to wash it with water."
        },
        {
          "body": "It was narrated from Zainab, the daughter ofUmmSalamah, that :Her motherUmmSalamah said: \"UmmSulaim came to the Prophet and asked him about a woman who sees in her dream something like a man sees. He said: 'Yes, if she sees water (discharge), let her take a bath.' I said: 'You have embarrassed the women. Do women experience wet dreams?' The Prophet said: 'May your hands be rubbed with dust, how else does her child resemble her?'\""
        },
        {
          "body": "It was narrated from Zainab bintUmmSalamah, thatUmmSalamah andUmmHabibah said:\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\""
        },
        {
          "body": "It was narrated thatUmmSalamah said:“The Prophet (saw) mentioned\nthe army that would be swallowed up by the earth, andUmmSalamah\nsaid: ‘O Messenger of Allah, perhaps there will be some among them\nwho were forced (to join them)?’ He said: ‘They will be\nresurrected according to their intentions.’”"
        },
        {
          "body": "It was narrated fromUmmSalamah that:She mentioned women's hems to the Messenger of Allah [SAW], and the Messenger of Allah [SAW] said: \"Let it down a hand span.\"UmmSalamah said: \"But that will uncover (her feet).\" He said: \"Let it down a forearm's length, but no more than that.\""
        },
        {
          "body": "NarratedUmmUmarah:Habib al-Ansari reported: I heard Abbad ibn Tamim who reported on the authority of my grandmother,UmmUmarah, saying: The Prophet (saws) wanted to perform ablution. A vessel containing 2/3 mudd of water was brought to him."
        },
        {
          "body": "NarratedUmmHabibah:Mu'awiyah ibn AbuSufyan asked his sisterUmmHabibah, the wife of the Prophet (saws): Would the apostle of Allah (saws) pray in the clothe in which he had an intercourse? She said: Yes, when he would not see any impurity in it."
        },
        {
          "body": "NarratedUmmSalamah:\"The Prophet (saws) slackened Fatimah's garment a hand-span.\"[Abu 'Eisa said:] Some of them reported it from Hammad bin Salamah, from 'Ali bin Zaid, from Al-Hasan, from his father, fromUmmSalamah."
        },
        {
          "body": "UmmHani', the daughter of Abu Talib, said, \"I went to the Prophet,\nmay Allah bless him and grant him peace, while he was performing a major\nablution. I greeted him and he asked, 'Who is this?' 'UmmHani',' I replied.\nHe said, 'Welcome.'\""
        },
        {
          "body": "Anas ibn Malik said:\"The Prophet (Allah bless him and give him peace) entered the presence ofUmmSulaim, and a waterskin was suspended there, so he drank from the mouth of the waterskin while standing.UmmSulaim therefore reached up to the head of the waterskin and cut it loose.”"
        },
        {
          "body": "UmmSalama reported:UmmSulaim went to the Apostle of Allah (may peace be upon him) and said: Apostle of Allah, Allah is not ashamed of the truth. Is bathing necessary for a woman when she has a sexual dream? Upon this the Messenger of Allah (may peace be upon him) said: Yes, when she sees the liquid (vaginal secretion).UmmSalama said: Messenger of Allah, does a woman have sexual dream? He (the Holy Prophet) said: Let your hand be covered with dust, in what way does her child resemble her?"
        },
        {
          "body": "It was narrated from Humaid bin Nafi' that:he heard Zainab the daughter ofUmmSalamah narrating that she heardUmmSalamah andUmmHabibah mention that a woman came to the Prophet (SAW) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (SAW) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\""
        },
        {
          "body": "NarratedUmmKhalid, daughter of Sa'd b. al-'As:Once the Messenger of Allah (saws) was brought some garments among which was a small cloak with a border and black stripes. He said: Whom do you think to be more deserving for it ? The people kept silence. He said: BringUmmKhalid. The she was carried to him and he put it on her, saying: Wear it out and make it ragged twice. Then he went on looking at red or yellow marks on it, and said: This is sanah, sanah,UmmKhalid. It means \"beautiful\" in the language of the Abyssinians."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Kabshah, daughter of AbuMaryam, askedUmmSalamah (Allah be pleased with her): What did the Prophet (saws) prohibit? She replied: He forbade us to boil dates so much so that the kernels are spoiled, and to mix raisins and dried dates."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:I was with the Messenger of Allah (saws) while Maymunah was with him. Then IbnUmmMaktum came. This happened when we were ordered to observe veil (purdah). The Prophet (saws) said: Observe veil from him. We asked: Messenger of Allah! is he not blind? He can neither see us nor recognise us. The Prophet (saws) said: Are both of you blind? Do you not see him? AbuDawud said: This was peculiar to the wives of the Prophet (saws). Do you not see that Fatimah daughter of Qays passed her waiting period with IbnUmmMaktum. The Prophet (saws) said to Fatimah daughter of Qays: Pass your waiting period with IbnUmmMaktum, for he is a blind man. You can put off your clothes with him."
        },
        {
          "body": "Simak bin Harb narrated:\"A person from the offspring ofUmmHani narrated to me - I met one of the most virtuous among them, and his name was Ja'dah, andUmmHani was his grandmother - he narrated to me from his grandmother that the Messenger of Allah entered upon her and asked for some drink, and he drank. Then he offered it to her and she drank it. Then she said: \"O Messenger of Allah! I was fasting.\" So the Messenger of Allah said: \"The one fasting a voluntary fast is the trustee for himself; if he wishes he fasts, and if he wishes he breaks.\" Shu'bah (one of the narrators) said: \"I said to him (Ja'dah), 'Did you hear this fromUmmHani?' He said: 'No Abu Salih and our family informed us of it fromUmmHani.'\""
        },
        {
          "body": "NarratedUmmSalam (rad):UmmSulaim, the wife Abu Talha said, “O Allah’s Messenger! Allah is not ashamed of the truth. Is a Ghusl (bath) compulsory for a woman when she has a sexual dream?” He (saw) replied, “Yes! When she sees signs of liquid” [Agreed upon]."
        },
        {
          "body": "NarratedUmmSalamah (RA):She asked the Prophet (SAW), \"Can a woman pray in a long dress and a veil without wearing a lower garment?\" He replied, \"If the long dress is ample and covers the surface of her feet.\"\n\n[Reported by Abu Dawud and the Imams graded it Mawquf (a saying ofUmmSalamah)]."
        },
        {
          "body": "NarratedUmmFarwah:The Messenger of Allah (saws) was asked: Which of the actions is best? He replied: Observing prayer early in its period.Al-Khuza'i narrated in his version from his aunt namedUmmFarwah who took the oath of allegiance to the Prophet (saws): He was questioned."
        },
        {
          "body": "UmmSharik reported that she consulted Allah's Apostle (may peace be upon him) in regard to killing of geckos, and he commanded to kill them andUmmSharik is one of the women of Bani 'Amir b. Luwayy. This hadith has been reported through another chain of transmitters with the same meaning."
        },
        {
          "body": "NarratedUmmHani:On the days of the  conquest of Mecca, when Mecca was captured, Fatimah came and sat on the left side of the Messenger of Allah (saws), andUmmHani was on his right side. A slave-girl brought a vessel which contained some drink; she gave it to him and he drank of it. He then gave it toUmmHani who drank of it. She said: Messenger of Allah, I have broken my fast; I was fasting. He said to her: Were you making atonement for something? She replied: No. He said: Then it does not harm you if it was voluntary (fast)."
        },
        {
          "body": "Anas said:The Messenger of Allah (may peace be upon him) entered uponUmmHaram. The people (in her house) brought some cooking oil dates to him. He said; Put it (dates) back in its container and return it (cooking oil) to its bag, because I am keeping fast. He then stood and led us in prayer two Rak’ahs of supererogatory prayer. ThenUmmSulaim andUmmHaram stood behind us (i.e., the men). Thabit (the narrator) said: I understand that Anas said; he (the prophet) made me stand on his right side."
        },
        {
          "body": "UmmSalama said that she asked God's Messenger whether a woman might pray in a shift and veil without wearing a lower garment. He replied, “If the shift is ample and covers the surface of her feet.” \n\nAbu Dawud transmitted it and he mentioned a number who did not trace it beyondUmmSalama."
        },
        {
          "body": "It was narrated fromUmmSalamah that:When the Prophet [SAW] said what he said about the Izar,UmmSalamah said: \"What about women?\" He said: \"Let it down a hand span.\" She said: \"But then their feet will show.\" He said: \"Then (let it down) a forearm's length, but no more than that.\""
        },
        {
          "body": "It was narrated that Zainab bintUmmSalamah said:\"UmmHabibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\""
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Hunaydah al-Khuza'i reported on the authority of her mother who said: I entered uponUmmSalamah and asked her about fasting. She said: The Messenger of Allah (saws) used to command me to fast three days every month beginning with Monday or Thursday."
        },
        {
          "body": "UmmSalim said, \"While I was with the Prophet, may Allah bless him and\ngrant him peace, he said, 'UmmSalim! There is no Muslim couple who have\nthree of their children die without Allah admitting them to the Garden by\nvirtue of His mercy to them.' I said, 'And if there are two?' He said, 'And\nif there are two.'\""
        },
        {
          "body": "It was narrated thatUmm'Atiyyah said:\"We did not think anything of the yellowish or brownish discharge.\" (Sahih)\n\n(Another chain) It was narrated thatUmm'Atiyyah said: \"We did not think that the yellowish or brownish discharge counted for anything.\"\n\nMuhammad bin Yahya said: \"Wuhaib (who narrated the second version) is the better of them with this according to us.\""
        },
        {
          "body": "Anas b. Malik reported that there was an orphan girl withUmmSulaim (who was the mother of Anas). Allah's Messenger (may peace be upon him) saw that orphan girl and said:O, it is you; you have grown young. May you not advance in years! That slave-girl returned toUmmSulaim weeping.UmmSulaim said: O daughter, what is the matter with you? She said: Allah's Apostle (may peace be upon him) has invoked curse upon me that I should not grow in age and thus I would never grow in age, or she said, in my (length) of life.UmmSulaim went out wrapping her head-dress hurriedly until she met Allah's Messenger (may peace be upon him). He said to her:UmmSulaim, what is the matter with you? She said: Allah's Apostle, you invoked curse upon my orphan girl. He said:UmmSulaim, what is that? She said: She (the orphan girl) states you have cursed her saying that she might not grow in age or grow in life. Allah's Messenger (may peace be upon him) smiled and then said:UmmSulaim, don't you know that I have made this term with my Lord. And the term with my Lord is that I said to Him: 1 am a human being and I am pleased just as a human being is pleased and I lose temper just as a human being loses temper, so for any person from amongst my Ummah whom I curse and he in no way deserves it, let that, O Lord, be made a source of purification and purity and nearness to (Allah) on the Day of Resurrection."
        },
        {
          "body": "Narrated Anas bin Malik:Allah's Apostle used to visitUmmHaram bint Milhan, who would offer him meals.UmmHaram was the \nwife of Ubada bin As-Samit. Allah's Apostle, once visited her and she provided him with food and \nstarted looking for lice in his head. Then Allah's Apostle slept, and afterwards woke up smiling.UmmHaram asked, \"What causes you to smile, O Allah's Apostle?\" He said. \"Some of my followers who (in \na dream) were presented before me as fighters in Allah's cause (on board a ship) amidst this sea caused \nme to smile; they were as kings on the thrones (or like kings on the thrones).\" (Ishaq, a sub-narrator is \nnot sure as to which expression the Prophet used.)UmmHaram said, \"O Allah's Apostle! Invoke Allah \nthat he makes me one of them. Allah's Apostle invoked Allah for her and slept again and woke up \nsmiling. Once againUmmHaram asked, \"What makes you smile, O Allah's Apostle?\" He replied, \n\"Some of my followers were presented to me as fighters in Allah's Cause,\" repeating the same dream.UmmHaram said, \"O Allah's Apostle! Invoke Allah that He makes me one of them.\" He said, \"You are \namongst the first ones.\" It happened that she sailed on the sea during the Caliphate of Mu'awiya bin \nAbi Sufyan, and after she disembarked, she fell down from her riding animal and died."
        },
        {
          "body": "There is a similar narration fromUmmAtiyyah :with another chain."
        },
        {
          "body": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar\nibn Ubaydullah, that Abu Murra, the mawla of Aqil ibn Abi Talib, told\nhim that he had heardUmmHani bint Abi Talib say, \"I went to the\nMessenger of Allah, may Allah bless him and grant him peace, in the\nyear of the conquest and found him doing ghusl while his daughter\nFatima, was screening him with a garment. I said to him, 'Peace be\nupon you' and he said, 'Who is that?' I replied, 'UmmHani bint Abi\nTalib,' and he said, 'Welcome,UmmHani!'  When he had finished his\nghusl, he stood and prayed eight rakas, covering himself with one\ngarment, and then came away. I said, 'Messenger of Allah, the son of\nmy mother, AIi, says that he is determined to kill so-and-so, son of\nHubayra, a man I have placed under my protection.'  The Messenger of\nAllah, may Allah bless him and grant him peace, said, 'We give\nprotection to whoever you have given protection to,UmmHani.' \"UmmHani related that this incident happened in the morning."
        },
        {
          "body": "Malik said in the case of anummwalad who injured someone, \"The\nblood-money of that injury is the responsibility of her master from\nhis property, unless the blood-money of the injury is greater than the\nvalue of theummwalad. Her master does not have to pay more than her\nvalue. That is because when the master of a slave or slave-girl\nsurrenders his slave or slave-girl for an injury which one of them has\ndone, he does not owe any more than that, even if the blood-money is\ngreater. As the master of theummwalad cannot surrender her because\nof the precedent of the sunna, when he pays her price, it is as if he\nhad surrendered her. He does not have to pay more than that. This is\nthe best of what I have heard about the matter. The master is not\nobliged to assume responsibility for more than anummwalad's value\nbecause of her criminal action.\""
        },
        {
          "body": "NarratedUmmHani' bint Abi Talib:\"The Messenger of Allah (saws) entered upon me and said: 'Do you have anything?' I said: 'No, except a piece of hard bread and vinegar.' so he said: 'Bring it, for a house that has vinegar is not impoverished of condiments.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib from this route. We do not know of it as a Hadith ofUmmHani' except through this route. Abu Hamzah Ath-Thumali's (a narrator in the chain) name is Thabit bin Abi Safiyyah. AndUmmHani' died some time after 'Ali bin Abi Talib. I asked Muhammad about this Hadith. He said: \"I do not know Ash-Sha'bi hearing fromUmmHani'.\" So I said: \"How is Abu Hamzah according to you?\" He said: \"Ahmad bin Hanbal criticized him, but he is Muqarib (average) in Hadith to me.\""
        },
        {
          "body": "Anas reported thatUmmHaritha, the sister of Rubayyi' (she was the father's sister of Hadrat Anas) injured a person (she broke his teeth). The dispute was referred to Allah's Apostle (may peace be upon him). Allah's Messenger (may peace be upon him) said:Retribution, retribution.UmmRubayyi' said: Messenger of Allah, will retribution be taken from so and so? By Allah, it shall not be taken from her (i. e. fromUmmHaritha). Thereupon Allah's Apostle said: Hallowed be Allah. OUmmRubayyi', Qisas (retribution is a command, prescribed) in the Book of Allah. She said: No, by Allah, Qisas will never be taken from her; and she went on saying this until they (the relatives of the one who had been injured) accepted the blood-wit. Thereupon Allah's Messenger (may peace be upon him) said: Verily there are amongst the servants of Allah (such pious persons) who, if they take oath of Allah, He honours it."
        },
        {
          "body": "Narrated Nabhan the freed slave ofUmmSalamah:to Ibn Shihab, thatUmmSalamah narrated to him, that she and Maimunah were with the Messenger of Allah (SAW), she said: \"So when we were with him, IbnUmmMaktum came, and he entered upon him, and that was after veiling had been ordered for us. So the Messenger of Allah (SAW) said: 'Veil yourselves from him.' So I said: 'O Messenger of Allah! Is he not blind such that he can not see us or recognize us?' So the Messenger of Allah (SAW) said: 'Are you two blind such that you can not see him?'\""
        },
        {
          "body": "UmmSalamah said that she asked the prophet (may peace be upon him); Can a woman pray in a shirt and veil without wearing a lower garment? He replied:if the shirt is ample and covers the surface of her feet.Abu Dawud said: This tradition has been transmitted by Malik b. Anas, Bakr b. Mudar, Hafs b. Ghiyaht, Isma'il b. Ja'far, Ibn Abu Dhi'b, and Ibn Ishaq from Muhammad b. Zaid on the authority of his mother who narrated fromUmmSalamah. None of these narrators mention the name of the Prophet (saws). They reported it directly fromUmmSalamah."
        },
        {
          "body": "Safiyyah, daughter of AbuUbayd, said:When the Messenger of Allah (saws) mentioned lower garment,UmmSalamah, wife of the Messenger of Allah (saws), asked him: And a woman, Messenger of Allah? He replied: She may hang down a span.UmmSalamah said: Still it (foot) will be uncovered. He said: Then a forearm's length, nor exceeding it."
        },
        {
          "body": "Ummal-Fadl stated that God’s Prophet said, “Being suckled once or twice does not make marriage unlawful.” In ‘A’isha’s version he said, “One or two sucks do not make marriage unlawful.” In another byUmmal-Fadl he said, “One suckling or two does not make marriage unlawful.” \n\nThese are versions by Muslim."
        },
        {
          "body": "It was\nnarrated thatUmm‘Atiyyah said:“The Messenger of Allah (saw)\ncommanded us to bring them (the women) out on the day of Fitr and the\nday of Nahr.”Umm‘Atiyyah said: “We said: ‘What if one of\nthem does\nnot have an outer covering?’ He said: ‘Let her sister\nshare her own\nouter covering with her.’”"
        },
        {
          "body": "It was narrated from HIsham bin Urwah, from his father, fromUmmSalamah, that she said:\"O Messenger of Allah, by Allah! I have not performed the Farewell Tawaf.\" The Prophet said: \"When the Iqamah is said for prayer, perform Tawaf on your camel behind the people.\" Urwah did not hear fromUmmSalamah."
        },
        {
          "body": "It was narrated that Anas said:\"Abu Talhah marriedUmmSulaim and the dowry between them was Islam.UmmSulaim became Muslim before Abu Talhah, and he proposed to her but she said: 'I have become Muslim; if you become Muslim I will marry you.' So he became Muslim, and that was the dowry between them.\""
        },
        {
          "body": "It was narrated thatUmmMoosa said:`Uthman was the most handsome of people."
        },
        {
          "body": "'A’isha andUmmSalamah (RAA) narrated, The Messenger of Allah (P.B.U.H.) would rise in the morning (when it is already Fajr time) while he was Junub (in a state of major ritual impurity due to intercourse) on a day in Ramadan. He would then perform Ghusl and fast. Agreed upon. In the narration of Muslim on the authority ofUmmSalamah, ‘And he would not make up for it (that day).’"
        },
        {
          "body": "UmmSalama said:I was with God’s Messenger along with Maimuna when IbnUmmMaktum approached and came in to visit him, so he told us to veil ourselves. I said, \"Messenger of God, is he not blind and unable to see us?” He replied, \"Are you blind and unable to see him?” \n\nAhmad, Tirmidhi and Abu Dawud transmitted it."
        },
        {
          "body": "A hadith like this has been transmitted by Hafsa on the authority ofUmm'Atiyya with the exception (of these words that the Holy Prophet asked them to wash her dead body):\" three times, five times, seven times, or more than that, if you deem fit:\" Hafsa (further) said on the authority ofUmm'Atiyya: We braided (the hair) of her head in three plaits."
        },
        {
          "body": "Ummal-Fadl (Allah be pleased with her) is reported to have said that some people among the Companions of the Messenger of Allah (may peace be upon him) were in doubt about fasting on the day of 'Arafa and we were with him on that day. I (Ummal-Fadl) sent him a cup of milk and he was halting at 'Arafa, and he drank that."
        },
        {
          "body": "It was narrated thatUmmSubyah Al-Juhaniyyah said:\"Often my hand would touch the hand of the Messenger of Allah while performing ablution from a single vessel.\" (Hasan)\n\nAbu `Abdullah bin Majah said: \"I heard Muhammad say: 'UmmSubyah was Khawlah bint Qais. I mentioned that to Abu Zur`ah and he said: \"It is true.\""
        },
        {
          "body": "It was narrated from Abdullah bin Abi Qatadah that his father said:\"The Messenger of Allah (SAW) used to recite theUmmAl-Quran and two surahs in the first two rak'ahs of Zuhr and 'Asr, and in the last two withUmmAl-Quran, and he would make us hear a verse sometimes, and he used to make the first rak'ah lengthy.\""
        },
        {
          "body": "It was narrated fromUmmHabibah-and when this was narrated to Sa'eed fromUmmHabibah from the Prophet (SAW), he would approve it and not deny it but when he narrated it to us, he did not attribute it to the Prophet (SAW)- she said:\"Whoever prays four rak'ahs before Zuhr and four after it, Allah (SWT) will forbid him from the Fire.\""
        },
        {
          "body": "It was narrated from Urwah from Zainab bintUmmSalamab, fromUmmSalamah, that:she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\""
        },
        {
          "body": "NarratedUmmHabibah daughter of Jahsh:Ikrimah said:UmmHabibah daughter of Jahsh had a prolonged flow of blood. The Prophet (saws) commanded her to refrain (from prayer) during her menstrual period; then she should wash and pray, if she sees anything (which renders ablution void) she should perform ablution and pray."
        },
        {
          "body": "NarratedUmmSalamah, Ummul Mu'minin:Al-Hasan reported on the authority of his mother that she wasUmmSalamah pouring water on the urine of the male child until the age when he did not eat food. When he began to eat food, she would wash (his urine). And she would wash the urine of the female child."
        },
        {
          "body": "UmmSulaim Al Rumaisa said “The Prophet(saws) slept and awoke while she was washing her head.” He awoke laughing. She asked “Apostle of Allaah(saws) are you laughing at my head?” He replied, No. She then narrated the rest of the tradition enlarging and reducing.Abu Dawud said:Al-Rumaisa was the foster sister ofUmmSulaim."
        },
        {
          "body": "Anas said “A beautiful slave girl fell to Dihyah”. The Apostle of Allaah(saws) purchased her for seven slaves. He then gave her toUmmSulaim for decorating her and preparing her for marriage. The narrator Hammad said, I think he said “Safiyyah daughter of Huyayy should pass her waiting period in her (UmmSulaims’) house.”"
        },
        {
          "body": "Kuraib said that Ibn ‘Abbas, al-Miswar b. Makhrama and ‘Abd ar-Rahman b. al-Azhar sent him to ‘A’isha telling him to give her their greetings and ask her about the tworak'asafter the afternoon prayer. He said that when he went to visit her and conveyed their message she told him to askUmmSalama, so he came out to them and they sent him back toUmmSalama who said :I heard the Prophet prohibiting them and afterwards saw him praying them. When he came in I sent the slavegirl to him telling her to say thatUmmSalama sent this query, “Messenger of God, I heard you prohibiting these two, and I see you praying them.” He replied, “Daughter of Abu Umayya,* you have asked about the tworak'asafter the afternoon prayer. Some people of ‘Abd Qais came and hindered me from praying the tworak'aswhich come after the noon prayer, so those are the two I have been praying.”\n\n* Abu Umayya wasUmmSalama’s father. Although the slavegirl conveyed the query, the reply is given as if addressed directly toUmmSalama.\n\n(Bukhari and Muslim)"
        },
        {
          "body": "Umm'Atiyya reported:We braided her hair in three plaits."
        },
        {
          "body": "NarratedUmm'Atiyyah :The Messenger of Allah (saws) prohibited us to wail."
        },
        {
          "body": "Narrated 'Aishah:\"The people used to give their gifts [to the Prophet (SAW)] on 'Aishah's day.\" She said: \"So my companions gathered withUmmSalamah and they said 'OUmmSalamah! The people give their gifts on 'Aishah's day, and we desire good as 'Aishah desires, so tell the Messenger of Allah (SAW) to order the people to give (their gifts to) him no matter where he is.' SoUmmSalamah said that, and he turned away from her. Then he turned back to her and she repeated the words saying: 'O Messenger of Allah! My companions have mentioned that the people give their gifts on 'Aishah's day, so order the people to give them no matter where you are.' So upon the third time she said that, he said: 'OUmmSalamah! Do not bother me about 'Aishah! For Revelation has not been sent down upon me while I was under the blankets of a woman among you other than her.'\""
        },
        {
          "body": "Ibn ‘Umar reported God’s Messenger as saying, “Bilal summons to prayer when it is still night, so eat and drink till IbnUmmMaktum makes the summons.” He added that IbnUmmMaktum was a blind man who did not make the summons till someone said to him, “The morning has come, the morning has come.” \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "UmmSalama reported that the Prophet, may Allah bless him and grant\nhim peace, was in his house and called for a slave of his (or hers) and\nshe was slow in coming. The anger showed in his face.UmmSalama went to\nthe curtain and found the slavegirl playing. He had a siwak-stick with\nhim and said, '\"Were it not that I fear retaliation on the Day of Rising\nwith this siwak.\""
        },
        {
          "body": "It was\nnarrated from Ayyub who said:“Hafsah narrated to me, fromUmm‘Atiyyah” and it is similar to the Hadith of Muhammad. And in the\nnarration of Hafsah it says: “Wash her an odd number of times.”\nAnd:\n“Wash her face three or five times.” And “Start on her\nright, with the\nplaces washed in ablution.” And it says thatUmm‘Atiyyah said: “And\nwe combed her hair into three braids.”"
        },
        {
          "body": "It was narrated from Anas bin Malik that:The Prophet [SAW] lay down on a leather mat and sweated.UmmSulaim got up and collected his sweat and put it in a bottle. The Prophet [SAW] saw her and said: \"What are you doing OUmmSulaim?\" She said: \"I am putting your sweat in my perfume.\" And the Prophet [SAW] smiled."
        },
        {
          "body": "It was narrated fromUmmHani' that she went to the Prophet (PBUH) on the day of the Conquest (of Makkah) and found him performing Ghusl while Fatimah was concealing him with a garment. She gave him Salams and he said:\"Who is this?\" She said: \"UmmHani'.\" When he had finished his Ghusl he stood up and prayed eight Rak'ahs wrapped in a garment."
        },
        {
          "body": "It was narrated from 'Aishah thatUmmHabibah andUmmSalamah mentioned a church that they had seen in Ethiopia, in which there were images. The Messenger of Allah (PBUH) said:\"Those people, if there was a righteous man among them, when he died they built a place of worship over his grave and made those images. They will be the most evil of creation before Allah on the Day of Resurrection.\""
        },
        {
          "body": "It was narrated from Anas that:the sister of Ar-Rubai'UmmHarithah injured  a person and they referred the dispute to the Messenger of Allah. The Messenger of Allah said: \"Retaliation, retaliation (Qisas).\"UmmAr-Rabi said: 'O Messenger of Allah, how could retaliation be carried out against so and so? No, by Allah, retaliation willnever be carried out against her!' The Messenger of Allah said: \"Subhan Allah, OUmmAr-Rabi'! decreed by Allah.\" She said: \"No, by Allah, retaliation will never be carried out against her!\" And she carried on until they accepted Diyah (blood money). He (the prophet) said: \"There are among the slaves of Allah who, if they swear by Allah, Allah fulfills their oath."
        }
      ]
    }
  ]
}