{
  "data": [
    {
      "hadith": [
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbu Salama that she sawZaynabbintJahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray."
        },
        {
          "body": "This hadith has been narrated on the authority ofZainabbintJahsh with a slight variation in the chain of transmitters."
        },
        {
          "body": "Muhammad ibn 'Ata' related that he visitedZaynabbintSalama and\nshe asked him about the name of one of his sisters. He reports:\"I said,\n'Her name is Barra.' She said, 'Change her name. The Prophet, may Allah\nbless him and grant him peace, marriedZaynabbintJahsh. Her name was\nBarra and he changed it toZaynab. I visited Umm Salama when she married\nhim and my name was Barra. He heard her call me Barra and said, 'Do not\nadorn yourselves. Allah is the One who knows those who are pious (barra)\namong you and those who are deviant. Call herZaynab.' Umm Salama said,\n'She isZaynab.' I said toZaynab, 'Give her a name.'Zaynabsaid, 'Change\nit to what the Messenger of Allah, may Allah bless him and grant him peace,\nchanged it.'\" So he called herZaynab."
        },
        {
          "body": "It was narrated fromZainabbintJahsh that :She had a tub of brass. She said: \"I used to comb the hair of the Messenger of Allah in it.\""
        },
        {
          "body": "NarratedZainabbintJahsh:That the Prophet once came to her in a state of fear and said, \"None has the right to be worshipped but \nAllah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall \nof Gog and Magog like this,\" making a circle with his thumb and index finger.ZainabbintJahsh said, \n\"O Allah's Apostle! Shall we be destroyed even though there are pious persons among us?\" He said, \n\"Yes, when the evil person will increase.\""
        },
        {
          "body": "Narrated Thabit:The marriage ofZainabbintJahash was mentioned in the presence of Anas and he said, \"I did not see \nthe Prophet giving a better banquet on marrying any of his wives than the one he gave on marryingZainab. He then gave a banquet with one sheep.\""
        },
        {
          "body": "It was\nnarrated fromZainabbintUmm Salamah that her mother said\nthat her\nbed was in front of the place where the Messenger of Allah\n(saw)\nprostrated."
        },
        {
          "body": "NarratedZainabbintJahsh:That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index \nfinger and thumb.ZainabbintJahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) \nincreased.\""
        },
        {
          "body": "ZainabbintUmm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "Narrated Anas bin Malik:The Verse: 'But you did hide in your mind that which Allah was about to make manifest.' (33.37) \nwas revealed concerningZainabbintJahsh and Zaid bin Haritha."
        },
        {
          "body": "Anas bin Malik said:ZainabbintJahsh used to boast to the other wives of the Prophet and say: \"Allah married me to him from above the Heavens.\" And the Verse of Hijab was revealed concerning her."
        },
        {
          "body": "NarratedZainabbintSalama:Um Habiba said to Allah's Apostle \"We have heard that you want to marry DurrabintAbu-Salama.\" \nAllah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not \nmarried Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\""
        },
        {
          "body": "Yahya related to me from Muhammad ibn alMunkadir that Rabia ibn\nAbdullah ibn alHadir told him that he had seen Umar ibn al-Khattab\nleading people in front of the bier at the funeral ofZaynabbintJahsh."
        },
        {
          "body": "It was narrated from 'Irak bin Malik thatZainabbintAbi Salamah told him, that Umm Habibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbi Salamah.\" The Messenger of Allah said: \"As a co-wife to Umm Salamah? Even if I were not married to Umm Salamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "Zainabfurther said:I want toZainabbintJahsh when her brother died. She \nasked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have \nheard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the \nlast day to mourn for more than three days except for her husband for whom she should mourn for \nfour months and ten days.'\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"Umm HabibahbintJahsh- the wife of 'Abdur-Rahman bin 'Awf and the sister ofZainabbintJahsh - suffered Istihadah (non-mentrual vaginal bleeding).\" She said: \"She consulted the Messenger of Allah (PBUH) and the Messenger of Allah (PBUH) said to her: 'That is not menstruation, rather that is a vein. When you period goes, perform Ghusl and pray, and when it comes, stop praying (for that period).'\" 'Aishah said: \"She used to perform Ghusl for every prayer and pray. Sometimes she would perform Ghusl in a washtub in the room of her sisterZainabwhen she was with the Messenger of Allah (PBUH) and the water would turn red with blood, then she would go out and pray with the Messenger of Allah (PBUH). That did not stop her from praying.\""
        },
        {
          "body": "NarratedZainabbintUm Salama:When Um HabibabintAbi Sufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\""
        },
        {
          "body": "It was narrated thatZainabbintJahsh said:“The Messenger of\nAllah\n(saw) woke up red in the face and said: ‘La ilaha illallah,\nwoe to the\nArabs from an evil that has drawn nigh. Today a hole has\nbeen opened\nin the barrier of Gog and Magog.’ And he gestured to\nindicate the size\nof the hole.”Zainabsaid: “I said: ‘O\nMessenger of Allah! Will we be\ndestroyed when there are righteous\npeople among us?’ He said: ‘If sin\nand evil deeds increase.’”"
        },
        {
          "body": "NarratedZainabbintJahsh:That the Prophet came to her in a state of fear saying, \"None has the right to be worshiped but Allah! \nWoe to the Arabs because of evil that has come near. Today a hole has been made in the wall of Gog \nand Magog as large as this.\" pointing with two of his fingers making a circle.Zainabsaid, \"I said, 'O \nAllah's Apostle! Shall we be destroyed though amongst us there are pious people? ' He said, 'Yes, if \nevil increases.\""
        },
        {
          "body": "Zainabsaid:\"Then I went intoZainabbintJahsh when her brother died, and she called for some perfume and put some on. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say on the Minbar: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "Humaid bin Nafi narrated that :Zainabsaid: \"So I entered uponZainabbintJahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah:that the wives of the Prophet all differed with 'Aishah and refused to allow anyone with ties of breastfeeding like Salim, the freed salve of Abu Hudhaifah, to enter upon them. They said: “How do we know? That may be a concession granted only to Salim.”"
        },
        {
          "body": "Narrated Kulaib bin Wail:I askedZainabbintAbi Salama (i.e. daughter of the wife of the Prophet, \"Tell me about the Prophet . \nDid he belong to the tribe of Mudar?\" She replied, \"Yes, he belonged to the tribe of Mudar and was \nfrom the offspring of An-Nadr bin Kinana.\""
        },
        {
          "body": "NarratedZainabbintAbi Salama:I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a \nwoman who believes in Allah and the Last Day to mourn for any dead person for more than three days \nexcept for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went toZainabbintJahsh when her brother died; she asked for some scent, and after using it she said, \"I am \nnot in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in \nAllah and the Last Day to mourn for more than three days for any dead person except her husband, \n(for whom she should mourn) for four months and ten days.' \""
        },
        {
          "body": "Narrated `Amrabint`Abdur-Rahman from `Aisha:Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. WhenZainabbintJahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, andZainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal."
        },
        {
          "body": "'Aishah said that the Messenger of Allah used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet entered upon either of us, she would say:\"I perceive the smell of Maghafir (a nasty-smelling gum) on you; have you eaten Maghafir?\" He came in to one of them, and she said that to him. He said: \"No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.\" Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' 'If you two turn in repentance to Allah, (it will be better for you)' about 'Aishah and Hafsah, 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives' refers to him saying: \"No, rather I drank honey.\""
        },
        {
          "body": "'Ubaid bin 'Umair narrated from 'Aishah, the wife of the Prophet:\"The Prophet used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet came to either of us, she would say: 'I detect the smell of Maghafir (a nasty-smelling gum) on you; have you eaten Maghafir?' He came to one of them and she said that to him. He said: 'No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.' Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' 'If you two turn in repentance to Allah, (it will be better for you).' addressing 'Aishah and Hafsah; 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives.' refers to him saying: \"No, rather I drank honey.\"\""
        },
        {
          "body": "'Ubaid bin 'Umair said:I heard 'Aishah say: \"The Prophet used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet came to either of us, she would say: 'I detect the smell of Maghafir (a nasty-smelling gum) on you. Have you eaten Maghafir?' He went to one of them and she said that to him. He said: 'No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.' Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you' up to: 'If you two turn in repentance to Allah' -'Aishah and Hafsah- 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives.' refers to him saying: 'No, rather I drank honey.'\""
        },
        {
          "body": "ZainabbintJahsh said:\"One day the Messenger of Allah(s.a.w) awoke from sleep with a flushed red face, and said: 'La Ilahaillallah. He repeated it thrice. 'Woe to the Arabs from the evil drawn near. Today a gap has been made in the wall of Ya'juj and Ma'juj like this.' And he formed ten(with his fingers).\"Zainabsaid: \"I said: 'O Messenger of Allah! Shall we be destroyed while they are righteous among us?' He said: 'Yes, when the evil abounds.\"'"
        },
        {
          "body": "It was narrated thatZainabbintJahsh said:\"I said to the Prophet (PBUH) that I was suffering from Istihadah. He said: 'Do not pray during the days of your period, then perform Ghusl and delay Zuhr and bring Maghrib and bring 'Isha' forward and pray them together, and perform Ghusl for Fajr.\""
        },
        {
          "body": "Narrated Anas bin Malik:The Verse of Al-Hijab (veiling of women) was revealed in connection withZainabbintJahsh. (On the \nday of her marriage with him) the Prophet gave a wedding banquet with bread and meat; and she used \nto boast before other wives of the Prophet and used to say, \"Allah married me (to the Prophet in the \nHeavens.\""
        },
        {
          "body": "It was narrated thatZainabbintUmm Salamah said:\"Umm Habibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah that Umm Salamah said:\"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah that Umm Habibah said:\"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "ZainabbintAbi Salamah said:\"I heard 'Aisha, the wife of the Prophet say: 'SahlahbintSuhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\""
        },
        {
          "body": "Zaynabsaid, \"I went to the house ofZaynabbintJahsh, the wife\nof the Prophet, may Allah bless him and grant him peace, when her\nbrother had died. She called for perfume and put some on and said, 'By\nAllah! I have no need of perfume, but I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, 'It is not halal for a\nwoman who trusts in Allah and the Last Day to abstain from adornment\nin mourning for someone who has died for more than three nights,\nexcept for four months and ten days for a husband.' \""
        },
        {
          "body": "It was narrated from Urwah fromZainabbintUmm Salamab, from Umm Salamah, that:she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:\"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\""
        },
        {
          "body": "Narrated Anas:\"When this Ayah was revealed: 'But you did hide in yourself that which Allah will make manifest... (33:37)' aboutZainabbintJahsh, Zaid had come to the Prophet (SAW) complaining, and he wanted to divorce her, so he consulted with the Prophet (SAW). The Prophet (SAW) said: 'Keep your wife to yourself, and have Taqwa of Allah (33:37).'\""
        },
        {
          "body": "Narrated Anas:\"When this Ayah was revealed aboutZainabbintJahsh: 'So when Zaid had completed his aim with her, We gave her to you in marriage (33:37)' - he said: \"She used to boast to the wives of the Prophet (SAW): 'Your families married you (to him) while Allah married me (to him) from above the Seven Heavens.'\""
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair and 'Amrahbint'Abdur-Rahman that :'Aishah the wife of the Prophet said: \"Umm Habibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahman bin 'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.'\" 'Aishah said: \"She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sisterZainabbintJahsh and the blood would turn the water red.\""
        },
        {
          "body": "It was narrated from Humaid bin Nafi' thatZainabbintAbi Salamah told him these three Hadiths.Zainabsaid:\"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "Narrated `Aisha:The Prophet used to stay (for a period) in the house ofZainabbintJahsh (one of the wives of the \nProphet ) and he used to drink honey in her house. Hafsa and I decided that when the Prophet entered \nupon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). \nHave you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \n\"No, but I have drunk honey in the house ofZainabbintJahsh, and I will never drink it again.\" Then \nthe following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made \nlawful for you?. ..(up to) If you two (wives of the Prophet turn in repentance to Allah.' (66.1-4) The \ntwo were `Aisha and Hafsa And also the Statement of Allah: 'And (Remember) when the Prophet \ndisclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk \nhoney.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so \ndo not inform anybody of that.\""
        },
        {
          "body": "Narrated Humaid bin Nafi`:ZainabbintAbu Salama told me these three narrations:Zainabsaid: I went to Um Habiba, the wife of \nthe Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which \ncontained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it \nand then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard \nAllah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for \na dead person for more than three days unless he is her husband for whom she should mourn for four \nmonths and ten days.'\""
        },
        {
          "body": "It was\nnarrated that Umm Salamah said:“The Prophet (saw) was\nperforming\nprayer in the house of Umm Salamah, and ‘Abdullah or ‘Umar\nbin\nAbu Salamah passed in front of him; he gestured his hand, and he\nwent\nback. ThenZainabbintUmm Salamah passed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "ZainabbintAbu Salamah narrated that her mother Umm Salamah, the wife of the Prophet, used to say:\"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that this is a concession which the Messenger of Allah granted only to Salim. No one will enter upon us, nor see us on the basis of this type of breast-feeding.'\""
        },
        {
          "body": "NarratedZainabbintUm Salama:Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential \nfor a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if \nshe notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) \ndischarge?\" He said, \"How then does (her) son resemble her (his mother)?\""
        },
        {
          "body": "It was narrated fromZainabbintUmm Salamah -I (the narrator) said:\"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\""
        },
        {
          "body": "NarratedZainabbintAbi Salama:Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is \nit obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she \nnotices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's \nApostle said. 'Then why does a child resemble (its mother)?\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah, from Umm Salamah that a woman from the Quraish came to the Messenger of Allah and said:\"My daughter's husband has died, and I am worried about her eyes; she needs kohl.\" He said: \"One of you used to throw a piece of dung after a year had passed. Rather it (the mourning period) is four months and ten days.\" I (the narrator) said toZainab: \"What does 'after a year had passed' mean?\" She said: \"During the Jahiliyyah, if a woman's husband died she would go to the worst room she had and stay there, then, when a year had passed, she would come out and throw a piece of dung behind her.\""
        },
        {
          "body": "NarratedZainabbintJahsh:The Prophet got up from his sleep with a flushed red face and said, \"None has the right to be \nworshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a \ngap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the \nnumber 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous \npeople among us?\" The Prophet said, \"Yes, if evil increased.\""
        },
        {
          "body": "Narrated `Abdullah bin Hisham:who was born during the lifetime of the Prophet that his mother,ZainabbintHumaid had taken him to \nAllah's Apostle and said, \"O Allah's Apostle! Take his Pledge of allegiance (for Islam).\" The Prophet \nsaid, \"He (`Abdullah bin Hisham) is a little child,\" and passed his hand over his head and invoked \nAllah for him. `Abdullah bin Hisham used to slaughter one sheep as a sacrifice on behalf of all of his \nfamily."
        },
        {
          "body": "ZainabbintUmm Salama (Allah be pleased with her) reported that a relative of Umm Habiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days."
        },
        {
          "body": "NarratedZainabbintAbi Salama:When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked \nfor a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been \nin need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah \nand the Last Day to mourn for more than three days for any dead person except her husband, for \nwhom she should mourn for four months and ten days.\""
        },
        {
          "body": "It was narrated fromZainabbintUmm Salamah, that Umm Salamah and Umm Habibah said:\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\""
        },
        {
          "body": "ZainabbintAbu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days."
        },
        {
          "body": "Narrated `Aisha:Some of the wives of the Prophet asked him, \"Who amongst us will be the first to follow you (i.e. die \nafter you)?\" He said, \"Whoever has the longest hand.\" So they started measuring their hands with a \nstick and Sauda's hand turned out to be the longest. (WhenZainabbintJahsh died first of all in the \ncaliphate of `Umar), we came to know that the long hand was a symbol of practicing charity, so she \nwas the first to follow the Prophet and she used to love to practice charity. (Sauda died later in the \ncaliphate of Muawiya)."
        },
        {
          "body": "ZainabbintAbu Salama reported:Umm Salama and Umm Habiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wanted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days."
        },
        {
          "body": "ZainabbintJahsh reported that Allah's Apostle (may peace be upon him) got up from sleep saying:There is no being worthy of worship except Allah; there is a destruction in store for Arabia because of turmoil which is at hand, the barrier of Gog and Magog has opened so much. And Sufyan made a sign of ten with the help of his hand (in order to indicate the width of the gap) and I said: Allah's Messenger, would we be perished in spite of the fact that there would be good people amongst us? Thereupon he said: Of course, but only when the evil predominates."
        },
        {
          "body": "'Urwah narrated thatZainabbintAbi Salamah -whose mother was Umm Salamah, the wife of the Prophet- told him that Umm HabibahbintAbi Sufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry DurrahbintAbi Salamah.' He said: 'The daughter of Umm Salamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbi Salama that Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"Umm Salama,\nthe wife of Abu Talha al-Ansari, came to the Messenger of Allah, may\nAllah bless him and grant him peace, and said, 'Messenger of Allah!\nAllah is not ashamed of the truth-does a woman have to do ghusl if she\nhas had an erotic dream?' He said, 'Yes, if she sees any liquid.' \""
        },
        {
          "body": "NarratedZainabbintAbi Salama:Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I \nslipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your \nmenses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um \nSalama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to \ntake the bath of Janaba from a single pot.\""
        },
        {
          "body": "It was narrated from 'Amr bin Sulaim Az-Zuraqi that he heard Abu Qatadah say:\"While we were sitting in the Masjid. The Messenger of Allah (PBUH) came out to us carrying UmamahbintAbi Al-'As bin Ar-Rabi', whose mother wasZainab, the daughter of the Messenger of Allah (PBUH). She was a little girl and he was carrying her. The Messenger of Allah (PBUH) prayed with her on his shoulder, putting her down when he bowed and picking her up again when he stood up, until he completed his prayer.\""
        },
        {
          "body": "It was narrated fromZainabbintAbi Salamah that Umm Habibah, the wife of the Prophet said:\"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\" Umm Habibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry DurrahbintAbi Salamah.\" He said: \"The daughter of Umm Salamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn\nMuhammad ibn Amr ibn Hazm from Humayd ibn Nafi thatZaynabbintAbi\nSalama related these three traditions to him.Zaynabsaid, \"I visited\nUmm Habiba, the wife of the Prophet, may Allah bless him and grant him\npeace, when her father Abu Sufyan ibn Harb had died. Umm Habiba called\nfor a yellowy perfume perhaps khaluq or something else. She rubbed the\nperfume first on a slave-girl and she then wiped it on the sides of\nher face and said, 'By Allah! I have no need of perfume but I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'It is not halal for a woman who trusts in Allah and the Last Day to\nabstain from adornment in mourning for someone who has died, for more\nthan three nights, except for four months and ten days for a husband.'\n\""
        },
        {
          "body": "'A'isha (Allah be pleased with her) narrated that Allah's Apostle (may peace be upon him) used to spend time withZainabdaughter of Jahsh and drank honey at her house. She ('A'isha further) said:I and Hafsa agreed that one whom Allah's Apostle (may peace be upon him) would visit first should say: I notice that you have an odour of the Maghafir (gum of mimosa). He (the Holy Prophet) visited one of them and she said to him like this, whereupon he said: I have taken honey in the house ofZainabbintJabsh and I will never do it again. It was at this (that the following verse was revealed): 'Why do you hold to be forbidden what Allah has made lawful for you... (up to). If you both ('A'isha and Hafsa) turn to Allah\" up to:\" And when the Holy Prophet confided an information to one of his wives\" (lxvi. 3). This refers to his saying: But I have taken honey."
        },
        {
          "body": "Yahya related to me from Malik from Muhammad ibn Abi Harmala, the\nmawla of Abd ar-Rahman ibn Abi Sufyan ibn Huwaytib, thatZaynabbintAbi Salama died during the time that Tariq was amir of Madina and her\nbier was brought out after subh and put in al-Baqi. He said that Tariq\nused to pray subh right at the beginning of its time. He added, \"I\nheard Abdullah ibn Umar say to the family, 'You can either pray over\nyour dead now or you can wait until the sun comes up.' \""
        },
        {
          "body": "It was narrated from Abu Salamah bin 'Abdur-Rahman thatZainabbintAbi Salamah told him, from her mother, Umm Salamah, the wife of the Prophet:\"That a woman from Aslam who was called Subai'ah was married to her husband, and he died while she was pregnant. Abu As-Sanabil bin Ba'kak proposed to her but she refused to marry him. He said: 'You cannot get married until you have observed 'Iddah for the longer of the two periods.' Approximately twenty days later she gave birth. She went to the Messenger of Allah and he said: 'Get married.'\""
        },
        {
          "body": "ZainabbintAbi Salamah narrated that her mother Umm Salamah said:\"A woman from the Quraish came and said: 'O Messenger of Allah, my daughter's eyes are inflamed; shall I apply kohl to her?' (The daughter's) husband had died so (the Prophet) said: 'Not until four months and ten days (have passed).' Then she said: 'I fear for her sight.' He said: 'No, not until four months and ten days (have passed). During the Jahiliyyah one of you would mourn for her husband for a year, then when one year had passed she would throw a piece of dung.'\""
        },
        {
          "body": "ZainabbintAbu Salamah (May Allah be pleased with them) said:I went to Umm Habibah (May Allah be pleased with her) the wife of the Prophet (PBUH), when her father Abu Sufyan bin Harb (May Allah be pleased with him) died. Umm Habibah (May Allah be pleased with her) sent for a yellow coloured perfume or something else like it, and she applied it to a slave-girl and then rubbed it on her own cheeks and said: \"By Allah, I have no need for perfume, I heard the Messenger of Allah (PBUH) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn for the dead beyond three days, except for the death of her husband; in which case the period of mourning is of four months and ten days.\"'Zainabsaid: I then visitedZainab, daughter of Jahsh (May Allah be pleased with her) when her brother died; she sent for perfume and applied it and then said: \"Beware! By Allah, I don't feel any need of perfume but I heard the Messenger of Allah (PBUH) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn the dead beyond three days except in case of her husband (for whom the period is) four months and ten days.\"'[Al-Bukhari and Muslim]"
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair thatZainabbintAbi Salmah told him that Umm Habibah told her that she said to Messenger of Allah:“Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry DurrahbintAbi Salmah.” The Messenger of Allah said:  The daughter of Umm Salamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”"
        },
        {
          "body": "Narrated `Ubaid bin `Umar:I heard `Aisha saying, \"The Prophet used to stay for a long while with ZanabbintJahsh and drink \nhoney at her house. So Hafsa and I decided that if the Prophet came to anyone of us, she should say \nhim, \"I detect the smell of Maghafir (a nasty smelling gum) in you. Have you eaten Maghafir?' \" So \nthe Prophet visited one of them and she said to him similarly. The Prophet said, \"Never mind, I have \ntaken some honey at the house ofZainabbintJahsh, but I shall never drink of it anymore.\" So there \nwas revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you . . . If \nyou two (wives of Prophet) turn in repentance to Allah,' (66.1-4) addressing Aisha and Hafsa. 'When \nthe Prophet disclosed a matter in confidence to some of his wives.' (66.3) namely his saying: But I \nhave taken some honey.\""
        },
        {
          "body": "Humaid bin Nafi narrated that :ZainabbintAbi Salamah said: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\""
        },
        {
          "body": "ZainabbintJahsh, the wife of Allah's Apostle (may peace be upon him), reported that one day Allah's Messenger (may peace be upon him) came out in a state of excitement with his face quite red. And he was saying:There is no god but Allah; there is a destruction in store for Arabia because of the turmoil which is near at hand as the barrier of Gog and Magog has been opened like it, and he (in order to explain it) made a ring with the help of his thumb and forefinger. I said: Allah's Messenger, would we be destroyed despite the fact that there would be pious people amongst us? He said: Yes, when evil would be predominant."
        },
        {
          "body": "It was narrated that Umm HabibahbintJahsh said:\"I used to bleed continuously and heavily. I went to the Prophet asking him for advice and telling him (about my situation). I found him with my sisterZainaband said: 'o Messenger of Allah! I need to ask you something.' He said: 'What is it?' I said: 'I bleed continuously and heavily, and that is keeping me from prayer and fasting. What do you command me to do about it?' He said: 'I advise you to use a piece of cotton, for that will take away the blood.' I said: 'It is more than that.'\" And he mentioned something like the Hadith of Sharik (below)."
        },
        {
          "body": "Narrated Anas bin Malik:I of all the people know best this verse of Al-Hijab. When Allah's Apostle marriedZainabbintJahsh \nshe was with him in the house and he prepared a meal and invited the people (to it). They sat down \n(after finishing their meal) and started chatting. So the Prophet went out and then returned several \ntimes while they were still sitting and talking. So Allah revealed the Verse: \n'O you who believe! Enter not the Prophet's houses until leave is given to you for a meal, (and then) \nnot (so early as) to wait for its preparation .....ask them from behind a screen.' (33.53) So the screen \nwas set up and the people went away."
        },
        {
          "body": "Yahya related to me from Malik from Abu'l-Aswad Muhammad ibn Abd\nar-Rahman ibn Nawfal from Urwa ibn az-Zubayr fromZaynabbintAbi\nSalama that Umm Salama, the wife of the Prophet, may Allah bless him\nand grant him peace, said, \"I once complained to the Messenger of\nAllah, may Allah bless him and grant him peace, that I was ill and he\nsaid, 'Do tawaf riding behind the people.' So I did tawaf riding my\ncamel, while the Messenger of Allah, may Allah bless him and grant him\npeace, was praying by the side of the House, reciting Surat at-Tur.\""
        },
        {
          "body": "Narrated `Amra:Aisha said, \"the Prophet used to practice I`tikaf in the last ten days of Ramadan and I used to pitch a \ntent for him, and after offering the morning prayer, he used to enter the tent.\" Hafsa asked the \npermission of `Aisha to pitch a tent for her and she allowed her and she pitched her tent. WhenZainabbintJahsh saw it, she pitched another tent. In the morning the Prophet noticed the tents. He said, \n'What is this?\" He was told of the whole situation. Then the Prophet said, \"Do you think that they \nintended to do righteousness by doing this?\" He therefore abandoned the I`tikaf in that month and \npracticed I`tikaf for ten days in the month of Shawwal.\""
        },
        {
          "body": "ZainabbintUmm Salama (Allah be pleased with her) reported on the authority of her mother that a woman lost her husband. (As her eyes were ailing) they (her kith and kin) entertained fear about her eyes, so they came to Allah's Apostle (may peace be upon him) and sought permission for the use of collyrium, whereupon Allah's Messenger (may peace be upon him) said:One among you used to spend one year in a dungeon dressed in worst clothes. (And at the end of this period) she threw dung at the dog which happened to pass that way and then she came out (of her 'Idda). Can't she (wait) even for four months and ten days?"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbi Salama from Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"I am but a\nman to whom you bring your disputes. Perhaps one of you is more\neloquent in his proof than the other, so I give judgement according to\nwhat I have heard from him. Whatever I decide for him which is part of\nthe right of his brother, he must not take any of it, for I am\ngranting him a portion of the Fire.\""
        },
        {
          "body": "Narrated `Abdullah bin Hisham:that his motherZainabbintHumaid took him to the Prophet and said, \"O Allah's Apostle! Take the \npledge of allegiance from him.\" But he said, \"He is still too young for the pledge,\" and passed his \nhand on his (i.e. `Abdullah's) head and invoked for Allah's blessing for him. Zuhra bin Ma`bad stated \nthat he used to go with his grandfather, `Abdullah bin Hisham, to the market to buy foodstuff. Ibn \n`Umar and Ibn Az-Zubair would meet him and say to him, \"Be our partner, as the Prophet invoked \nAllah to bless you.\" So, he would be their partner, and very often he would win a camel's load and \nsend it home."
        },
        {
          "body": "Zainab(bintAbu Salama) (Allah be pleased with her) reported:I went to Umm Habiba, the wife of Allah's Apostle (may peace be upon him), when her father Abu Sufyan had died. Umm Habiba sent for a perfume having yellowness in it or something else like it, and she applied it to a girl and then rubbed it on her cheeks and then said: By Allah, I need no perfume but for the fact that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafter to mourn for the dead beyond three days, but (in case of the death) of the husband it is permissible for four months and ten days.\"Zainabsaid: I then visitedZainabhint Jahsh (Allah be pleased with her) when her brother died and she sent for perfume and applied it and then said: By Allah, I don't feel any need for the perfume but that I heard Allah's Messenger (may peace be upon him) say on the pulpit:\" It is not permissible for a woman believing in Allah and the Hereafbler to mourn the dead beyond three days except in case of her husband (for whom she can mourn) for four months and ten days.\"Zainab(Allah be pleased with her) said: I heard my mother Umm Salama (Allah be pleased with her) as saying: A woman came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger. I have a daughter whose husband has died and there has developed some trouble in her eye; should we apply collyrium to it? Thereupon Allah's Messenger (may peace be upon him) said: No (repeating it twice or thrice, saying only, NO\" all the time). Then he said: It is only four mouths and ten days, whereas in the preIslamic period none of you threw away the dung until one year had passed. Humaid said: I said toZainab: What is this throwing of dung until a year is passed?Zainabsaid: When the husband of a woman died, she went into a hut and put on her worst clothes, and did not apply perfume or something like it until a year was over. Then an animal like a donkey, or a goat, or a bird was brought to her and she rubbed her hand over it, and it so happened that one on which she rubbed her hand died. She then came out of her house and she was given dung and she threw it and then she made use of anything like perfume or something else as she liked."
        },
        {
          "body": "Ziyad related to me from Malik from Ibn Shihab from AmrabintAbd\nar-Rahman from A'isha that the Messenger of Allah, may Allah bless him\nand grant him peace, once wanted to do itikaf, and when he went off to\nthe place where he wanted to do itikaf  he found some tents there,\nwhich were A'isha's tent, Hafsa's tent, and Zaynab's tent. When he saw\nthem he asked about them and someone told him that they were the tents\nof A'isha, Hafsa andZaynab. The Messenger of Allah, may Allah bless\nhim and grant him peace, said, \"Do you think them devout?\" Then he\nleft, and did not do itikaf until Shawwal, when he then did it for ten\ndays."
        },
        {
          "body": "Zainab, daughter of Umm Salama, reported:My name first was Barra. Allah's Messenger (may peace be upon him) gave me the name ofZainab. Then there entered (into the house of Allah's Prophet as a wife)Zainab, daughter of Jahsh, and her name was also Barra, and he gave her the name ofZainab."
        },
        {
          "body": "Narrated Anas bin Malik:When Allah's Apostle marriedZainabbintJahsh, he invited the people to a meal. They took the meal \nand remained sitting and talking. Then the Prophet (showed them) as if he is ready to get up, yet they \ndid not get up. When he noticed that (there was no response to his movement), he got up, and the \nothers too, got up except three persons who kept on sitting. The Prophet came back in order to enter \nhis house, but he went away again. Then they left, whereupon I set out and went to the Prophet to tell \nhim that they had departed, so he came and entered his house. I wanted to enter along with him, but he \nput a screen between me and him. Then Allah revealed: \n'O you who believe! Do not enter the houses of the Prophet...' (33.53)"
        },
        {
          "body": "Amr bin Al-Harith, the nephew ofZainab, the wife of Abdullah, narrated that :Zainab, the wife of Abdullah narrated similarly from the Prophet."
        },
        {
          "body": "It was narrated from Abu Hurairah that:\"Zainabused to be called \"Barrah\" (good), and it was said that she was praising herself. So the Messenger of Allah(SAW) changed her name toZainab.\""
        },
        {
          "body": "Abu Huraira reported that the name ofZainabwas Barra. It was said of her:She presents herself to be innocent. Allah's Messenger (may peace be upon him) gave her the name ofZainab."
        },
        {
          "body": "It was narrated thatZainab, the wife of 'Abdullah, said:\"The Messenger of Allah said to women: 'Give charity, even from women: 'Give charity, even from your jewelry. 'Abdullah was not a wealthy man and she said to him: 'Can I spend my charity on you and on my brother's children who are orphans? 'Abdullah said: 'Ask the Messenger of Allah about that.' She said: So I went to the Messenger of Allah, and at his door I found a woman from among the Ansar who was also calledZainab, and she was asking about the same matter as I was. Bilal came out to us and we said to him: Go to the Messenger of Allah and ask him about that, but do not tell him who we are. He went to the Messenger of Allah and he said:' Who are they?' He said:Zainab.' He said: 'WhichZainab?\" He said: 'ZainabAl-Ansariyyah.' Abdullah andZainabAl-Ansariyyah.' He said: 'Yes, they will have two rewards, the reward for upholding the ties of kinship and the reward dfor giving charity.\"'"
        },
        {
          "body": "'Ali bin Husain said that Miswar bin Makhramah told him that:'Ali bin Abu Talib proposed to the daughter of Abu Jahl, when he was married to Fatimah the daughter of the Prophet. When Fatimah heard of that she went to the Prophet, and said: \"Your people are saying that you do not feel angry for your daughters. This 'Ali is going to marry the daughter of Abu Jahl.\" Miswar said: \"The Prophet stood up, and I heard him when he bore witness (i.e., said the Shahadah), then he said: 'I married my daughter (Zainab) to Abul-As bin Rabi', and he spoke to me and was speaking the truth. FatimahbintMuhammad is a part of me, and I hate to see her faced with troubles. By Allah, the daughter of the Messenger of Allah and the daughter of the enemy of Allah will never be joined together in marriage to one man.\" He said: So, 'Ali abandoned the marriage proposal."
        },
        {
          "body": "Narrated `Amrabint`Abdur-Rahman from `Aisha:Allah's Apostle used to practice I`tikaf every year in the month of Ramadan. And after offering the \nmorning prayer, he used to enter the place of his I`tikaf. `Aisha asked his permission to let her practice \nI`tikaf and he allowed her, and so she pitched a tent in the mosque. When Hafsa heard of that, she also \npitched a tent (for herself), and whenZainabheard of that, she too pitched another tent. When, in the \nmorning, Allah's Apostle had finished the morning prayer, he saw four tents and asked, \"What is \nthis?\" He was informed about it. He then said, \"What made them do this? Is it righteousness? Remove \nthe tents, for I do not want to see them.\" So, the tents were removed. The Prophet did not perform \nI`tikaf that year in the month of Ramadan, but did it in the last ten days of Shawwal."
        },
        {
          "body": "Zainabdaughter of Abu Salama reported:I heard Umm Salama, the wife of Allah's Apostle (may peace be upon himy, saying to 'A'isha: By Allah, I do not like to be seen by a young boy who has passed the period of fosterage, whereupon she ('A'isha) said: Why is it so? Sahla daughter of Suhail came to Allah's Messenger (may peace be upon him) and said: Allah's Messenger, I swear by Allah that I see in the face of Abu Hudhaifa (the signs of disgust) on account of entering of Salim (in the house), whereupon Allah's Messenger (may peace be upon him) said: Suckle him. She (SahlabintSuhail) said: He has a heard. But he (again) said: Suckle him, and it would remove what is there (expression of disgust) on the face of Abu Hudhaifa. She said: (I did that) and, by Allah, I did not see (any sign of disgust) on the face of Abu Hudhaifa."
        },
        {
          "body": "Anas said that he was ten years old when the Messenger of Allah,\nmay Allah bless him and grant him peace, came to Madina. He said, \"My mothers\ndecided that I would serve him and I served him for ten years. He died\nwhen I was twenty. I am the person who knows best about the business of\nthe veil. The first instance that was revealed occurred when the Messenger\nof Allah, may Allah bless him and grant him peace, built a room forZaynabbintJahsh. He celebrated the wedding there, invited the people who came,\nate and then left. A group remained with the Prophet, may Allah bless him\nand grant him peace. They stayed for a long time and then the Prophet went\nout and I went out hoping that they would leave. He walked and I walked\nwith him until he came to the threshold of 'A'isha's room. Then, thinking\nthat they would have left, he returned and I returned with him. He went\ntoZaynabbut they were still sitting there. He left again and I left with\nhim until he once more reached the threshold of 'A'isha's room. When he\nthought that they would have gone, he went back again and I went back with\nhim. This time they had indeed left. The Prophet, may Allah bless him and\ngrant him peace, then put up a curtain between me and him, and the veil\nwas revealed.\""
        },
        {
          "body": "Narrated Anas bin Malik:I was ten years old when Allah's Apostle arrived at Medina. My mother and aunts used to urge me to \nserve the Prophet regularly, and I served him for ten years. When the Prophet died I was twenty years \nold, and I knew about the order of Al-Hijab (veiling of ladies) more than any other person when it was \nrevealed. It was revealed for the first time when Allah's Apostle had consummated his marriage withZainabbintJahsh. When the day dawned, the Prophet was a bridegroom and he invited the people to a \nbanquet, so they came, ate, and then all left except a few who remained with the Prophet for a long \ntime. The Prophet got up and went out, and I too went out with him so that those people might leave \ntoo. The Prophet proceeded and so did I, till he came to the threshold of `Aisha's dwelling place. Then \nthinking that these people have left by then, he returned and so did I along with him till he entered \nuponZainaband behold, they were still sitting and had not gone. So the Prophet again went away and \nI went away along with him. When we reached the threshold of `Aisha's dwelling place, he thought \nthat they had left, and so he returned and I too, returned along with him and found those people had \nleft. Then the Prophet drew a curtain between me and him, and the Verses of Al-Hijab were revealed."
        },
        {
          "body": "Narrated Anas bin Malik:that he was a boy of ten at the time when the Prophet emigrated to Medina. He added: I served Allah's \nApostle for ten years (the last part of his life time) and I know more than the people about the \noccasion whereupon the order of Al-Hijab was revealed (to the Prophet). Ubai b n Ka`b used to ask \nme about it. It was revealed (for the first time) during the marriage of Allah's Apostle withZainabbintJahsh. In the morning, the Prophet was a bride-groom of her and he Invited the people, who took their \nmeals and went away, but a group of them remained with Allah's Apostle and they prolonged their \nstay. Allah's Apostle got up and went out, and I too, went out along with him till he came to the lintel \nof `Aisha's dwelling place. Allah's Apostle thought that those people had left by then, so he returned, \nand I too, returned with him till he entered uponZainaband found that they were still sitting there and \nhad not yet gone. The Prophet went out again, and so did I with him till he reached the lintel of \n`Aisha's dwelling place, and then he thought that those people must have left by then, so he returned, \nand so did I with him, and found those people had gone. At that time the Divine Verse of Al-Hijab \nwas revealed, and the Prophet set a screen between me and him (his family)."
        },
        {
          "body": "Anas b. Malik (Allah be pleased with him) reported:I was the best informed among the people pertaining to Hijab (veil and seclusion). Ubayy b. Ka'b used to ask me about it. Anas (Allah be pleased with him) thus narrated: The Messenger of Allah (may peace be upon him) got up in the morning as a bridegroom ofZainabbintjahsh (Allah be pleased witt her) as he had married her at Medina. He invited people to the wedding feast after the day had well risen. There sat Allah's Messenger (may peace be upon him) and there kept sitting along with him some persons after the people had stood up (for departure) ; then Allah's Messenger (may peace be upon him) stood up and walked on and I also walked along with him until he reached the door of the apartment of 'A'isha (Allah be pleased with her). He then thought that they (those who had been sitting there after meal) had gone away. So he returned and I also returned with him, but they were still sitting at their places. So he returned for the second time and I also returned until he reached the apartment of 'A'isha. He again returned and I also returned and they had (by that time) stood up, and he hung a curtain between me and him (at the door of the apartment of HadratZainab, where he had to stay), and Allah revealed the verse pertaining to veil."
        },
        {
          "body": "ZainabbintKa'b bin Ujrah narrated that :Al-Furay'ahbintMalik bin Sinan - the sister of the Abu Sa'eed Al-Khudri - informed her that she went to the Messenger of Allah to ask him if she could return to her family in Banu Khudrah. Her husband had gone out searching for his runaway slaves, and when he was in Turaf Al-Qadum he caught up with them and they killed him. She said: \"So I asked the Messenger of Allah if I could return to my family since my husband had not left me a home that he owned nor any maintenance.\" She said: \"So the Messenger of Allah said: 'Yes.' Then I left. When I was in the courtyard,\" or, \"in the Masjid, the Messenger of Allah called me\" or, \"summoned for me to come back t him and he said: 'What did you say?'\" She said: \"So I repeated the store that I had mentioned to him about the case of my husband. He said: 'Stay in your house until what is written reaches its term.'\" She said: \"So I observed my Iddah there for four months and ten (days).\" She said: \"During the time of Uthman, he sent a message to me asking me about that, so I informed him. He followed it and judged accordingly.\""
        },
        {
          "body": "This hadith was narrated byZainabfrom her mother and fromZainab, the wife of Allah's Apostle (may peace be upon him), or from some other lady from among the wives of the Prophet (may peace be upon him)."
        },
        {
          "body": "Narrated Anas:When Allah's Apostle marriedZainabbintJahsh, he made the people eat meat and bread to their fill \n(by giving a Walima banquet). Then he went out to the dwelling places of the mothers of the believers \n(his wives), as he used to do in the morning of his marriage. He would greet them and invoke good on \nthem, and they (too) would return his greeting and invoke good on him. When he returned to his \nhouse, he found two men talking to each other; and when he saw them, he went out of his house again. \nWhen those two men saw Allah's Apostle: going out of his house, they quickly got up (and departed). \nI do not remember whether I informed him of their departure, or he was informed (by somebody else). \nSo he returned, and when he entered the house, he lowered the curtain between me and him. Then the \nVerse of Al-Hijab was revealed."
        },
        {
          "body": "Narrated Anas bin Malik:When Allah's Apostle marriedZainabbintJahsh, he invited the people who took their meals and then \nremained sitting and talking. The Prophet pretended to be ready to get up, but the people did not get \nup. When he noticed that, he got up, and when he had got up, some of those people got up along with \nhim and there remained three (who kept on sitting). Then the Prophet came back and found those \npeople still sitting. Later on those people got up and went away. So I went to the Prophet and \ninformed him that they had left. \nThe Prophet came, and entered (his house). I wanted to enter(along with him) but he dropped a curtain \nbetween me and him. Allah then revealed: 'O you who believe! Do not enter the Prophet's Houses \nuntil leave is given... (to His statement)... Verily! That shall be an enormity, in Allah's sight.' (33.53)"
        }
      ]
    }
  ]
}