{
  "data": [
    {
      "hadith": [
        {
          "body": "It was narrated from 'Irak bin Malik thatZainabbintAbiSalamahtold him, that Umm Habibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbiSalamah.\" The Messenger of Allah said: \"As a co-wife to UmmSalamah? Even if I were not married to UmmSalamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamahthat UmmSalamahsaid:\"I complained to the Messenger of Allah that I was sick, and he said: 'Perform Tawaf behind the people while you are riding.' So I performed Tawaf while the Messenger of Allah was praying beside the House, and reciting: 'The Tur (Mount), and by the Book Inscribed.'\""
        },
        {
          "body": "'Urwah narrated thatZainabbintAbiSalamah-whose mother was UmmSalamah, the wife of the Prophet- told him that Umm HabibahbintAbiSufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry DurrahbintAbiSalamah.' He said: 'The daughter of UmmSalamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed AbuSalamahand I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamah:that the wives of the Prophet all differed with 'Aishah and refused to allow anyone with ties of breastfeeding like Salim, the freed salve of Abu Hudhaifah, to enter upon them. They said: “How do we know? That may be a concession granted only to Salim.”"
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamahthat Umm Habibah said:\"I heard the Messenger of Allah say this on this Minbar: 'It is not permissible for a woman who believes in Allah and His Messenger to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamahthat Umm Habibah, the wife of the Prophet said:\"O Messenger of Allah, marry the daughter of my father\" - meaning her sister. The Messenger of Allah said: \"Would you like that?\" She said: \"Yes; I do not have you all to myself, and I would like to share this goodness with my sister.\" The Prophet said: \"That is not permissible for me.\" Umm Habibah said: \"O Messenger of Allah, by Allah, we have been saying that you want to marry DurrahbintAbiSalamah.\" He said: \"The daughter of UmmSalamah?\" I said: \"Yes.\" He said: \"By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed AbuSalamahand I. So do not offer your daughters or sisters to me in marriage.\""
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamah, from her mother, that a woman came to the Prophet and asked him about her daughter whose husband had died and she was ill. He said:\"One of you used to mourn for a year, then throw a piece of dung when a year had passed. Rather it (the mourning period) is four months and ten days.\""
        },
        {
          "body": "It was narrated from AbuSalamahbin 'Abdur-Rahman thatZainabbintAbiSalamahtold him, from her mother, UmmSalamah, the wife of the Prophet:\"That a woman from Aslam who was called Subai'ah was married to her husband, and he died while she was pregnant. Abu As-Sanabil bin Ba'kak proposed to her but she refused to marry him. He said: 'You cannot get married until you have observed 'Iddah for the longer of the two periods.' Approximately twenty days later she gave birth. She went to the Messenger of Allah and he said: 'Get married.'\""
        },
        {
          "body": "ZainabbintAbiSalamahsaid:\"I heard 'Aisha, the wife of the Prophet say: 'SahlahbintSuhail came to the Messenger of Allah and said: 'O Messenger of Allah, I see (displeasure) in the face of Abu Hudhaifah when Salim enters upon me.' The Messenger of Allah said: 'Breast-feed him.' She said: 'He has a beard.' He said: 'Breast-feed him, and that will take away (the displeasure) in the face of Abu Hudhaifah.' She said: 'By Allah, I never saw that on the face of Abu Hudhaifah after that.'\""
        },
        {
          "body": "It was\nnarrated fromZainabbintUmmSalamahthat her mother said\nthat her\nbed was in front of the place where the Messenger of Allah\n(saw)\nprostrated."
        },
        {
          "body": "It was narrated fromZainabbintAbiSalamah, from UmmSalamahthat a woman from the Quraish came to the Messenger of Allah and said:\"My daughter's husband has died, and I am worried about her eyes; she needs kohl.\" He said: \"One of you used to throw a piece of dung after a year had passed. Rather it (the mourning period) is four months and ten days.\" I (the narrator) said toZainab: \"What does 'after a year had passed' mean?\" She said: \"During the Jahiliyyah, if a woman's husband died she would go to the worst room she had and stay there, then, when a year had passed, she would come out and throw a piece of dung behind her.\""
        },
        {
          "body": "ZainabbintAbiSalamahnarrated that her mother UmmSalamahsaid:\"A woman from the Quraish came and said: 'O Messenger of Allah, my daughter's eyes are inflamed; shall I apply kohl to her?' (The daughter's) husband had died so (the Prophet) said: 'Not until four months and ten days (have passed).' Then she said: 'I fear for her sight.' He said: 'No, not until four months and ten days (have passed). During the Jahiliyyah one of you would mourn for her husband for a year, then when one year had passed she would throw a piece of dung.'\""
        },
        {
          "body": "It was\nnarrated that UmmSalamahsaid:“The Prophet (saw) was\nperforming\nprayer in the house of UmmSalamah, and ‘Abdullah or ‘Umar\nbin\nAbuSalamahpassed in front of him; he gestured his hand, and he\nwent\nback. ThenZainabbintUmmSalamahpassed in front of him, and he\ngestured his hand, but she kept going. When the Messenger of Allah\n(saw) finished his prayer, he said: ‘These (women) are more\nstubborn.’”"
        },
        {
          "body": "It was narrated from Humaid bin Nafi' thatZainabbintAbiSalamahtold him these three Hadiths.Zainabsaid:\"I entered upon Umm Habibah, the wife of the Prophet, when her father Abu Sufyan bin Harb died. Umm Habibah called for some perfume and put some on a young girl, then she put some on her cheeks. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "ZainabbintAbuSalamahnarrated that her mother UmmSalamah, the wife of the Prophet, used to say:\"The rest of the wives of the Prophet refused for anyone to enter upon them on the basis of that type of breast-feeding, meaning breast-feeding of an adult. They said to 'Aishah: 'By Allah, we think that this is a concession which the Messenger of Allah granted only to Salim. No one will enter upon us, nor see us on the basis of this type of breast-feeding.'\""
        },
        {
          "body": "It was narrated thatZainabbintUmmSalamahsaid:\"Umm Habibah said: 'I heard the Messenger of Allah say: It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband; (she mourns for him for) four months and ten (days).\""
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair thatZainabbintAbiSalmah told him that Umm Habibah told her that she said to Messenger of Allah:“Marry my sister 'Azzah.” The Messenger of Allah said: 'Would you like that? “She said: “Yes, O Messenger of Allah. I am not the only one living with you and the one who most deserves to share good thingswith me is my sister.” The Messenger of Allah said: “But that is not permissible for me.” She said: “But we throught that you wanted to marry DurrahbintAbiSalmah.” The Messenger of Allah said:  The daughter of UmmSalamah?” She said: “Yes” The Messenger of Allah said: “Even if she were not my step-daughter who is under my care, she would not be permissible for me, because she is the daughter of my brother through breastfeeding. Tuwaibah breastfed both her father and I. So do not offer your sisters and daughters to me for marriage.”"
        },
        {
          "body": "Humaid bin Nafi narrated that :ZainabbintAbiSalamahsaid: \"I entered upon Umm Habibah, the wife of the Prophet when her father Sufyan bin Harb died. So she asked for some perfume that had something yellow saffron or something else, so a girl applied it to her and put some on her cheeks. Then she said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah saying: \"It is not lawful for a woman who believers in Allah and the Last Day to mourn for the dead more than three days, except for her husband (in which case it is) four months and ten days.\""
        },
        {
          "body": "It was narrated from Urwah fromZainabbintUmm Salamab, from UmmSalamah, that:she came to Makkah when she was sick. She mentioned that to the Messenger of Allah and he said: \"Perform Tawaf behind those who are praying while you are riding.\" She said: \"And I heard the Messenger of Allah, at the Kabah, reciting 'By the Tur (Mount).\""
        },
        {
          "body": "It was narrated fromZainabbintUmmSalamah, that UmmSalamahand Umm Habibah said:\"A woman came to the Prophet and said: 'My daughter's husband has died, and I am worried about her eyes. Can I apply kohl to her?' The Messenger of Allah said: 'One of you used to stay (in mourning) for a year. Rather (the mourning period is) four months and ten (days). And when that year had passed she would go out and fling a piece of dung behind her.'\""
        },
        {
          "body": "Narrated Kulaib bin Wail:I askedZainabbintAbiSalama (i.e. daughter of the wife of the Prophet, \"Tell me about the Prophet . \nDid he belong to the tribe of Mudar?\" She replied, \"Yes, he belonged to the tribe of Mudar and was \nfrom the offspring of An-Nadr bin Kinana.\""
        },
        {
          "body": "NarratedZainabbintUm Salama:When Um HabibabintAbiSufyan was informed of her father's death, she asked for perfume and \nrubbed it over her arms and said, \"I am not in need of perfume, but I have heard the Prophet saying, \n\"It is not lawful for a lady who believes in Allah and the Last Day to mourn for more than three days \nexcept for her husband for whom the (mourning) period is four months and ten days.\""
        },
        {
          "body": "It was narrated fromZainabbintUmmSalamah-I (the narrator) said:\"From her mother?\" He said: \"Yes\" - \"that the Prophet was asked about a woman whose husband had died but they were worried about her eyes - could she use kohl?\" He said: \"One of you used to stay in her house wearing her shabbiest clothes for a year, then she would come out. No, (the mourning period is) four months and ten (days).\""
        },
        {
          "body": "A similar report was narrated from SafiyyahbintAbi'Ubaid from one of the wives of the Prophet -and she is UmmSalamah- from the Prophet."
        },
        {
          "body": "Zainabthe daughter of UmmSalamahnarrated from UmmSalamahthat:She and the Messenger of Allah used to take a bath from a single vessel."
        },
        {
          "body": "Yahya related to me from Malik from Muhammad ibnAbiHarmala, the\nmawla of Abd ar-Rahman ibnAbiSufyan ibn Huwaytib, thatZaynabbintAbiSalama died during the time that Tariq was amir of Madina and her\nbier was brought out after subh and put in al-Baqi. He said that Tariq\nused to pray subh right at the beginning of its time. He added, \"I\nheard Abdullah ibn Umar say to the family, 'You can either pray over\nyour dead now or you can wait until the sun comes up.' \""
        },
        {
          "body": "NarratedZainabbintAbiSalama:I went to Um Habiba, the wife of Prophet, who said, \"I heard the Prophets saying, 'It is not legal for a \nwoman who believes in Allah and the Last Day to mourn for any dead person for more than three days \nexcept for her husband, (for whom she should mourn) for four months and ten days'.\" Later I went toZainabbintJahsh when her brother died; she asked for some scent, and after using it she said, \"I am \nnot in need of scent but I heard Allah's Apostle saying, 'It is not legal for a woman who believes in \nAllah and the Last Day to mourn for more than three days for any dead person except her husband, \n(for whom she should mourn) for four months and ten days.' \""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbu Salama that she sawZaynabbintJahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray."
        },
        {
          "body": "NarratedZainabbintAbiSalama:Um Salama said, \"Um Sulaim said, 'O Allah's Apostle! Allah does not refrain from saying the truth! Is \nit obligatory for a woman to take a bath after she gets nocturnal discharge?' He said, 'Yes, if she \nnotices the water (i.e. discharge).' Um Salama smiled and said, 'Does a woman get discharge?' Allah's \nApostle said. 'Then why does a child resemble (its mother)?\""
        },
        {
          "body": "This hadith has been narrated on the authority ofZainabbintJahsh with a slight variation in the chain of transmitters."
        },
        {
          "body": "NarratedZainabbintAbiSalama:When the news of the death of Abu Sufyan reached from Sham, Um Habiba on the third day, asked \nfor a yellow perfume and scented her cheeks and forearms and said, \"No doubt, I would not have been \nin need of this, had I not heard the Prophet saying: \"It is not legal for a woman who believes in Allah \nand the Last Day to mourn for more than three days for any dead person except her husband, for \nwhom she should mourn for four months and ten days.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakr ibn\nMuhammad ibn Amr ibn Hazm from Humayd ibn Nafi thatZaynabbintAbiSalama related these three traditions to him.Zaynabsaid, \"I visited\nUmm Habiba, the wife of the Prophet, may Allah bless him and grant him\npeace, when her father Abu Sufyan ibn Harb had died. Umm Habiba called\nfor a yellowy perfume perhaps khaluq or something else. She rubbed the\nperfume first on a slave-girl and she then wiped it on the sides of\nher face and said, 'By Allah! I have no need of perfume but I heard\nthe Messenger of Allah, may Allah bless him and grant him peace, say,\n'It is not halal for a woman who trusts in Allah and the Last Day to\nabstain from adornment in mourning for someone who has died, for more\nthan three nights, except for four months and ten days for a husband.'\n\""
        },
        {
          "body": "Muhammad ibn 'Ata' related that he visitedZaynabbintSalama and\nshe asked him about the name of one of his sisters. He reports:\"I said,\n'Her name is Barra.' She said, 'Change her name. The Prophet, may Allah\nbless him and grant him peace, marriedZaynabbintJahsh. Her name was\nBarra and he changed it toZaynab. I visited Umm Salama when she married\nhim and my name was Barra. He heard her call me Barra and said, 'Do not\nadorn yourselves. Allah is the One who knows those who are pious (barra)\namong you and those who are deviant. Call herZaynab.' Umm Salama said,\n'She isZaynab.' I said toZaynab, 'Give her a name.'Zaynabsaid, 'Change\nit to what the Messenger of Allah, may Allah bless him and grant him peace,\nchanged it.'\" So he called herZaynab."
        },
        {
          "body": "It was narrated fromZainabbintJahsh that :She had a tub of brass. She said: \"I used to comb the hair of the Messenger of Allah in it.\""
        },
        {
          "body": "NarratedZainabbintJahsh:That the Prophet once came to her in a state of fear and said, \"None has the right to be worshipped but \nAllah. Woe unto the Arabs from a danger that has come near. An opening has been made in the wall \nof Gog and Magog like this,\" making a circle with his thumb and index finger.ZainabbintJahsh said, \n\"O Allah's Apostle! Shall we be destroyed even though there are pious persons among us?\" He said, \n\"Yes, when the evil person will increase.\""
        },
        {
          "body": "Narrated Thabit:The marriage ofZainabbintJahash was mentioned in the presence of Anas and he said, \"I did not see \nthe Prophet giving a better banquet on marrying any of his wives than the one he gave on marryingZainab. He then gave a banquet with one sheep.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbiSalama that Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"Umm Salama,\nthe wife of Abu Talha al-Ansari, came to the Messenger of Allah, may\nAllah bless him and grant him peace, and said, 'Messenger of Allah!\nAllah is not ashamed of the truth-does a woman have to do ghusl if she\nhas had an erotic dream?' He said, 'Yes, if she sees any liquid.' \""
        },
        {
          "body": "NarratedZainabbintAbiSalama:Um-Salama said, \"I got my menses while I was lying with the Prophet under a woolen sheet. So I \nslipped away, took the clothes for menses and put them on. Allah's Apostle said, 'Have you got your \nmenses?' I replied, 'Yes.' Then he called me and took me with him under the woolen sheet.\" Um \nSalama further said, \"The Prophet used to kiss me while he was fasting. The Prophet and I used to \ntake the bath of Janaba from a single pot.\""
        },
        {
          "body": "It was narrated from 'Amr bin Sulaim Az-Zuraqi that he heard Abu Qatadah say:\"While we were sitting in the Masjid. The Messenger of Allah (PBUH) came out to us carrying UmamahbintAbiAl-'As bin Ar-Rabi', whose mother wasZainab, the daughter of the Messenger of Allah (PBUH). She was a little girl and he was carrying her. The Messenger of Allah (PBUH) prayed with her on his shoulder, putting her down when he bowed and picking her up again when he stood up, until he completed his prayer.\""
        },
        {
          "body": "NarratedZainabbintJahsh:That one day Allah's Apostle entered upon her in a state of fear and said, \"None has the right to be \nworshipped but Allah! Woe to the Arabs from the Great evil that has approached (them). Today a hole \nhas been opened in the dam of Gog and Magog like this.\" The Prophet made a circle with his index \nfinger and thumb.ZainabbintJahsh added: I said, \"O Alllah's Apostle! Shall we be destroyed though \nthere will be righteous people among us?\" The Prophet said, \"Yes, if the (number) of evil (persons) \nincreased.\""
        },
        {
          "body": "ZainabbintUmm Salama (the wife of the Holy Prophet) reported that Umm Salama and the Messenger of Allah (may peace be upon him) took a bath from the same vessel."
        },
        {
          "body": "Narrated Anas bin Malik:The Verse: 'But you did hide in your mind that which Allah was about to make manifest.' (33.37) \nwas revealed concerningZainabbintJahsh and Zaid bin Haritha."
        },
        {
          "body": "Anas bin Malik said:ZainabbintJahsh used to boast to the other wives of the Prophet and say: \"Allah married me to him from above the Heavens.\" And the Verse of Hijab was revealed concerning her."
        },
        {
          "body": "ZainabbintAbuSalamah(May Allah be pleased with them) said:I went to Umm Habibah (May Allah be pleased with her) the wife of the Prophet (PBUH), when her father Abu Sufyan bin Harb (May Allah be pleased with him) died. Umm Habibah (May Allah be pleased with her) sent for a yellow coloured perfume or something else like it, and she applied it to a slave-girl and then rubbed it on her own cheeks and said: \"By Allah, I have no need for perfume, I heard the Messenger of Allah (PBUH) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn for the dead beyond three days, except for the death of her husband; in which case the period of mourning is of four months and ten days.\"'Zainabsaid: I then visitedZainab, daughter of Jahsh (May Allah be pleased with her) when her brother died; she sent for perfume and applied it and then said: \"Beware! By Allah, I don't feel any need of perfume but I heard the Messenger of Allah (PBUH) saying from the pulpit, 'It is not permissible for a woman who believes in Allah and the Last Day to mourn the dead beyond three days except in case of her husband (for whom the period is) four months and ten days.\"'[Al-Bukhari and Muslim]"
        },
        {
          "body": "NarratedZainabbintSalama:Um Habiba said to Allah's Apostle \"We have heard that you want to marry DurrabintAbu-Salama.\" \nAllah's Apostle said, \"Can she be married along with Um Salama (her mother)? Even if I have not \nmarried Um Salama, she would not be lawful for me to marry, for her father is my foster brother.\""
        },
        {
          "body": "It was narrated from SafiyyahbintAbi'Ubaid from one of the wives of the Prophet, and from UmmSalamah, that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "Yahya related to me from Malik from Abu'l-Aswad Muhammad ibn Abd\nar-Rahman ibn Nawfal from Urwa ibn az-Zubayr fromZaynabbintAbiSalama that Umm Salama, the wife of the Prophet, may Allah bless him\nand grant him peace, said, \"I once complained to the Messenger of\nAllah, may Allah bless him and grant him peace, that I was ill and he\nsaid, 'Do tawaf riding behind the people.' So I did tawaf riding my\ncamel, while the Messenger of Allah, may Allah bless him and grant him\npeace, was praying by the side of the House, reciting Surat at-Tur.\""
        },
        {
          "body": "Yahya related to me from Muhammad ibn alMunkadir that Rabia ibn\nAbdullah ibn alHadir told him that he had seen Umar ibn al-Khattab\nleading people in front of the bier at the funeral ofZaynabbintJahsh."
        },
        {
          "body": "Zainabfurther said:I want toZainabbintJahsh when her brother died. She \nasked for perfume and used some of it and said, \"By Allah, I am not in need of perfume, but I have \nheard Allah's Apostle saying on the pulpit, 'It is not lawful for a lady who believes in Allah and the \nlast day to mourn for more than three days except for her husband for whom she should mourn for \nfour months and ten days.'\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather fromZaynabbintAbiSalama from Umm Salama, the wife of the\nProphet, may Allah bless him and grant him peace, that the Messenger\nof Allah, may Allah bless him and grant him peace, said, \"I am but a\nman to whom you bring your disputes. Perhaps one of you is more\neloquent in his proof than the other, so I give judgement according to\nwhat I have heard from him. Whatever I decide for him which is part of\nthe right of his brother, he must not take any of it, for I am\ngranting him a portion of the Fire.\""
        },
        {
          "body": "It was narrated that 'Aishah said:\"Umm HabibahbintJahsh- the wife of 'Abdur-Rahman bin 'Awf and the sister ofZainabbintJahsh - suffered Istihadah (non-mentrual vaginal bleeding).\" She said: \"She consulted the Messenger of Allah (PBUH) and the Messenger of Allah (PBUH) said to her: 'That is not menstruation, rather that is a vein. When you period goes, perform Ghusl and pray, and when it comes, stop praying (for that period).'\" 'Aishah said: \"She used to perform Ghusl for every prayer and pray. Sometimes she would perform Ghusl in a washtub in the room of her sisterZainabwhen she was with the Messenger of Allah (PBUH) and the water would turn red with blood, then she would go out and pray with the Messenger of Allah (PBUH). That did not stop her from praying.\""
        },
        {
          "body": "It was narrated fromZainab, the daughter of UmmSalamah, that :Her mother UmmSalamahsaid: \"Umm Sulaim came to the Prophet and asked him about a woman who sees in her dream something like a man sees. He said: 'Yes, if she sees water (discharge), let her take a bath.' I said: 'You have embarrassed the women. Do women experience wet dreams?' The Prophet said: 'May your hands be rubbed with dust, how else does her child resemble her?'\""
        },
        {
          "body": "It was narrated thatZainabbintJahsh said:“The Messenger of\nAllah\n(saw) woke up red in the face and said: ‘La ilaha illallah,\nwoe to the\nArabs from an evil that has drawn nigh. Today a hole has\nbeen opened\nin the barrier of Gog and Magog.’ And he gestured to\nindicate the size\nof the hole.”Zainabsaid: “I said: ‘O\nMessenger of Allah! Will we be\ndestroyed when there are righteous\npeople among us?’ He said: ‘If sin\nand evil deeds increase.’”"
        },
        {
          "body": "NarratedZainabbintJahsh:That the Prophet came to her in a state of fear saying, \"None has the right to be worshiped but Allah! \nWoe to the Arabs because of evil that has come near. Today a hole has been made in the wall of Gog \nand Magog as large as this.\" pointing with two of his fingers making a circle.Zainabsaid, \"I said, 'O \nAllah's Apostle! Shall we be destroyed though amongst us there are pious people? ' He said, 'Yes, if \nevil increases.\""
        },
        {
          "body": "Zainabsaid:\"Then I went intoZainabbintJahsh when her brother died, and she called for some perfume and put some on. Then she said: 'By Allah, I do not have any need for perfume but I heard the Messenger of Allah say on the Minbar: It is not permissible for any woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days, except for a husband, (for whom the mourning period is) four months and ten days.'\""
        },
        {
          "body": "Humaid bin Nafi narrated that :Zainabsaid: \"So I entered uponZainabbintJahsh when her brother died. She called for some perfume and put it on, then said: 'By Allah! I have no need for perfume except that I heard the Messenger of Allah said: \"It is not lawful for a woman who believes in Allah and the Last Day to mourn for the dead more than three nights, except for her husband (in which case it is) four months and ten days.\""
        },
        {
          "body": "It was narrated that:UmmSalamahsaid: “The Messenger of Allah enjoined charity upon us.Zainab, the wife of Abdullah said: 'Will it be accepted as charity on my part if I give charity to my husband who is poor, and to the children of a brother of mine who are orphans, spending such and such on them, and in all circumstances?' He said: 'Yes.'”"
        },
        {
          "body": "Bukayr reported that he saw 'Abdullah ibn Ja'far kissingZaynab,\nthe daughter of 'Umar ibnAbiSalama when she was about two years old."
        },
        {
          "body": "Narrated `Amrabint`Abdur-Rahman from `Aisha:Allah's Apostle mentioned that he would practice I`tikaf in the last ten days of Ramadan. `Aisha asked \nhis permission to perform I`tikaf and he permitted her. Hafsa asked `Aisha to take his permission for \nher, and she did so. WhenZainabbintJahsh saw that, she ordered a tent to be pitched for her and it \nwas pitched for her. Allah's Apostle used to proceed to his tent after the prayer. So, he saw the tents \nans asked, \"What is this?\" He was told that those were the tents of Aisha, Hafsa, andZainab. Allah's \nApostle said, \"Is it righteousness which they intended by doing so? I am not going to perform I`tikaf.\" \nSo he returned home. When the fasting month was over, he performed Itikar for ten days in the month \nof Shawwal."
        },
        {
          "body": "'Aishah said that the Messenger of Allah used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet entered upon either of us, she would say:\"I perceive the smell of Maghafir (a nasty-smelling gum) on you; have you eaten Maghafir?\" He came in to one of them, and she said that to him. He said: \"No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.\" Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' 'If you two turn in repentance to Allah, (it will be better for you)' about 'Aishah and Hafsah, 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives' refers to him saying: \"No, rather I drank honey.\""
        },
        {
          "body": "'Ubaid bin 'Umair narrated from 'Aishah, the wife of the Prophet:\"The Prophet used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet came to either of us, she would say: 'I detect the smell of Maghafir (a nasty-smelling gum) on you; have you eaten Maghafir?' He came to one of them and she said that to him. He said: 'No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.' Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you.' 'If you two turn in repentance to Allah, (it will be better for you).' addressing 'Aishah and Hafsah; 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives.' refers to him saying: \"No, rather I drank honey.\"\""
        },
        {
          "body": "'Ubaid bin 'Umair said:I heard 'Aishah say: \"The Prophet used to stay withZainabbintJahsh and drink honey at her house. Hafsah and I agreed that if the Prophet came to either of us, she would say: 'I detect the smell of Maghafir (a nasty-smelling gum) on you. Have you eaten Maghafir?' He went to one of them and she said that to him. He said: 'No, rather I drank honey at the house ofZainabbintJahsh, but I will never do it again.' Then the following was revealed: 'O Prophet! Why do you forbid (for yourself) that which Allah has allowed to you' up to: 'If you two turn in repentance to Allah' -'Aishah and Hafsah- 'And (remember) when the Prophet disclosed a matter in confidence to one of his wives.' refers to him saying: 'No, rather I drank honey.'\""
        },
        {
          "body": "It was narrated from Humaid bin Nafi' that:he heardZainabthe daughter of UmmSalamahnarrating that she heard UmmSalamahand Umm Habibah mention that a woman came to the Prophet (SAW) and said that her daughter's husband had died, and she was suffering from an eye disease, and she wanted to apply kohl to her eyes (as a remedy). The Messenger of Allah (SAW) said: \"One of you would throw a she-camel's dropping when a year had passed (since the death of her husband. Rather it is four months and ten (days).\""
        },
        {
          "body": "ZainabbintJahsh said:\"One day the Messenger of Allah(s.a.w) awoke from sleep with a flushed red face, and said: 'La Ilahaillallah. He repeated it thrice. 'Woe to the Arabs from the evil drawn near. Today a gap has been made in the wall of Ya'juj and Ma'juj like this.' And he formed ten(with his fingers).\"Zainabsaid: \"I said: 'O Messenger of Allah! Shall we be destroyed while they are righteous among us?' He said: 'Yes, when the evil abounds.\"'"
        },
        {
          "body": "It was narrated thatZainabbintJahsh said:\"I said to the Prophet (PBUH) that I was suffering from Istihadah. He said: 'Do not pray during the days of your period, then perform Ghusl and delay Zuhr and bring Maghrib and bring 'Isha' forward and pray them together, and perform Ghusl for Fajr.\""
        },
        {
          "body": "Narrated Anas bin Malik:The Verse of Al-Hijab (veiling of women) was revealed in connection withZainabbintJahsh. (On the \nday of her marriage with him) the Prophet gave a wedding banquet with bread and meat; and she used \nto boast before other wives of the Prophet and used to say, \"Allah married me (to the Prophet in the \nHeavens.\""
        },
        {
          "body": "Muhammad b. ‘Amr b. ‘Ata said :Zainabdaughter of AbuSalamahasked him: Which name did you give to your daughter? He replied : Barrah. She said: The Messenger of Allah (May peace be upon him) forbade giving this name. I was called Barrah but the Prophet (May peace be upon him) said: Do not declare yourselves pure, for Allah knows best those of  you who are obedient. He said: we asked; which name should we give her? He replied: Call herZainab."
        },
        {
          "body": "It was narrated from Salim, from his father, that:the Messenger of Allah said: \"Omens are only to be found in three things: a horse, a woman and a house.\" (Sahih)(One of the narrators) Az-Zuhri said: \" Abu 'Ubaidah bin 'Abdullah bin Zam'ah said that his mother,Zainab, narrated to him, from UmmSalamah, that she used to list these three, and add to them \"the sword.\""
        },
        {
          "body": "Narrated Umar binAbiSalamah:It was narrated from Umar binAbiSalamahthat he saw Messenger of Allah(saws)praying in a single garment in the house of UmmSalamah, putting the ends of it on his shoulders.\""
        },
        {
          "body": "Zaynabsaid, \"I went to the house ofZaynabbintJahsh, the wife\nof the Prophet, may Allah bless him and grant him peace, when her\nbrother had died. She called for perfume and put some on and said, 'By\nAllah! I have no need of perfume, but I heard the Messenger of Allah,\nmay Allah bless him and grant him peace, say, 'It is not halal for a\nwoman who trusts in Allah and the Last Day to abstain from adornment\nin mourning for someone who has died for more than three nights,\nexcept for four months and ten days for a husband.' \""
        },
        {
          "body": "‘A’ishah reported on the authority of Umm Sulaim al-Ansariyah, who was the mother of Anas b. Malik, said:Messenger of Allah. Allah is not ashamed of truth what do you think, if a woman sees what a man sees in dream, should she take a bath or not? The prophet (may peace be upon him) replied: Yes, she should take a bath if she finds the liquid (vaginal secretion) ‘A’ishah said : Then I came upon her and said her : Woe to you! Does a woman see that (sexual dream)? In the meantime, the Messenger of Allah (may peace be upon him) came upon me and said: May your right hand be covered with dust! How can there be the resemblance (i.e., between the child and the mother)?Abu Dawud said: A similar version has been narrated by Zubaid, ‘Uqail, Yunus, cousin of Al-Zuhri, IbnAbi-Wazir, on the authority of al-Zuhr, musan, al-Hajabi, like al-Zuhri, narrated on the authority of ‘Urwah from ‘A’ishah, but  Hisham b. ‘Urwah narrated from ‘Urwah on the authority ofZainabdaughter of AbuSalamahfrom UmmSalamahsaying. Umm Sulaim came to the Messenger of Allah (may peace be upon him)."
        },
        {
          "body": "Narrated Anas:\"When this Ayah was revealed: 'But you did hide in yourself that which Allah will make manifest... (33:37)' aboutZainabbintJahsh, Zaid had come to the Prophet (SAW) complaining, and he wanted to divorce her, so he consulted with the Prophet (SAW). The Prophet (SAW) said: 'Keep your wife to yourself, and have Taqwa of Allah (33:37).'\""
        },
        {
          "body": "Narrated Anas:\"When this Ayah was revealed aboutZainabbintJahsh: 'So when Zaid had completed his aim with her, We gave her to you in marriage (33:37)' - he said: \"She used to boast to the wives of the Prophet (SAW): 'Your families married you (to him) while Allah married me (to him) from above the Seven Heavens.'\""
        },
        {
          "body": "Zainabsaid:\"I heard UmmSalamahsay: 'A woman came to the Messenger of Allah and said: O Messenger of Allah, my daughter's husband has died and she has a problem in her eye; can I put kohl on her? The Messenger of Allah said: No. Then he said: It is four months and ten days. During the Jahiliyyah one of you would throw a piece of dung at the end of the year.'\" Humaid said: \"I said toZainab: 'What is this throwing a piece of dung at the end of the year?' She said: 'If a woman's husband died, she would enter a small room (Hifsh) and wear her worst clothes, and she would not put on perfume or anything until a year. Then an animal would be brought, a donkey or sheep or bird, and she would end her 'Iddah with it (clean herself with it), and usually any animal used for that purpose would die. Then she would come out and would be given a piece of dung which she would throw, then she would go back to whatever she wanted of perfume, etc.'\"\n  In the narration of Muhammad (binSalamah) Malik said: Hifsh means hut."
        },
        {
          "body": "It was narrated from 'Urwah bin Zubair and 'Amrahbint'Abdur-Rahman that :'Aishah the wife of the Prophet said: \"Umm Habibah Jahsh experienced prolonged non-menstrual bleeding for seven years when she was married to 'Abdur-Rahman bin 'Awf. She complained about that to the Prophet and the Prophet said: 'That is not menstruation, rather it is a vein, so when the time of your period comes, leave the prayer, and when it is over, take a bath and perform prayer.'\" 'Aishah said: \"She used to bathe for every prayer and then perform the prayer. She used to sit in a washtub belonging to her sisterZainabbintJahsh and the blood would turn the water red.\""
        },
        {
          "body": "Narrated `Aisha:The Prophet used to stay (for a period) in the house ofZainabbintJahsh (one of the wives of the \nProphet ) and he used to drink honey in her house. Hafsa and I decided that when the Prophet entered \nupon either of us, she would say, \"I smell in you the bad smell of Maghafir (a bad smelling raisin). \nHave you eaten Maghafir?\" When he entered upon one of us, she said that to him. He replied (to her), \n\"No, but I have drunk honey in the house ofZainabbintJahsh, and I will never drink it again.\" Then \nthe following verse was revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made \nlawful for you?. ..(up to) If you two (wives of the Prophet turn in repentance to Allah.' (66.1-4) The \ntwo were `Aisha and Hafsa And also the Statement of Allah: 'And (Remember) when the Prophet \ndisclosed a matter in confidence to one of his wives!' (66.3) i.e., his saying, \"But I have drunk \nhoney.\" Hisham said: It also meant his saying, \"I will not drink anymore, and I have taken an oath, so \ndo not inform anybody of that.\""
        },
        {
          "body": "Narrated Humaid bin Nafi`:ZainabbintAbu Salama told me these three narrations:Zainabsaid: I went to Um Habiba, the wife of \nthe Prophet when her father, Abu- Sufyan bin Herb had died. Um ,Habiba asked for a perfume which \ncontained yellow scent (Khaluq) or some other scent, and she first perfumed one of the girls with it \nand then rubbed her cheeks with it and said, \"By Allah, I am not in need of perfume, but I have heard \nAllah's Apostle saying, 'It is not lawful for a lady who believes in Allah and the Last Day to mourn for \na dead person for more than three days unless he is her husband for whom she should mourn for four \nmonths and ten days.'\""
        },
        {
          "body": "Humaid ibn Nafi' reported the following three traditions on the authority ofZaynab, daughter of AbuSalamah:Zainabsaid: I visited Umm Habibah when her father AbuSufyan, died. She asked for some yellow perfume containing saffron (khaluq) or something else. Then she applied it to a girl and touched her cheeks.She said: I have no need of perfume, but I heard the Messenger of Allah (saws) say: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.Zaynabsaid: I also visitedZaynab, daughter of Jahsh, when her brother died. She asked for some perfume and used it upon herself.She then said: I have no need of perfume, but I heard the Messenger of Allah (saws) say when he was on the pulpit: It is not lawful for a woman who believes in Allah and the Last Day to observe mourning for one who has died, more than three nights, except for four months and ten days in the case of a husband.Zaynabsaid: I heard my mother, UmmSalamah, say: A woman came to the Messenger of Allah (saws) and said: Messenger of Allah, the husband of my daughter has died, and she is suffering from sore eyes; may we put antimony in her eyes?The Messenger of Allah (saws) said: No. He said this twice or thrice. Each time he said: No. The Messenger of Allah (saws) said: The waiting period is now four months and ten days. In pre-Islamic days one of you used to throw away a piece of dung at the end of a year.Humayd said: I askedZaynab: What do you mean by throwing away a piece of dung at the end of a year.Zaynabreplied: When the husband of a woman died, she entered a small cell and put on shabby clothes, not touching perfume or any other thing until a year passed. Then an animal such as donkey or sheep or bird was provided for her. She rubbed herself with it. The animal with which she rubbed herself rarely survived. She then came out and was given a piece of dung which she threw away. She then used perfume or something else which she desired.Abu Dawud said: The Arabic word \"hafsh\" means a small cell."
        },
        {
          "body": "NarratedZainabbintUm Salama:Um Sulaim said, \"O Allah's Apostle! Verily Allah is not shy of (telling you) the truth. Is it essential \nfor a woman to take a bath after she had a wet dream (nocturnal sexual discharge)?\" He said, \"Yes, if \nshe notices discharge. On that Um Salama laughed and said, \"Does a woman get a (nocturnal sexual) \ndischarge?\" He said, \"How then does (her) son resemble her (his mother)?\""
        },
        {
          "body": "It was narrated that Al Hajjaj binAbiZainabsaid:X\"I heard Abu Uthman narrate that Ibn Mas'ud said: 'The Prophet (SAW) saw me when I had placed my left hand on my right in prayer. He took hold of my right hand and placed it on my left.'\""
        },
        {
          "body": "NarratedZainabbintJahsh:The Prophet got up from his sleep with a flushed red face and said, \"None has the right to be \nworshipped but Allah. Woe to the Arabs, from the Great evil that is nearly approaching them. Today a \ngap has been made in the wall of Gog and Magog like this.\" (Sufyan illustrated by this forming the \nnumber 90 or 100 with his fingers.) It was asked, \"Shall we be destroyed though there are righteous \npeople among us?\" The Prophet said, \"Yes, if evil increased.\""
        },
        {
          "body": "Narrated `Abdullah bin Hisham:who was born during the lifetime of the Prophet that his mother,ZainabbintHumaid had taken him to \nAllah's Apostle and said, \"O Allah's Apostle! Take his Pledge of allegiance (for Islam).\" The Prophet \nsaid, \"He (`Abdullah bin Hisham) is a little child,\" and passed his hand over his head and invoked \nAllah for him. `Abdullah bin Hisham used to slaughter one sheep as a sacrifice on behalf of all of his \nfamily."
        },
        {
          "body": "ZainabbintUmm Salama (Allah be pleased with her) reported that a relative of Umm Habiba (Allah he pleased with her) died. She sent for a yellow (perfume) and applied that to her forearm and said:I, am doing it, for I have heard Allah's Messenger (may peace be upon him) saying: It is not permissible for a woman believing in Allah and the Hereafter to mourn beyond three days except the husband (for whom she can mourn) for four months and ten days."
        },
        {
          "body": "It was narrated fromZainabthat a woman asked UmmSalamahand Umm Habibah whether she could put on kohl during her 'Iddah following her husband's death. She said:\"A woman came to the Prophet and asked him about that, and he said: 'During the Jahiliyyah, if her husband died, one of you would stay (in mourning) for a year, then she would throw a piece of dung then come out. Rather it (the mourning period) is four months and ten days, until the term prescribed is fulfilled.'\""
        },
        {
          "body": "Umar binAbiSalamahnarrated that he saw :Allah's Messenger performing Salat in the house of UmmSalamahwrapped in one garment."
        },
        {
          "body": "ZainabbintAbu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:I had in fact no need of it, but I heard Allah's Messenger (may peace be upon him) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days."
        },
        {
          "body": "Narrated `Aisha:Some of the wives of the Prophet asked him, \"Who amongst us will be the first to follow you (i.e. die \nafter you)?\" He said, \"Whoever has the longest hand.\" So they started measuring their hands with a \nstick and Sauda's hand turned out to be the longest. (WhenZainabbintJahsh died first of all in the \ncaliphate of `Umar), we came to know that the long hand was a symbol of practicing charity, so she \nwas the first to follow the Prophet and she used to love to practice charity. (Sauda died later in the \ncaliphate of Muawiya)."
        },
        {
          "body": "ZainabbintAbu Salama reported:Umm Salama and Umm Habiba (Allah be pleased with them) were talking with each other (and saying) that a woman came to Allah's Messenger (may peace be upon him) and mentioned to him that her daughter had lost her husband, and her eyes were sore and she wanted to use collyrium, whereupon Allah's Messenger (may peace be upon him) said: One among you used to throw dung at the end of a year, and now (this abstinence from adornment) is only for four months and ten days."
        },
        {
          "body": "ZainabbintJahsh reported that Allah's Apostle (may peace be upon him) got up from sleep saying:There is no being worthy of worship except Allah; there is a destruction in store for Arabia because of turmoil which is at hand, the barrier of Gog and Magog has opened so much. And Sufyan made a sign of ten with the help of his hand (in order to indicate the width of the gap) and I said: Allah's Messenger, would we be perished in spite of the fact that there would be good people amongst us? Thereupon he said: Of course, but only when the evil predominates."
        },
        {
          "body": "Humaid bin Nafi narrated that :Zainabsaid: \"And I heard my mother, UmmSalamahsaid: 'A woman came to the Messenger of Allah and she said: \"O Messenger of Allah! My daughter's husband died, and she is suffering from an eye ailment, so can she use Kohl?\" the Messenger of Allah said: \"No\" two or three time. Each time (she asked) he said \"no.\" Then he said: \"It is just a mater of four months and ten (days). During Jahliyyah one of you would throw a clump of camel dung when one year passed.\""
        },
        {
          "body": "It was\nnarrated that UmmSalamahbintAbiUmayyah, the wife of the\nProphet\n(SAW), said:“At the time of the Messenger of Allah (SAW), if\na\nperson stood to pray, his gaze would not go beyond his feet. When\nthe\nMessenger of Allah (SAW) died, if a person stood to pray, his gaze\nwould not go beyond the place where he put his forehead when\nprostrating. Then Abu Bakr died and it was ‘Umar (the caliph). So,\nwhen any person stood to pray his gaze would not go beyond the\nQiblah.\nThen came the time of ‘Uthman bin ‘Affan, and there was\nFitnah\n(tribulation, turmoil), and the people started to look right\nand\nleft.”"
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Ata ibnAbiRabah that a mawla of AsmabintAbiBakr told him, \"We arrived at\nMina with AsmabintAbiBakr at the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""
        },
        {
          "body": "Narrated 'Ali binAbiTalib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "'A'isha (Allah be pleased with her) narrated that Allah's Apostle (may peace be upon him) used to spend time withZainabdaughter of Jahsh and drank honey at her house. She ('A'isha further) said:I and Hafsa agreed that one whom Allah's Apostle (may peace be upon him) would visit first should say: I notice that you have an odour of the Maghafir (gum of mimosa). He (the Holy Prophet) visited one of them and she said to him like this, whereupon he said: I have taken honey in the house ofZainabbintJabsh and I will never do it again. It was at this (that the following verse was revealed): 'Why do you hold to be forbidden what Allah has made lawful for you... (up to). If you both ('A'isha and Hafsa) turn to Allah\" up to:\" And when the Holy Prophet confided an information to one of his wives\" (lxvi. 3). This refers to his saying: But I have taken honey."
        },
        {
          "body": "It was\nnarrated thatSalamahbintHurr, the sister of Kharashah, said:“I\nheard the Prophet (saw) say: ‘A time will come when the people will\nstand for a long time and will not be able to find any Imam to lead\nthem in prayer.”"
        },
        {
          "body": "Narrated `Ubaid bin `Umar:I heard `Aisha saying, \"The Prophet used to stay for a long while with ZanabbintJahsh and drink \nhoney at her house. So Hafsa and I decided that if the Prophet came to anyone of us, she should say \nhim, \"I detect the smell of Maghafir (a nasty smelling gum) in you. Have you eaten Maghafir?' \" So \nthe Prophet visited one of them and she said to him similarly. The Prophet said, \"Never mind, I have \ntaken some honey at the house ofZainabbintJahsh, but I shall never drink of it anymore.\" So there \nwas revealed: 'O Prophet ! Why do you ban (for you) that which Allah has made lawful for you . . . If \nyou two (wives of Prophet) turn in repentance to Allah,' (66.1-4) addressing Aisha and Hafsa. 'When \nthe Prophet disclosed a matter in confidence to some of his wives.' (66.3) namely his saying: But I \nhave taken some honey.\""
        },
        {
          "body": "ZainabbintJahsh, the wife of Allah's Apostle (may peace be upon him), reported that one day Allah's Messenger (may peace be upon him) came out in a state of excitement with his face quite red. And he was saying:There is no god but Allah; there is a destruction in store for Arabia because of the turmoil which is near at hand as the barrier of Gog and Magog has been opened like it, and he (in order to explain it) made a ring with the help of his thumb and forefinger. I said: Allah's Messenger, would we be destroyed despite the fact that there would be pious people amongst us? He said: Yes, when evil would be predominant."
        },
        {
          "body": "It was narrated from SafiyyahbintShaibah, from UmmSalamah, the wife of the Prophet, that the Prophet said:\"The woman whose husband has died should not wear clothes that are dyed with safflower or red clay, and she should not use dye nor kohl.\""
        },
        {
          "body": "Narrated Qais binAbiHazim:Abu Bakr went to a lady from the Ahmas tribe calledZainabbintAl-Muhajir and found that she \nrefused to speak. He asked, \"Why does she not speak.\" The people said, \"She has intended to perform \nHajj without speaking.\" He said to her, \"Speak, for it is illegal not to speak, as it is an action of the \npre-islamic period of ignorance. So she spoke and said, \"Who are you?\" He said, \"A man from the \nEmigrants.\" She asked, \"Which Emigrants?\" He replied, \"From Quraish.\" She asked, \"From what \nbranch of Quraish are you?\" He said, \"You ask too many questions; I am Abu Bakr.\" She said, \"How \nlong shall we enjoy this good order (i.e. Islamic religion) which Allah has brought after the period of \nignorance?\" He said, \"You will enjoy it as long as your Imams keep on abiding by its rules and \nregulations.\" She asked, \"What are the Imams?\" He said, \"Were there not heads and chiefs of your \nnation who used to order the people and they used to obey them?\" She said, \"Yes.\" He said, \"So they \n(i.e. the Imams) are those whom I meant.\""
        },
        {
          "body": "It was narrated that Umm HabibahbintJahsh said:\"I used to bleed continuously and heavily. I went to the Prophet asking him for advice and telling him (about my situation). I found him with my sisterZainaband said: 'o Messenger of Allah! I need to ask you something.' He said: 'What is it?' I said: 'I bleed continuously and heavily, and that is keeping me from prayer and fasting. What do you command me to do about it?' He said: 'I advise you to use a piece of cotton, for that will take away the blood.' I said: 'It is more than that.'\" And he mentioned something like the Hadith of Sharik (below)."
        }
      ]
    }
  ]
}