{
  "data": [
    {
      "hadith": [
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Ata ibnAbiRabah that a mawla of AsmabintAbiBakrtold him, \"We arrived at\nMina with AsmabintAbiBakrat the end of the night, and I said to\nher, 'We have arrived at Mina at the end of the night,' and she said,\n'We used to do that with one who was better than you.' \""
        },
        {
          "body": "It was narrated from Ata binAbiRabah that a freed slave of Asma binAbiBakrtold him:\"I came with AsmabintAbiBakrto Mina at the end of the night and I said to her: 'We have come to Mina at the end of the night.' She said: 'We sued to do this one who was better than you.'\""
        },
        {
          "body": "Asma'bintAbiBakr(RAA) narrated, 'During the lifetime of the Prophet (PBUH), we slaughtered a horse and ate it.' Agreed upon."
        },
        {
          "body": "It was narrated that AsmabintAbiBakrsaid:\"We slaughtered (Naharna) a horse during the time of the Messenger of Allah and ate it\". (Sahih )"
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from Said ibn\nal-Musayyab that AsmabintUmays gave birth to Muhammad ibnAbiBakrat Dhu'l-Hulayfa and AbuBakrtold her to do ghusl and then enter\nihram."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of AsmabintAbiBakras-Siddiq.\"20.7 Wearing\nPerfume during Hajj."
        },
        {
          "body": "It was narrated that Asma'bintAbiBakrsaid:\"The Messenger of Allah was asked about menstrual blood that gets on clothing. He said: 'Rub it off, wash it and perform prayer in (the garment).'\""
        },
        {
          "body": "It was narrated from Asma'bintAbiBakrthat the Prophet said to her:\"Do not count what you give, otherwise Allah, the Mighty and Sublime, will count what He gives to you.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakrthat\nAsmabintUmays washed AbuBakras-Siddiq when he died. Then she went\nout and asked some of the muhajirun who were there, \"I am fasting and\nthis is an extremely cold day. Do I have to do ghusl?\" They said,\n\"No.\""
        },
        {
          "body": "Narrated Asma'bintAbiBakr:Allah's Apostle once stood up delivering a sermon and mentioned the trial which people will face in \nthe grave. When he mentioned that, the Muslims started shouting loudly."
        },
        {
          "body": "It was narrated from Asma'bintAbiBakrthat a woman asked the Messenger of Allah (PBUH) about menstrual blood that gets on clothes. He said:\"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\""
        },
        {
          "body": "It was narrated from Asma'bintAbiBakrtaht a woman asked the Messenger of Allah (PBUH) about menstrual blood that gets on clothes. He said:\"Scratch it, then rub it with water, then sprinkle water over it, and pray in it.\""
        },
        {
          "body": "It was\nnarrated from Abu ‘Umar, the freed slave of Asma’, from Asma’bintAbiBakr, that she brought out a cloak edged with brocade and\nsaid:“The Prophet (saw) used to wear this when he met the enemy.”"
        },
        {
          "body": "It was narrated from Hisham bin 'Urwah, from his wife Fatimah, from Asma'bintAbiBakr, that:The Messenger of Allah [SAW] cursed the woman who affixes hair extensions and the woman who has that done."
        },
        {
          "body": "It was narrated from AbuBakr:That he went out for Hajj with the Messenger of Allah on the Farewell Pilgrimage, and his wife Asma'bint'Umais Al-Khath'amiyyah was with him. When they were at Dhul-Hulaifah, Asma gave birth to Muhammad binabiBakr. AbuBakr. Came to the Prophet and told him, and the Messenger of Allah told him to tell her to perform Ghusl, then begin the Talbniyah for Hajj, and to do everything that the people do, except that she should not circumambulate the House.(sahih)"
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father from AsmabintUmays that she gave birth to Muhammad\nibnAbiBakrat al-Bayda. AbuBakrmentioned this to the Messenger of\nAllah, may Allah bless him and grant him peace, and he said, \"Tell her\nto do ghusl and then enter ihram.\""
        },
        {
          "body": "It was\nnarrated that Jabir said:“Asma’bint‘Umais gave birth to\nMuhammad binAbiBakrand sent word to the Prophet (saw). He told her\nto take a bath, fasten a cloth around her private part and begin the\nTalbiyah.”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from Fatimabintal-Mundhir that whenever a woman who had a fever, was brought to\nAsmabintAbiBakr, she made dua for her and took water and poured it\ninside her collar. She said, \"The Messenger of Allah, may Allah bless\nhim and grant him peace, ordered us to cool it with water.\""
        },
        {
          "body": "AsmabintAbiBakrsaid:\" O the Messenger of Allah! I have nothing except what was given to me by (my husband) Az-Zubair, shall I give it (in charity)?'\" It was said: \"Do not hold (your wealth) so that Allah will hold against you.\""
        },
        {
          "body": "It was narrated that Jabir said:\"Asma'bint'Umais gave birth to Muhammad binAbiBakrand she sent word to the Messenger of Allah asking him what she should do. He told here to perform Ghusl and wrap her private parts in a cloth, and to begin the talbiyah."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that AsmabintAbiBakrsaid to her family, \"Perfume my clothes with incense\nwhen I die and then embalm me. Do not put any of the embalming\nsubstance on my shroud, and do not follow me with a burning torch.\""
        },
        {
          "body": "Asma'bintAbiBakrsaid, \"In the time of the Prophet, may Allah bless\nhim and grant him peace, my mother came to me hoping (I would be dutiful).\nI asked the Prophet, may Allah bless him and grant him peace, 'Do I have\nto treat her well?' 'Yes,' he replied.\""
        },
        {
          "body": "Narrated Asma'bintAbiBakr:A woman asked Allah's Apostle, \"O Allah's Apostle! What should we do, if the blood of menses falls \non our clothes?\" Allah's Apostle replied, \"If the blood of menses falls on the garment of anyone of \nyou, she must take hold of the blood spot, rub it, and wash it with water and then pray in (with it)."
        },
        {
          "body": "Asma'bintAbiBakrnarrated:\"I heard the Messenger of Allah (s.a.w) while mentioning the Lote-Tree of the Utmost Boundary, saying: 'A rider will travel in the shade of one of its branches for a hundred years,' or 'a hundred riders will seek to shade themselves with its shade'-(lne of the narrators) Yahya' was in doubt- 'in it are butterflies of gold, it is as if its fruits are Qilal.\""
        },
        {
          "body": "Yahya related to me from Malik from AbuBakribn Nafi from his\nfather Nafi, the mawla of Ibn Umar that SafiyyabintAbiUbayd\ninformed him that Umm Salama, the wife of the Prophet, may Allah bless\nhim and grant him peace, said that when the lower garment of women was\nmentioned to the Messenger of Allah, he said, \"She lets it down a\nhandspan.\" Umm Salama said, \"If it leaves her uncovered?\" He said,\n\"Then the length of a forearm and let her not increase it.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakrfrom\nhis father from AmrabintAbd ar-Rahman that a thief stole a citron in\nthe time of Uthman Uthman ibn Affan ordered its value to be estimated\nand it was estimated at three dirhams at the rate of exchange of\ntwelve dirhams for the dinar, so Uthman cut off his hand."
        },
        {
          "body": "Ibrahim ibn Marzuq ath-Thaqafi related that his father (who had\nbelonged to Allah ibn az-Zubayr) told him, \"'Abdullah ibn az-Zubayr sent\nme to his mother, Asma'bintAbiBakrand he told her how al-Hajjaj was\ntreating them. She made supplication for me and stroked my head. I was\na young boy at that time.\""
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakribn\nHazm from his father from AmrabintAbd ar-Rahman that A'isha umm al-\nmuminin said to the Messenger of Allah, may Allah bless him and grant\nhim peace, \"Messenger of Allah, SafiyyabintHuyy has begun her\nperiod,\" and the Messenger of Allah, may Allah bless him and grant him\npeace, said, \"Perhaps she will delay us. Has she done tawaf of the\nHouse with you?\" They said, \"Of course.\" He said, \"So you are free to\nleave.\""
        },
        {
          "body": "Narrated Abu Usama from Hisham bin 'Urwa from Fatima:AsmabintAbiBakrsaid, \"We broke our fast during the lifetime of the Prophet on a cloudy day and \nthen the sun appeared.\" Hisham was asked, \"Were they ordered to fast in lieu of that day?\" He replied, \n\"It had to be made up for.\" Ma`mar said, \"I heard Hisham saying, \"I don't know whether they fasted in \nlieu of that day or not.\""
        },
        {
          "body": "It was narrated from Asma'bintAbiBakrthat she came to the Prophet and said:\"O Prophet of Allah, I do not have anything but that which Az-Zubair brings to me. Is there any sin on me if I give a small amount of that which he brings to me?\" He said: Give whatever you can, and do not withhold what you have, lest Allah withhold provision from you.\""
        },
        {
          "body": "Narrated Asma 'bintAbuBakr:The Prophet said, \"I will be standing at the Lake-Fount so that I will see whom among you will come \nto me; and some people will be taken away from me, and I will say, 'O Lord, (they are) from me and \nfrom my followers.' Then it will be said, 'Did you notice what they did after you? By Allah, they kept \non turning on their heels (turned as renegades).' \" The sub-narrator, IbnAbiMulaika said, \"O Allah, \nwe seek refuge with You from turning on our heels, or being put to trial in our religion.\""
        },
        {
          "body": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim\nfrom his father that A'isha, umm al-muminin, proposed to QuraybabintAbiUmayya on behalf of Abd ar-Rahman ibnAbiBakr. They married her\nto him and her people found fault with Abd ar-Rahman and said, \"We\nonly gave in marriage because of A'isha.\" A'isha therefore sent for\nAbd ar-Rahman and told him about it. He gave Qurayba authority over\nherself and she chose her husband and so there was no divorce."
        },
        {
          "body": "It was\nnarrated from AbuBakrbin ‘Abdullah bin Zubair from his\ngrandmother – he (the narrator) said:“I do not know if it was\nAsma’bintAbuBakror Su’dabint‘Awf’ – that the\nMessenger of Allah (saw)\nentered upon Duba’ahbint‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather that AsmabintAbiBakrhad worn clothes that were completely\ndyed with safflower while she was in ihram, though there was not any\nsaffron in them.Yahya said that Malik was asked if a garment\nwhich had been perfumed could be used for ihram if the smell of the\nperfume had gone, and he said, \"Yes, as long as there is no saffron or\nyellow dye in it.\""
        },
        {
          "body": "Narrated Asma'bintAbiBakr:The Prophet prayed the eclipse prayer, and then said, \"Hell was displayed so close that I said, 'O my \nLord ! Am I going to be one of its inhabitants?\"' Suddenly he saw a woman. I think he said, who was \nbeing scratched by a cat. He said, \"What is wrong with her?\" He was told, \"She had imprisoned it (i.e. \nthe cat) till it died of hunger.\""
        },
        {
          "body": "Narrated Asma 'bintAbiBakr:During the period of the peace treaty of Quraish with Allah's Apostle, my mother, accompanied by her \nfather, came to visit me, and she was a pagan. I consulted Allah's Apostle, \"O Allah's Apostle! My \nmother has come to me and she desires to receive a reward from me, shall I keep good relation with \nher?\" He said, \"Yes, keep good relation with her.\""
        },
        {
          "body": "Narrated AsmabintAbuBakr:We slaughtered a horse (by Nahr) during the lifetime of the Prophet and ate it."
        },
        {
          "body": "Narrated Asma'bintAbuBakr:The Prophet ordered us to free slaves at the time of solar eclipses."
        },
        {
          "body": "Narrated Asma'bintAbuBakr:We were ordered to free slaves at the time of lunar eclipses."
        },
        {
          "body": "It was\nnarrated that Umm SalamahbintAbiUmayyah, the wife of the\nProphet\n(SAW), said:“At the time of the Messenger of Allah (SAW), if\na\nperson stood to pray, his gaze would not go beyond his feet. When\nthe\nMessenger of Allah (SAW) died, if a person stood to pray, his gaze\nwould not go beyond the place where he put his forehead when\nprostrating. Then AbuBakrdied and it was ‘Umar (the caliph). So,\nwhen any person stood to pray his gaze would not go beyond the\nQiblah.\nThen came the time of ‘Uthman bin ‘Affan, and there was\nFitnah\n(tribulation, turmoil), and the people started to look right\nand\nleft.”"
        },
        {
          "body": "Narrated Asma'bintAbuBakr:We slaughtered a horse (by Nahr) during the lifetime of Allah's Apostle and ate it."
        },
        {
          "body": "Narrated FatimabintAl-Mundhir:Whenever a lady suffering from fever was brought to Asma'bintAbuBakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order \nus to abate fever with water.\""
        },
        {
          "body": "Narrated Ibn 'Umar:That the Prophet (saws) said: \"Allah has cursed the woman who artificially lengthens and the woman who seeks to have her hair artificially lengthened, and the woman who tattoos and the woman who seeks tattooed.\" Nafi' (one of the narrators) said: \"Tattooing was on the gums.\"[Abu 'Eisa said:] This Hadith is Hasan Sahih.He said: There are narrations on this topic from Ibn Mas'ud, 'Aishah, Asma'bintAbiBakr, Ma'qil bin Yasar, Ibn 'Abbas, and Mu'awiyah."
        },
        {
          "body": "It was\nnarrated that Asm’abintAbuBakrsaid:“We slaughtered a\nhorse\nand ate its meat during the time of the Messenger of Allah\n(saw).”"
        },
        {
          "body": "Narrated 'Ali binAbiTalib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "It was\nnarrated that ‘Aishah said:“Asma’bint‘Umais gave birth at\nShajarah, and the Messenger of Allah (saw) told AbuBakrto tell her\nto take a bath and begin the Talbiyah.”"
        },
        {
          "body": "Yahya related to me from Malik fromAbdullah ibnAbiBakrthat a\nmawla of AmirbintAbd ar-Rahman called Ruqayya told him that she once\nset out with AmrabintAbd ar-Rahman to go to Makka. She said, ''Amra\nentered Makka on the eighth of Dhu'l-Hijja, and I was with her. She\ndid tawaf of the House, and say between Safa and Marwa, and then\nentered the back of the mosque. She asked me, 'Do you have a pair of\nscissors with you?' and I said, 'No.' She said, 'Then try and find\nsome for me.' I went and looked for some and brought them back and she\ncut some hair from the tresses of her head.Then, on the day of\nsacrifice, she slaughtered a sheep.\""
        },
        {
          "body": "Asma'bintAbuBakrnarrated that :a woman asked the Prophet about a garment that was touched by some menstrual blood. So Allah's Messenger said: \"Remove it, and scrub it, then rinse it and pray in it\""
        },
        {
          "body": "`A'isha (Allah be pleased with her) reported that Asma'bint`Umais gave birth to Muhammad b AbuBakrnear Dhu'l-Hulaifa. The Messenger of Allah (may peace be upon him) commanded AbuBakrto convey to her that she should take a bath and then enter into the state of Ihram."
        },
        {
          "body": "It as\nnarrated from AbuBakrbin Muhammad that KhalidahbintAnas,\nthe\nmother of Banu Hazm As-Sa’idiyyah, came to the Prophet (saw) and\nrecited a Ruqyah to him, and he told her to use it."
        },
        {
          "body": "Yahya related to me from Malik from Abdullah ibnAbiBakribn\nHazm from AmrabintAbd ar-Rahman that A'isha, the wife of the\nProphet, may Allah bless him and grant him peace, said, \"Amongst what\nwas sent down of the Qur'an was 'ten known sucklings make haram' -\nthen it was abrogated by 'five known sucklings'. When the Messenger of\nAllah, may Allah bless him and grant him peace, died, it was what is\nnow recited of the Qur'an.\"Yahya said that Malik said, \"One\ndoes not act on this.\""
        },
        {
          "body": "Asma'bintAbuBakr(May Allah be pleased with her) reported:Messenger of Allah (PBUH) said to me, \"Do not hoard; otherwise, Allah will withhold from you.\"[Al-Bukhari and Muslim]."
        },
        {
          "body": "Malik related to me from Nafi that SafiyyabintAbiUbayd\ninformed him that a man who had had intercourse with a virgin slave-\ngirl and made her pregnant was brought to AbuBakras-Siddiq. He\nconfessed to fornication, and he was not muhsan. AbuBakrgave the\norder and he was flogged with the hadd punishment. Then he was\nbanished to Fadak, (thirty miles from Madina).Malik spoke\nabout a person who confessed to fornication and then retracted it and\nsaid, \"I didn't do it. I said that for such-and-such a reason,\" and he\nmentioned the reason. Malik said, \"That is accepted from him and the\nhadd is not imposed on him. That is because the hadd is what is for\nAllah, and it is only applied by one of two means, either by a clear\nproof which establishes guilt or by a confession which is persisted in\nso that the hadd is imposed. If someone persists in his confession,\nthe hadd is imposed on him.\"Malik said, \"I have not seen the\npeople of knowledge exiling slaves who have committed adultery.\""
        },
        {
          "body": "Yahya related to me from Malik from Yahya ibn Said from AmrabintAbd ar-Rahman that AbuBakras-Siddiq visited A'isha while she had a\n[health] complaint and a jewish woman was making incantation (ruqya)\nfor her. AbuBakrsaid, \"Do it (incantation) with the Book of Allah.\""
        },
        {
          "body": "Narrated ‘AsmabintAbuBakr(rad):The Prophet (Saw) said regarding menstruation blood that smears a garment, “She should scrape it, rub it with water, then wash it and then she may pray in it”. [Agreed upon]"
        },
        {
          "body": "This hadith has been transmitted by another chain of narrators:AbuBakrb.AbiShaiba, Ishaq b. Ibrahim, Harun b. Abdullah,AbiUsama, Walid b. Kathir, Muhammad b. Ka'b, his brother Abdullah b. Ka'b andAbiUsama."
        },
        {
          "body": "Amr bin Aws narrated from Abdur-Rahman binAbiBakr:\"The Prophet ordered Abdur-RAhman binAbiBakrto (accompany) Aishah to perform Umrah from At-Tan'im.\""
        },
        {
          "body": "AbuBakrb.AbiShaiba narrated it on the same authorities."
        },
        {
          "body": "Narrated Asma'bintAbuBakr(RA):She brought out the mantle (over-garment) of Allah's Messenger (SAW)) with it's collar, sleeves, front and back hemmed with brocade (silk).\n\n[Abu Dawud reported it]."
        },
        {
          "body": "It was narrated from 'Irak bin Malik that ZainabbintAbiSalamah told him, that Umm Habibah said to the Messenger of Allah:\"We have been saying that you want to marry DurrahbintAbiSalamah.\" The Messenger of Allah said: \"As a co-wife to Umm Salamah? Even if I were not married to Umm Salamah, she would not be permissible to me, for her father is my brother through breast-feeding.\""
        },
        {
          "body": "It was narrated from Jabir bin 'Abdullah, in the Hadith of Asma'bint'Umair, when she gave birth in Dhul-Hulaifah, that the Messenger of Allah (PBUH) said to AbuBakr:\"Tell her to perform Ghusl and enter Ihram.\""
        },
        {
          "body": "It was narrated from Jabir bin 'Abdullah concerning Asma'bintUmais that when she gave birth at Dhul-Hulaifah, the Messenger of Allah (PBUH) said to AbuBakr:\"Tell her to perform Ghusl and (begin the Talbiyah).\""
        },
        {
          "body": "It was narrated that Asma'bintAbiBakrsaid:The Messenger of Allah (SAW) prayed during an eclipse. He stood for a long time, then he bowed for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he stood up and (remained standing) for a long time, then he bowed for a long time, then he stood up, then he prostrated for a long time, then he sat up, then he prostrated for a long time, then he sat up and then he finished.\""
        },
        {
          "body": "'Urwah bin Az-Zubair (narrated) that he heard Asma'bintAbiBakrsay:\"The Messenger of Allah stood up and mentioned the trail with which a person will be tested in his grave. When he mentioned that the people became restless, which prevented me from understanding what the Messenger of Allah had said. When they settled down, I said to a man who was near me: 'May Allah bless you, what did the end?' he said: 'It has been revealed to me that you will be tested in your graves with a trial close to that of the Dajjal.\"'"
        },
        {
          "body": "It was\nnarrated from AbuBakrthat he went out for Hajj with the\nMessenger\nof Allah (saw), and Asma’bint‘Umais was with him. She gave\nbirth, at Shajarah, to Muhammad bin AbuBakr. AbuBakrcame to the\nProphet (saw) and told him about that, and the Messenger of Allah\n(saw) told him to tell her to take a bath, then begin the Talbiyah\nfor\nHajj, and to do everything that the people did, apart from\ncircumambulating the House (Tawaf)."
        },
        {
          "body": "Narrated Anas:AbuBakrwrote to me what Allah had instructed His Apostle (p.b.u.h) to do regarding the one who \nhad to pay oneBintMakhad (i.e. one year-old she-camel) as Zakat, and he did not have it but had gotBintLabun (two year old she-camel). (He wrote that) it could be accepted from him as Zakat, and the \ncollector of Zakat would return him 20 Dirhams or two sheep; and if the Zakat payer had not aBintMakhad, but he had Ibn Labun (a two year old he-camel) then it could be accepted as his Zakat, but he \nwould not be paid anything ."
        },
        {
          "body": "Narrated Asma'bintAbuBakr:that she had gone to the Prophet and he said, \"Do not shut your money bag; otherwise Allah too will \nwithhold His blessings from you. Spend (in Allah's Cause) as much as you can afford. \""
        },
        {
          "body": "Yahya related to me from Malik from Nafi that Salim ibn Abdullah\nibn Umar informed him that A'isha umm al-muminin sent him away while\nhe was being nursed to her sister Umm KulthumbintAbiBakras-Siddiq\nand said, \"Suckle him ten times so that he can come in to see me.\"Salim said, \"Umm Kulthum nursed me three times and then fell\nill, so that she only nursed me three times. I could not go in to see\nA'isha because Umm Kulthum did not finish for me the ten times.\""
        },
        {
          "body": "It was narrated that Jabir bin 'Abdullah said:\"The Messenger of Allah stayed for nine years during which he did not perform Hajj. Then it was announced among the people the he was going for Hajj. No one who was able to come riding or on foot stayed behind, and the people rushed to go out with him until he came to Dhul-Hulaifah. Asam'bint'Umais gave birth to Muhammad binAbiBakrand she sent word to the messenger of Allah (Asking what she should do). He said: 'Perform Ghusl and wrap a cloth around your private parts, then begin the Talbiyah.' So she did that.\" An abridgment"
        },
        {
          "body": "Ja'far bin Muhammad said:\"My father told me: 'We cam to jabir bin 'Abdullah and asked him about the hajj of the prophet (PBUH). He narrated: 'The Messenger of Allah (PBUH) set out when there were five (days) remaining in Dhul-Qa'dah, and we set out with him. When he came to Dhul-Hulaifah, Asma'bint'Umais gave birth to Muhammad binAbiBakr. She sent word to the Messenger of Allah (PBUH) asking what she should do. He said: 'Perform Ghusl, bind yourself with a cloth then begin (the Talbiyah for Ihram).'\""
        },
        {
          "body": "Ja'far bin Muhammad said:\"My father told me: 'We came to Jabir bin 'Abdullah and asked him about the Hajj of the Prophet (PBUH). He narrated; \"The Messenger of Allah (PBUH) set out when there were five (days) remaining in Dhul-Qa'dah, and we set out with him. When he came to Dhul-Hulaifah, Asma'bint'Umais gave birth to Muhammad binAbiBakr. She sent word to the Messenger of Allah (PBUH) asking what he should do. He said: 'Perform Ghusl, bind yourself with a cloth then begin (the Talbiyah for Ihram).'\""
        },
        {
          "body": "It was narrated that AbuBakrbin Abu Jahm bin Sukhair Al-'Adawi said:\"I heard FatimahbintQais say that her husband divorced her ttree times, and the Messenger of Allah (SAW) did not say that she was entitled to accommodation and maintenance.\""
        },
        {
          "body": "AbuBakrreported:I and Abu Salama came to FatimabintQais (Allah be pleased with her) during the time of Ibn Zubair (Allah be pleased with him) and she narrated to us that her husband gave her an irrevocable divorce. (The rest of the hadith is the same.)"
        },
        {
          "body": "A similar report was narrated from SafiyyahbintAbi'Ubaid from one of the wives of the Prophet -and she is Umm Salamah- from the Prophet."
        },
        {
          "body": "IbnAbiKhalid told us, from AbuBakrbinAbiZuhair - I think he said:AbuBakrsaid: O Messenger of Allah, how could we be in a good state after this verse? He said: `May Allah have mercy on you, O AbuBakr. Do you not fall sick? Do you not feel sad? Don't calamities befall you? Do you not...?” He said: Of course. He said: `That is for that.It was narrated that AbuBakrath-Thaqafi said: AbuBakrsaid: O Messenger of Allah, how could we be in a good state after this verse: `whosoever works evil, will have the recompense thereof` (an-Nisa' 4:123)?... and he narrated the same Hadeeth"
        },
        {
          "body": "Jabir b. `Abdullah (Allah be pleased with them) reported that when Asma'bint`Umais gave birth (to a child) in Dhu'l-Hulaifa. Allah's Messenger (may peace be upon him) commanded AbuBakr(to convey to her) that she should take a bath and enter into the state of Ihram."
        },
        {
          "body": "It was narrated that ‘Abdullah, the freed slave of Asma’bintAbiBakr, said:Asma’ sent me to 'Abdullah bin 'Umar, and she said: I have heard that you regard three things as haram: borders on garments, saddle cloths made of bright red cloth, and fasting the whole of Rajab. 'Abdullah said to me: As for what you have mentioned about Rajab, what about one who fasts continually? As for what you said about borders on garments, I heard 'Umar bin al-Khattab say: I heard the Messenger of Allah ﷺ say: “Whoever wears silk in this world will not wear it in the Hereafter.`"
        },
        {
          "body": "'Aishah said:Asma daughther of 'Umais gave birth to Muhammad binAbiBakrat Shajarah. The Messenger of Allah (saws) commanded AbuBakrto ask her to take a bath and wear ihram."
        },
        {
          "body": "It was\nnarrated that Umm Hani’bintAbiTalib said:“I used to hear\nthe\nProphet (saw) reciting at night when I was on the roof of my\nhouse.”"
        },
        {
          "body": "It was\nnarrated that Asma’bintAbuBakrsaid:“We broke our fast on\na\ncloudy day at the time of the Messenger of Allah (saw), then the sun\nappeared.”I (one of the narrators) said to Hisham: \"Were they commanded to make up for that day?\" He said: \"It had to be made up.\" (According to Hisham's opinion)."
        },
        {
          "body": "It was\nnarrated from Asma’bintAbuBakrthat a woman suffering from\nfever\nwould be brought to her, and she would call for water and pour\nit\nonto the neck of her garment. She said:The Prophet (saw) said:\n“Cool\nit down with water,” and he said: “It is from the heat of\nHell-fire.”"
        },
        {
          "body": "It was narrated from SafiyyahbintAbi'Ubaid that she heard Hafsahbint'Umar, the wife of the Prophet, (narrate) that the Prophet said:\"It is not permissible for a woman who believes in Allah and the Last Day to mourn for anyone who dies for more than three days except for a husband; she should mourn for him for four months and ten (days).\""
        },
        {
          "body": "It was\nnarrated that Asma’bintAbiBakrsaid:“We went out with the\nMessenger of Allah (saw) in Ihram. The Prophet (saw) said: ‘Whoever\nhas a sacrificial animal with him, let him remain in Ihram. Whoever\ndoes not have a sacrificial animal with him, let him exit Ihram.’\nShe\nsaid: ‘I did not have a sacrificial animal with me, so I exited\nIhram,\nbut Zubair had a sacrificial animal with him, so he did not\nexit\nIhram. So I put on my regular clothes and came to Zubair, and he\nsaid:\n‘Go away from me.’ I said: ‘Are you afraid I am going to\njump on\nyou?!’”"
        },
        {
          "body": "It was narrated from AsmabintAbiBakrwho said:\"We came with the Messenger of Allah reciting the Talbiyah for Hajj. When we drew close to Makkah, the Messenger of Alla said: 'Whoever does not have a Hadi with him, let him exit Ihram. Whoever has a Hadi with him, let him remain in Ihram.' Az-Zubair had a Hadi with him so he remained in Ihram, but I did not have a Hadi with me so I exited Ihram, put on my some of my perfume. Then I sat down with As-Zubair and he said: \"Go away from me.' I said: 'Are you afraid that I am going to jump on you?'\""
        },
        {
          "body": "Narrated AsmabintAbiBakr:I saw Zaid bin Amr bin Nufail standing with his back against the Ka'ba and saying, \"O people of Quraish! By Allah, none amongst you is on the religion of Abraham except me.\" He used to preserve the lives of little girls: If somebody wanted to kill his daughter he would say to him, \"Do not kill her for I will feed her on your behalf.\" So he would take her, and when she grew up nicely, he would say to her father, \"Now if you want her, I will give her to you, and if you wish, I will feed her on your behalf.\""
        },
        {
          "body": "Yahya related to me from Malik that Abdullah ibnAbiBakribn\nMuhammad ibn Amr ibn Hazim heard Urwa ibn az-Zubayr saying, \"I went to\nsee Marwan ibn al-Hakam and we talked about what you had to do wudu\nfor, and Marwan said, 'You have to do wudu if you touch your penis.'\nUrwa said, 'I didn't know that.' Marwan ibn al-Hakam said that BusrabintSafwan had told him that she heard the Messenger of Allah, may\nAllah bless him and grant him peace, say, 'If any of you touches his\npenis he should do wudu.' \""
        },
        {
          "body": "It was narrated that Umm HabibahbintAbiSufyan said:\"Whoever prays twelve rak'ahs in a day and prays before Zuhr, Allah (SWT) will build for him a house in Paradise.\""
        },
        {
          "body": "'A’ishabintSa'd ibnAbiWaqqas reported that her father said:“The Prophet (Allah bless him and give him peace) used to drink while standing.”"
        },
        {
          "body": "Narrated `Abdullah bin `Umar:`Umar bin Al-Khattab said, \"When (my daughter) Hafsabint`Umar lost her husband Khunais bin \nHudhaifa As-Sahrni who was one of the companions of Allah's Apostle and had fought in the battle of \nBadr and had died in Medina, I met `Uthman bin `Affan and suggested that he should marry Hafsa \nsaying, \"If you wish, I will marry Hafsabint`Umar to you,' on that, he said, 'I will think it over.' I \nwaited for a few days and then he said to me. 'I am of the opinion that I shall not marry at present.' \nThen I met AbuBakrand said, 'if you wish, I will marry you, Hafsabint`Umar.' He kept quiet and did \nnot give me any reply and I became more angry with him than I was with `Uthman . Some days later, \nAllah's Apostle demanded her hand in marriage and I married her to him. Later on AbuBakrmet me \nand said, \"Perhaps you were angry with me when you offered me Hafsa for marriage and I gave no \nreply to you?' I said, 'Yes.' AbuBakrsaid, 'Nothing prevented me from accepting your offer except \nthat I learnt that Allah's Apostle had referred to the issue of Hafsa and I did not want to disclose the \nsecret of Allah's Apostle , but had he (i.e. the Prophet) given her up I would surely have accepted her.\""
        },
        {
          "body": "It was narrated from Asma bin 'Umais that:she gave birth to Muhammad binAbiBakrAs-Siddiq in Al-Baida, AbuBakrtold the Messenger of Allah about that, and he said: \"Tell her to perform Gusl then begin the Talbiyah.''"
        },
        {
          "body": "This hadith is also narrated by another chain of narrators, i. e. Ibn Numair, Abu Mu'awiya, Waki', AbuBakrb.AbiShaiba, Abu Kuraib, A'mash."
        },
        {
          "body": "Narrated AbuBakrbinAbiMusa:My father said, \"Allah's Apostle said, 'Whoever prays the two cool prayers (`Asr and Fajr) will go to \nParadise.' \""
        },
        {
          "body": "It was\nnarrated from Umm HabibahbintAbiSufyan that the Prophet\n(saw)\nsaid:“Whoever performs twelve Rak’ah (of Sunnah) during the day\nand night, a house will be built for him in Paradise.”"
        },
        {
          "body": "It was\nnarrated that Asma’bintAbuBakrsaid:“We went out with the\nMessenger of Allah (saw) until, when we were in ‘Arj, we stopped to\ncamp. The Messenger of Allah (saw) sat, with ‘Aishah by his side,\nand\nI was sitting beside AbuBakr. Our mount* and the mount of AbuBakrwas one, under the care of the slave of AbuBakr. The slave\nlooked and\nhis camel was not with him, so he said to him: ‘Where is\nyour camel?’\nHe said: ‘I lost it yesterday.’ He said: ‘You\nhave one camel with you\nand you lost it?’ He started to beat him,\nand the Messenger of Allah\n(saw) said: ‘Look at what this Muhrim is\ndoing!’”"
        },
        {
          "body": "Ibn Shihab (al-Zuhr) reported on the authority of AbuBakrb. Sulaiman b.AbiHathmah that the Messenger of Allah (may peace be upon him) did not make two prostrations when are made when one is doubtful until the people met him.Abu Dawud said; this tradition has also been transmitted by al-Zahidi from al-zuhr from AbuBakrb. Sulaiman b.AbiHAthman from thre prophet  (may peace be upon him). This version goes :he did not make two prostrations on account of forgetfulness."
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir told him that she used to see AsmabintAbiBakrat\nMuzdalifa telling whoever led the subh prayer for her and her\ncompanions to pray it as soon as the dawn broke, after which she would\nmount and go to Mina without stopping at all."
        },
        {
          "body": "(Another chain)From AbuBakrbin Hafs, from the Prophet (saws), and it is similar, but he did not mention \"from Ibn `Umar\" in it. This is more correct than the Hadith of Abu Mu'awiyah, and AbuBakrbin Hafs is Ibn 'Umar bin Sa'd binAbiWaqqas (narrators in the chain of this Hadith.)"
        },
        {
          "body": "'Urwah narrated that ZainabbintAbiSalamah -whose mother was Umm Salamah, the wife of the Prophet- told him that Umm HabibahbintAbiSufyan told her that she said:\"O Messenger of Allah, marry my sister, the daughter of Abu Sufyan.\" She said: \"The Messenger of Allah said: 'Would you like that?' I said: 'Yes; I do not have you all to myself and I would like to share this goodness with my sister.' The Prophet said: 'Your sister is not permissible for me (to marry).' I said: 'By Allah, O Messenger of Allah, we have been saying that you want to marry DurrahbintAbiSalamah.' He said: 'The daughter of Umm Salamah?' I said: 'Yes.' He said: 'By Allah, even if she were not my stepdaughter who is in my care, she would not be permissible for me (to marry), because she is the daughter of my brother through breast-feeding. Thuwaibah breastfed Abu Salamah and I. So do not offer your daughters or sisters to me in marriage.'\""
        },
        {
          "body": "Anas bin Malik narrated that:AbuBakrSiddiq wrote to him: “In the name of Allah, the Most Gracious, the Most Merciful. This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah. The ages of camels to be given (in Zakat) may be made up in sheep. So if a man has camels on which the Sadaqah is a Jadha'ah (a four-year-old she-camel) and he does not have a Jadha'ah but he has a Hiqqah (a three year old she-camel), then the Hiqqah should be accepted from him, and two sheep should be given (in addition), if they are readily available, or twenty Dirham. If a man has camels on which the Sadaqah is a Hiqqah, and he only has a Bin Labun( a two-year-old she-camel), then theBintLabun should be accepted from him, along with two sheep or twenty Dirhams.If a man has camels on which the sadaqah is aBintLabun, and he does not have one, but he has a Hiqqah, then it should be accepted from him, and the Zakat collector should give him back twenty Dirham or two sheep. If a man has camels on which Sadaqah is aBintLabun, and he does not have one, but he has aBintMakhad(a one-year-old she-camel), then theBintMakhad should be accepted from him, along with twenty Dirham or two sheep. If a man has camels on which the Sadaqah is aBintMakhad, and he does not have one, but he has aBintLabun, then theBintLabun should be accepted from him, and the Zakat collector should give him back twenty Dirhams or two sheep. Whoever does not have aBintMakhad, but he has aBintLabun (a two-year-old male camel), then it should be accepted from him and nothing else should be given along with it.' ”"
        },
        {
          "body": "Narrated Qais binAbiHazim:AbuBakrwent to a lady from the Ahmas tribe called ZainabbintAl-Muhajir and found that she \nrefused to speak. He asked, \"Why does she not speak.\" The people said, \"She has intended to perform \nHajj without speaking.\" He said to her, \"Speak, for it is illegal not to speak, as it is an action of the \npre-islamic period of ignorance. So she spoke and said, \"Who are you?\" He said, \"A man from the \nEmigrants.\" She asked, \"Which Emigrants?\" He replied, \"From Quraish.\" She asked, \"From what \nbranch of Quraish are you?\" He said, \"You ask too many questions; I am AbuBakr.\" She said, \"How \nlong shall we enjoy this good order (i.e. Islamic religion) which Allah has brought after the period of \nignorance?\" He said, \"You will enjoy it as long as your Imams keep on abiding by its rules and \nregulations.\" She asked, \"What are the Imams?\" He said, \"Were there not heads and chiefs of your \nnation who used to order the people and they used to obey them?\" She said, \"Yes.\" He said, \"So they \n(i.e. the Imams) are those whom I meant.\""
        }
      ]
    }
  ]
}