{
  "data": [
    {
      "hadith": [
        {
          "body": "It was narrated from Yahya bin Sa'eed, from 'Amrahbint'Abdur-Rahman, that she told him about HabibahbintSahl:\"She was married to Thabit bin Qais bin Shammas. The Messenger of Allah went out to pray As-Subh and he found HabibahbintSahlat his door at the end of the night. The Messenger of Allah said: 'Who is this?' She said: 'I am HabibahbintSahl, O Messenger of Allah.' He said: 'What is the matter?' She said: 'I cannot live with Thabit bin Qais' -her husband. When Thabit bin Qais came, the Messenger of Allah said to him: 'Here is HabibahbintSahland she has said what Allah willed she should say.' Habibah said: 'O Messenger of Allah, everything that he gave me is with me.' The Messenger of Allah said: 'Take it from her.' So he took it from her and she stayed with her family.\""
        },
        {
          "body": "Yahya related. to me from Malik from Yahya ibn Said that AmrabintAbd ar-Rahman told him from HabibabintSahlal-Ansari that she\nhad been the wife of Thabit ibn Qays ibn Shammas. The Messenger of\nAllah, may Allah bless him and grant him peace, went out for the dawn\nprayer, and found HabibabintSahlat his door in the darkness. The\nMessenger of Allah, may Allah bless him and grant him peace, said to\nher, \"Who is this?\" She said, \"I am HabibabintSahl, Messenger of\nAllah.\" He said, \"What do you want?\" She said, \"That Thabit ibn Qays\nand I separate.\" When her husband, Thabit ibn Qays came, the Messenger\nof Allah, may Allah bless him and grant him peace, said to him, \"This\nis HabibabintSahl. She mentioned what Allah willed that she\nmention.\" Habiba said, \"Messenger of Allah, all that he has given me\nis with me!\" The Messenger of Allah, may Allah bless him and grant him\npeace, said to Thabit ibn Qays, \"Take it from her,\" and he took it\nfrom her, and she stayed in the house of her family."
        },
        {
          "body": "NarratedSahland Abu Usaid:The Prophet married UmaimabintSharahil, and when she was brought to him, he stretched his hand towards her. It seemed that she \ndisliked that, whereupon the Prophet ordered Abu Usaid to prepare her and to provide her with two \nwhite linen dresses."
        },
        {
          "body": "It was narrated from 'Amr bin Shu'aib, from his father, that his grandfather said:\"HabibahbintSahlwas married to Thabit bin Qais bin Shammas, who was an ugly man. She said: 'O Messenger of Allah, (SAW)  by Allah, were it not for fear of Allah when he enters upon me I would spit in his face.' The Messenger of Allah  (SAW) said: 'Will you give him back his garden?' She :said: 'Yes.' So she gave him back his garden and the Messenger of Allah (SAW) separated them.\""
        },
        {
          "body": "NarratedSahlibn AbuHathmah:The Prophet (saws) said: When one of you prays facing a sutrah he should keep close to it, and not let the devil interrupt his prayer.Abu Dawud said: This tradition has also been narrated by Waqid b. Muhammad from Safwan from Muhammad b.Sahlon the authority of his father, or on the authority of Muhammad b.Sahlfrom the Prophet (saws). Some have narrated it from Nafi' b. Jubair on the authority ofSahlb. Sa'd. There is a variation in the chain of its narrators."
        },
        {
          "body": "NarratedSahlbin Abu Hathma:`Abdullah binSahland Muhaiyisa bin Mas`ud bin Zaid went to Khaibar when it had a peace treaty \n(with the Muslims)."
        },
        {
          "body": "Yahya related to me from Malik that Muhammad ibn Abi Umama ibnSahlibn Hunayf heard his father say, \"My father,Sahlibn Hunayf did\na ghusl at al-Kharrar. He removed the jubbah he had on while Amir ibn\nRabia was watching, andSahlwas a man with beautiful white skin. Amir\nsaid to him, 'I have never seen anything like what I have seen today,\nnot even the skin of a virgin.'Sahlfell ill on the spot, and his\ncondition grew worse. Somebody went to the Messenger of Allah, may\nAllah bless him and grant him peace, and told him thatSahlwas ill,\nand could not go with him. The Messenger of Allah, may Allah bless him\nand grant him peace, came to him, andSahltold him what had happened\nwith Amir. The Messenger of Allah, may Allah bless him and grant him\npeace, said, 'Why does one of you kill his brother? Why did you not\nsay, \"May Allah bless you?\" (ta baraka-llah) The evil eye is true. Do\nwudu from it.' Amir did wudu from it andSahlwent with the Messenger\nof Allah, may Allah bless him and grant him peace, and there was\nnothing wrong with him.\""
        },
        {
          "body": "Narrated Anas [may Allah be pleased with him]:that the Prophet (SAW) said: \"Sufficient for you among the women of mankind are Mariambint'Imran, KhadijahbintKhuwailid, FatimahbintMuhammad and Asiyah the wife of Fir'awn.\""
        },
        {
          "body": "Narrated Abu Hazim:that he askedSahl, \"Did you use white flour during the lifetime of the Prophet ?\"Sahlreplied, \"No. \nHazim asked, \"Did you use to sift barley flour?\" He said, \"No, but we used to blow off the husk (of \nthe barley)."
        },
        {
          "body": "NarratedSahlbin Sa`d:I heard the Prophet saying, \"The people will be gathered on the Day of Resurrection on reddish white \nland like a pure loaf of bread (made of pure fine flour).\"Sahladded: That land will have no landmarks \nfor anybody (to make use of)."
        },
        {
          "body": "It was narrated fromSahlbin Ab Hathmah and Rafi bin Khadij that:Muhayysah bin Mas'ud and 'Abdullah binSahlwent to Khaibar for some need they had there, and they parted among the palm trees. 'Abdullah binSahlwas killed, and 'Abdullah binSahlwas killed, and his brother 'Abdur-Rahman bin Shl, and Huwayysah, and Musayysah, his paternal cousins, came to the Messenger of Allah. 'Abdur-Rahan spoke about his brother's case, but he was the youngest of them, so the Messenger of Allah said: \"Let the elders speak first.\" So they spoke about their companions, and the Messenger of Allah said: Let fifty of your swear an oath.\" The said: \"O Messenger of Allah, it is something that we did not witness: how can we swear an oath?\" He said: \"Then let the Jews swear fifty oaths to their innocence.\" They said: \"O Messenger of Allah, they area) a disbelieving people,\" So the Messenger of Allah paid the blood money himselfSahlsaid: \"I entered a Mirbad of theirs, and one of those camels kicked me.\""
        },
        {
          "body": "Narrated Abu Hazim:A man came toSahlbin Sa`d and said, \"This is so-and-so,\" meaning the Governor of Medina, \"He is \ncalling `Ali bad names near the pulpit.\"Sahlasked, \"What is he saying?\" He (i.e. the man) replied, \n\"He calls him (i.e. `Ali) Abu Turab.\"Sahllaughed and said, \"By Allah, none but the Prophet called \nhim by this name and no name was dearer to `Ali than this.\" So I askedSahlto tell me more, saying, \n\"O Abu `Abbas! How (was this name given to `Ali)?\"Sahlsaid, \"`Ali went to Fatima and then came \nout and slept in the Mosque. The Prophet asked Fatima, \"Where is your cousin?\" She said, \"In the \nMosque.\" The Prophet went to him and found that his (i.e. `Ali's) covering sheet had slipped of his \nback and dust had soiled his back. The Prophet started wiping the dust off his back and said twice, \n\"Get up! O Abu Turab (i.e. O. man with the dust)."
        },
        {
          "body": "NarratedSahlbin Abi Hatamah:Yahya (one of the narrators) said: And I think it was from Rafi' bin Khadij - that 'Abdullah binSahlbin Zaid and Muhaiysah bin Mas'ud bin Zaid went out and when they reached Khaibar they separated while there. Then Muhayyisah found 'Abdullah binSahlmurdered [so he buried him]. Then he went to the Messenger of Allah (saws) along with Huwayyisah bin Mas'ud and Abdur-Rahman binSahl. The youngest of the people, Abdur-Rahman, went to speak ahead of his companions. The Messenger of Allah (saws) said to him: \"Let the eldest of you speak.\" So he was silent and two companions spoke. So he conversed with them and they mentioned to the Messenger of Allah (saws) about the murder of 'Abdullah binSahl. He said to them: \"If fifty of you can swear an oath then you will have the right against the murderer.\" They said: \"How can we take an oath when we did not witness it?\" He said: \"Then fifty of Jews can swear to clear the charge with you?\" They said: \"How could we accept the oaths of a disbelieving people?\" So when he saw that, the Messenger of Allah (saws) paid the blood-money.\" \n(Another Chain) fromSahlbin Abi Hathman and Rafi' bin Khadij, and the meaning is similar to this Hadith."
        },
        {
          "body": "It was\nnarrated that Abu Umamah binSahlbin Hunaif said:“ ‘Amir bin\nRabi’ah passed bySahlbin Hunaif when he was having a bath, and\nsaid:\n‘I have never seen such beautiful skin.’ Straightaway, he\n(Sahl) fell\nto the ground. He was brought to the Prophet (saw) and it\nwas said:\n‘Sahlhas had a fit.’ He said: ‘Whom do you accuse\nwith regard to\nhim?’ They said: “ ‘Amir bin Rabi’ah.’ They\nsaid: ‘Why would anyone of\nyou kill his brother? If he sees\nsomething that he likes, then let him\npray for blessing for him.’\nThen he called for water, and he told\n‘Amir to perform ablution,\nthen he washed his face and his arms up to\nthe elbows, his knees and\ninside his lower garment, then he told him\nto pour the water over\nhim.”"
        },
        {
          "body": "It was narrated from Bushair bin Yasar that:'Abdullah binSahlAl-Ansari and Muhayysah bin Mas'ud went out to Khaibar, where they went their separate ways to go about their business. 'Abdullah binSahlwas killed, and Muhayysah came (to Madinah) and went with his brother Huwayysah and 'Abdur-Rahman binSahlto the Messenger of Allah. 'Abdur-Rahaman started to speak, because of his position as brother (of the slain man) but the Messenger of Allah said: \"Let the elders speak first.\" So Huyysah and Muhayysah spoken, and told him about what happened to 'Abdullah binSahl. The Messenger of Allah said to them: \"Will you sewer fifty oaths, then you will receive compensation or be entitled to retaliate?\" (In his narration) Malik said: \"Yahya said: 'Bushair said that the Messenger of Allah paid the blood money himself, but Sa'eed bin 'Ubaid At-Ta'l disagreed with them (in reporting that).''"
        },
        {
          "body": "Sahlbin\nAbu Umamah binSahlbin Hunaif narrated from his father,\nfrom his\ngrandfather that the Prophet (saw) said:“Whoever asks Allah\nfor\nmartyrdom, sincerely from his heart, Allah will cause him to reach\nthe status of the martyrs even if he dies in his bed.”"
        },
        {
          "body": "Sahlbin Abi Umamah binSahlbin Hunaif narrated from his father, from his grandfather, that the Messenger of Allah (PBUH) said:\"Whoever asks Allah, the mighty and Sublime, sincerely for martyrdom, Allah will cause him to reach the status of the martyrs even of he dies in his bed.\""
        },
        {
          "body": "Yahya related to me from Malik from Abu Bakr ibn Uthman ibnSahlibn Hunayf that he had heard Abu Umama ibnSahlibn Hunayf say, \"We\nused to attend funeral processions, and the last of the people would\nnot sit until they had been given permission .\""
        },
        {
          "body": "Sahlbin Abi Khaithamah (RAA) narrated on the authority of some honored men from his people that 'Abdullah binSahland Muhaiysah bin Mas'ud, went out to Khaibar because of a hardship they were undergoing. Muhaiysah came and told them that 'Abdullah binSahlhad been killed and thrown into a well. He came to the Jews and said to them, ‘I swear by Allah that you have killed him.’ They replied, ‘We swear by Allah that we have not killed him.' Then Muhaiysah came along with his brother Huwaiysah and 'Abdur Rahman binSahlto the Prophet (P.B.U.H.) and Muhaiysah started to talk. The Messenger of Allah (P.B.U.H.) said to him, “Let an older one speak (take charge of this matter).” So Huwaiysah narrated what happened and then Muhaiysah spoke. The Messenger of Allah (P.B.U.H.) said, “Either they pay the Diyah of your companion or be ready for war.” The Messenger of Allah (P.B.U.H.) wrote to them about this and they wrote back saying, ‘By Allah, we have not killed him.’ The Messenger of Allah (P.B.U.H.) then said to Huwaiysah, Muhaiysah and 'Abdur Rahman binSahl, “Would you take an oath (that they killed him) and then you will be entitled to the Diyah of your companion” 'They answered, ‘No (as they did not witness the crime).’The Messenger of Allah then said, “Then the Jews should take an oath (that they are innocent).” They said, ‘They are not Muslims.’ The Messenger of Allah (P.B.U.H.) thereupon paid the Diyah of the victim himself and sent them 100 camels.Sahlcommented, ‘A red she-camel (of these 100 camels) kicked me.’ Agreed upon."
        },
        {
          "body": "It was narrated from Abu Laila bin 'Abdullah bin 'Abdur-Rahman binSahl, fromSahlbin Abi Hathmah, that:he informed him, ans some men among the elders of his people, that \"Abdullah binSahland Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah, and he told him that 'Abdullah binSahlhad been killed and thrown into a pit or well. He came to the Jews and said: \"By Allah, you killed him.\" They said: \"By Allah, we did not kill him.\" Then he went baack to his people and told them about that. Then he and his brother Huwayysah, who was older than him, and 'Abdur-Rahman binSahl, came (to the prophet). Muhayysah, who was the one who had been at Khaibar, bnegan to speak, but the Messenger of Allah said: \"Let the elder speak first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your companion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the Jews swear an oath for you?\" They said: \"They are not Muslims.\" So the Messenger of Allah paid it himself, and he sent one hundred she-camels to their abodes.Sahlsaid: \"A red she-camel from among them kicked me.\""
        },
        {
          "body": "Malik related to me from Ibn Shihab that Abu Umama ibnSahlibn\nHunayf said, ''Amir ibn Rabia sawSahlibn Hunayf doing a ghusl and\nsaid, 'I have not seen the like of what I see today, not even the skin\nof a maiden who has never been out of doors.'Sahlfell to the ground.\nThe Messenger of Allah, may Allah bless him and grant him peace, was\napproached and it was said, 'Messenger of Allah, can you do anything\naboutSahlibn Hunayf? By Allah, he can not raise his head.' He said,\n'Do you suspect anyone of it?' They said, 'We suspect Amir ibn Rabia.'\n\"He continued, \"The Messenger of Allah, may Allah bless him\nand grant him peace, summoned Amir and was furious with him and said,\n'Why does one of you kill his brother? Why did you not say, \"May Allah\nbless you?\" Do ghusl for it.' Amir washed his face, hands, elbows,\nknees, the end of his feet, and inside his lower garment in a vessel.\nThen he poured it over him, andSahlwent off with the people, and\nthere was nothing wrong with him.\""
        },
        {
          "body": "Anas bin Malik narrated that:Abu Bakr Siddiq wrote to him: “In the name of Allah, the Most Gracious, the Most Merciful. This is the obligation of Sadaqah which the Messenger of Allah enjoined upon the Muslims, as Allah commanded the Messenger of Allah. The ages of camels to be given (in Zakat) may be made up in sheep. So if a man has camels on which the Sadaqah is a Jadha'ah (a four-year-old she-camel) and he does not have a Jadha'ah but he has a Hiqqah (a three year old she-camel), then the Hiqqah should be accepted from him, and two sheep should be given (in addition), if they are readily available, or twenty Dirham. If a man has camels on which the Sadaqah is a Hiqqah, and he only has a Bin Labun( a two-year-old she-camel), then theBintLabun should be accepted from him, along with two sheep or twenty Dirhams.If a man has camels on which the sadaqah is aBintLabun, and he does not have one, but he has a Hiqqah, then it should be accepted from him, and the Zakat collector should give him back twenty Dirham or two sheep. If a man has camels on which Sadaqah is aBintLabun, and he does not have one, but he has aBintMakhad(a one-year-old she-camel), then theBintMakhad should be accepted from him, along with twenty Dirham or two sheep. If a man has camels on which the Sadaqah is aBintMakhad, and he does not have one, but he has aBintLabun, then theBintLabun should be accepted from him, and the Zakat collector should give him back twenty Dirhams or two sheep. Whoever does not have aBintMakhad, but he has aBintLabun (a two-year-old male camel), then it should be accepted from him and nothing else should be given along with it.' ”"
        },
        {
          "body": "Yahya related to me from Malik from Abu Hazim ibn Dinar thatSahlibn Sad said, \"People used to be ordered to place their right hands on\ntheir left forearms in the prayer.\"Abu Hazim added, \"I know\nfor sure thatSahltraces that back to the Prophet, may Allah bless\nhim and grant him peace.\""
        },
        {
          "body": "In Mas'ud said:\"The Messenger of Allah ruled that the Diyah for accidental killing is twentyBintMakhad, twenty Bin Makhad, twentyBintLabur, twenty Jadh'ah, and twenty Hiqqah.\""
        },
        {
          "body": "Narrated 'Ali bin Abi Talib:that the Messenger of Allah (SAW) said: \"The best of its women is KhadijahbintKhuwailid, and the best of its women is Mariambint'Imran.\""
        },
        {
          "body": "A hadith like this has been transmitted bySahlb. Sa'd."
        },
        {
          "body": "NarratedSahlbin Sa`d:similarly as above (182)."
        },
        {
          "body": "NarratedSahlbin Sa`d:Abu Usaid As-Sa`idi invited the Prophet to his wedding party and his wife served him on that day, \nand she was the bride. She said (orSahlsaid), \"Do you know what she soaked for Allah's Apostle? \nShe soaked some dates for him (in water) in a drinking bowl overnight.\""
        },
        {
          "body": "Narrated Abu An-Nadr:From 'Ubaidullah bin 'Abdullah bin 'Utbah, that he entered upon Abu Talhah Al-Ansari to pay him a visit (while he was ill), and he foundSahlbin Hunaif with him. He said: \"Abu Talhah called for someone to remove a sheet that was under him.Sahlsaid to him: 'Why did you remove it?' He replied: 'Because it contains images on it, and the Prophet (saws) said about them what you know.'Sahlsaid: 'Do he not say: Except for markings on a garment?' He said: 'Yes, but this is better to me.'\"[Abu 'Eisa said:] This Hadith is Hasan Sahih."
        },
        {
          "body": "This hadith is reported on the authority ofSahlb. Sa'd with a slight variation of wording."
        },
        {
          "body": "It was narrated thatSahlbin Abi Hathmah said:\"Abdullah binSahlwas found slain, and his brother, and two paternal uncles, Huwayysah and Huwayisaah, who were the paternal uncles of 'Abdullah binSahl, came to the Messenger of Allah. 'Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first.\" They said: \"O Messenger of Allah, we found 'Abdullah binSahlslain in one of the dry wells of Khaibar.\" The prophet said: \"Whom do you suspect? They said: \"We suspect the Jews.\" He said: \"Will you swear fifty oaths saying that the Jews killed him?\" They said: \"How can we swear an oath about something that we did not see?\" He said: \"Then can the Jews swear fifty oaths declaring that they did not kill him?\" They said:\"How can we accept their oaths, when they are Mushrikun?\" So the Messenger of Allah paid the blood money himself. (Sahih)\nMalik narrated this in Mursal from."
        },
        {
          "body": "NarratedSahlibn Sa'd:The Prophet (saws) said: Two (prayers) are not rejected, or seldom rejected: Prayer at the time of the call to prayer, and (the prayer) at the time of fighting, when the people grapple with each other. Musa said: Rizq ibn Sa'id ibn AbdurRahman reported from AbuHazim on the authority ofSahlibn Sa'd from the Prophet (saws) as saying: And while it is raining."
        },
        {
          "body": "Narrated Abu Hazim:Sahlbin Sa`d As-Sa`idi, was asked by the people, \"With what was the wound of the Prophet treated?Sahlreplied, \"None remains among the people living who knows that better than I. `Ali [??] used to \nbring water in his shield and Fatima used to wash the blood off his face. Then straw mat was burnt \nand the wound was filled with it.\""
        },
        {
          "body": "Sahlb. Sa'd reported:An Arab woman was mentioned before Allah's Messenger (may peace be upon him). He commanded Abu Usaid to send a message to her and he (accordingly) sent a message to her. She came and stayed in the fortresses of Banu Sa'idah. Allah's Messenger (may peace be upon him) went out until he came to her while she was (at that time) sitting with her head downcast. When Allah's Messenger (may peace be upon him) talked to her, she said: I seek refuge with Allah from you. Thereupon he said: I (have decided to) keep you away from me. They (the people near her) said: Do you know who he is? She said: No. They said: He is the Messenger of Allah (may peace be upon him). He came to you in order to give you the proposal of marriage. She said: Then I am the most unfortunate woman because of this (i. e. my defiance).Sahlsaid: Allah's. Messenger (may peace be upon him) then set forth on that day until he sat in the Saqifa of Banu Sa'idah along with his Companions. He then said toSahl: Serve us drink. He (Sahl) said: I brought out for them this bowl (containing drink) and served them this. Abu Hazim said:Sahlbrought out this cup for us and we also drank from that. Then 'Umar b. 'Abd al-'Aziz asked him to give that (cup) as a gift to him and he gave (it to) him as a gift. In the narration of Abu Bakr b. Ishaq (the words) are:\"Sahl, serve us drink.\""
        },
        {
          "body": "NarratedSahlbin Abi Umamah binSahlbin Hunaif:From his father, from his grandfather, that the Prophet (saws) said: \"Whoever asks Allah for Martyrdom sincerely in his heart, Allah will grant the status of martyrdom for him, even if he were to die in his bed.\"[Abu 'Eisa said:] This Hadith is Hasan Gharib as a narration ofSahlbin Hunaif. We do not know of it except from the report of 'Abdur-Rahman bin Shuraih. 'Abdullah bin Salih reported it from 'Abdur-Rahman bin Shuraih, and 'Abdur-Rahman bin Shuraih's kunyah is Abu Shuriah, and he is from Iskandarani.There is something on this topic from Mu'adh bin Jabal."
        },
        {
          "body": "Sahlibn Sa'd said, \"If there is bad luck in anything, it is in\nhouses, women and horses.\""
        },
        {
          "body": "A hadith like this has been narrated on the authority ofSahlb. Abu Hathma."
        },
        {
          "body": "It was narrated from Yahya, from Bushair bin Yasa, fromSahlbin Abi Hathmah who said - and I think he said:and from Rafi bin Khadij, the two of them said - :\"Abdullah binSahlbin Zaid and Muhayysah bin Mas'ud went out until when they reached Khaibar, they went their separate ways. Then Muhayysah found 'Abdullah binSahlslain, so he buried him. Then he came to the Mesenger of Allah, along with Huwayysah bin Mas'ud and 'Abdur-Rahman binSahl, who was the youngest of them, 'Abdur-Rahman started to speak before his two companions, but the Messenger of Allah said to him: \"Let the clear speak first.\" So he fell silent and his two companions spoke, then he spoke with them. They told the Messenger of Allah about the killing of 'Abdullah binSahl, and he said to them: \"Will you swear fifty oaths, then you will receive compensation, or be entitled to retaliate?\" They said: \"How can we swear an oath when we did not witness what happened?\" he said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"How can we accept the oath of a disbelieving people?\" When the Messenger of Allah saw that, he paid the blood money (himself)."
        },
        {
          "body": "This hadith has been narrated by the chain of transmitters by AbuSahl'Uthman b. Hakim."
        },
        {
          "body": "NarratedSahl:We used to offer the Jumua prayer with the Prophet and then take the afternoon nap."
        },
        {
          "body": "This hadith has been narrated on the authority ofSahlb. Sa'd with a different chain of transmitters."
        },
        {
          "body": "Sahlb. Sa'd said:We had a siesta or lunch after the Friday prayer."
        },
        {
          "body": "Narrated Rafi` bin Khadij andSahlbin Abu Hathma:`Abdullah binSahland Muhaiyisa bin Mas`ud went to Khaibar and they dispersed in the gardens of \nthe date-palm trees. `Abdullah binSahlwas murdered. Then `Abdur-Rahman binSahl, Huwaiyisa and \nMuhaiyisa, the two sons of Mas`ud, came to the Prophet and spoke about the case of their (murdered) \nfriend. `Abdur-Rahman who was the youngest of them all, started talking. The Prophet said, \"Let the \nolder (among you) speak first.\" So they spoke about the case of their (murdered) friend. The Prophet \nsaid, \"Will fifty of you take an oath whereby you will have the right to receive the blood money of \nyour murdered man,\" (or said, \"..your companion\"). They said, \"O Allah's Apostle! The murder was a \nthing we did not witness.\" The Prophet said, \"Then the Jews will release you from the oath, if fifty of \nthem (the Jews) should take an oath to contradict your claim.\" They said, \"O Allah's Apostle! They \nare disbelievers (and they will take a false oath).\" Then Allah's Apostle himself paid the blood money \nto them."
        },
        {
          "body": "Sahlbin Abu Hathmah Al-Ansari (May Allah be pleased with him) reported:'Abdullah binSahland Muhaiyisah bin Mas'ud (May Allah be pleased with them) went to Khaibar during the period of the truce (after its conquest) and they separated to perform their duties. When Muhaiyisah returned to `Abdullah binSahl, he found him murdered, drenched in his blood. So he buried him and returned to Al-Madinah. Then `Abdur-Rahman binSahl, Huwaiyisah and Muhaiyisah, the two sons of Mas`ud went to Messenger of Allah (PBUH) and spoke about the case of their (murdered) friend. `Abdur-Rahman, who was the youngest of them all, started talking. Messenger of Allah (PBUH) said, \"Let those older than you speak first.\" So he stopped talking and the (other two) spoke about the case of their (murdered) friend. Messenger of Allah (PBUH) said, \"Will you take an oath whereby you will have the right to receive the blood money of your murdered man?\" And mentioned the rest of the Hadith. [Al-Bukhari and Muslim]."
        },
        {
          "body": "Narrated Abu Hazim:Sahlbin Sa`d said, \"Abu Usaid, the companion of the Prophet, got married, so he invited the Prophet \nto his wedding party, and the bride herself served them.Sahlsaid to the People, 'Do you know what \ndrink she served him with? She infused some dates in a pot at night and the next morning she served \nhim with the infusion.\""
        },
        {
          "body": "Narrated Ibn Mas'ud:\"The Messenger of Allah (saws) judged for the accidental blood-Money: TwentyBintMakhad, twenty make Ibn Makhad, twentyBintLabunm twenty Jadha'ah, and twenty Hiqqah.\n\n(Another chain) with similar meaning."
        },
        {
          "body": "It was\nnarrated thatSahlbin Sa’d said:“The Messenger of Allah\n(saw)\nused to eat dates with melon.”"
        },
        {
          "body": "It was narrated that Abu Umamah binSahlsaid:\"The pommel of the sword of the Messenger of Allah [SAW] was of silver.\""
        },
        {
          "body": "This hadith has been transmitted on the authority ofSahlb. Sa'd as-Sa'idi with a slight variation of wording."
        },
        {
          "body": "NarratedSahl:In our garden there was a horse belonging to the Prophet called Al-Luhaif or Al-Lakhif."
        },
        {
          "body": "It was narrated thatSahlbin Sa'd said:\"A woman brought a Burdah\" -Sahlsaid: \"Do you know what a Burdah is?\" They said: \"Yes, it is a cloak with two woven borders\" - and she said: 'O Messenger of Allah, I wove this with my own hands for you to wear.' The Messenger of Allah [SAW] took it as he had need of it, then he came out to us and he was wearing it as his Izar (lower garment).\""
        },
        {
          "body": "Malik related to me from Abu'n-Nasr that Ubaydullah ibn Abdullah\nibn Utba ibn Masud went to visit Abu Talha al-Ansari when he was ill.\nHe said, \"I foundSahlibn Hunayf with him. Abu Talha summoned a man\nand removed a rug which was under him.Sahlibn Hunayf said to him,\n'Why did you remove it?' He said, 'Because there were pictures on it,\nand the Messenger of Allah, may Allah bless him and grant him peace,\nsaid what you know about them.'Sahlreplied, 'Didn't the Messenger of\nAllah, may Allah bless him and grant him peace, say, \"except for\nmarkings on a garment?\"' (A rug was considered a garment). He said,\n'Yes, but it is more pleasing to myself.' \""
        },
        {
          "body": "Narrated Abu Hazim:I askedSahlbin Sa`d, \"Did Allah's Apostle ever eat white flour?\"Sahlsaid, \"Allah's Apostle never \nsaw white flour since Allah sent him as an Apostle till He took him unto Him.\" I asked, \"Did the \npeople have (use) sieves during the lifetime of Allah's Apostle?\"Sahlsaid, \"Allah's Apostle never saw \n(used) a sieve since Allah sent him as an Apostle until He took him unto Him,\" I said, \"How could \nyou eat barley unsifted?\" he said, \"We used to grind it and then blow off its husk, and after the husk \nflew away, we used to prepare the dough (bake) and eat it.\""
        },
        {
          "body": "NarratedSahl:A woman brought a woven Burda (sheet) having edging (border) to the Prophet, ThenSahlasked \nthem whether they knew what is Burda, they said that Burda is a cloak andSahlconfirmed their reply. \nThen the woman said, \"I have woven it with my own hands and I have brought it so that you may \nwear it.\" The Prophet accepted it, and at that time he was in need of it. So he came out wearing it as \nhis waist-sheet. A man praised it and said, \"Will you give it to me? How nice it is!\" The other people \nsaid, \"You have not done the right thing as the Prophet is in need of it and you have asked for it when \nyou know that he never turns down anybody's request.\" The man replied, \"By Allah, I have not asked \nfor it to wear it but to make it my shroud.\" Later it was his shroud."
        },
        {
          "body": "This hadith has been narrated on the authority ofSahlb. Abu Hathma through another chain of transmitters."
        },
        {
          "body": "Rafi' ibn Khudayj andSahlibn Abi Hathama reported that 'Abdullah\nibnSahland Muhayyisa ibn Mas'ud came to Khaybar and parted when they\nwere among the palm trees. 'Abdullah ibnSahlwas murdered. 'Abdu'r-Rahman\nibnSahland Huwayyisa and Muhayyisa, the sons of Mas'ud came to the Prophet,\nmay Allah bless him and grant him peace, and spoke to him about their (murdered)\ncompanion. 'Abdu'r-Rahman, the youngest of those present, began to speak,\nbut the Prophet, may Allah bless him and grant him peace, said, \"Let the\noldest speak first.\" (or \"Exalt the eldest.\") They spoke about their companion\nand the Prophet, may Allah bless him and grant him peace, asked, \"Will\nfifty of you take an oath that you are entitled to the blood-money of your\nmurdered man?\" They replied, \"Messenger of Allah, this is something which\nwe did not see.\" He said, \"Then will the Jews exonerate themselves by the\noaths of fifty of them?\" They protested, \"Messenger of Allah, they are\nunbelievers!\" So the Messenger of Allah, may Allah bless him and grant\nhim peace, himself paid his blood money.\""
        },
        {
          "body": "It was narratd thatSahlbin Abi Hatmah said:\"Abdullah binSahland Muhayysah bin Mas'ud bin Zaid went to Khaibar, and at that time there was a peace treaty. They went their separatea ways to go about their business, then Muhayysah came upon 'Abdullah binSahllying dead in a pool of blood. He buried him, then he camae to Al-Madinah. 'Abdur-Rahman binSahland Huwhayysah, and Muhayysah, the tow sons of Nas'ud, came to the Messenger of Allah, and \"Abdur-Rahman started to speak, but the Messenger of Allah said: \"Let the elders speak first,\" for he was the youngest of them. So he fell silent and they (the other two) spoke. The Messenger of Allah said: \"Will you sear fifty oaths, then you will receive compensation or be entitled to retaliate?\" They said: \"O Messenger of Allah, how can we a wear and oath when we did not witness and did not see (what happened)\" He said: \"Then can the Jews swear fifty oaths declaring their innocence?\" They said: \"O Messenger of Allah, how can we accept the oath of a disbelieving people?\" So the Messenger of Allah paid the blood money himself."
        },
        {
          "body": "It has been reported on the authority ofSahlb. Aba Umama b.Sahlb. Hunaif who learned the tradition from his father who (in turn) learned it from his grandfather-that the Messenger of Allah (may peace be upon him) said:Who sought martyrdom with sincerity will be ranked by Allah among the martyrs even if he died on his bed. In his version of the tradition Abd Tahir did not mention the words:\" with sincerity\"."
        },
        {
          "body": "Abu Humaid reported to the same effect. He said:When he (the Prophet) prostrated he kept his thighs wide and did not let his belly touch the thighs.Abu Dawud says that Ibn Mubarak narrated this hadith from ‘Abbas b.Sahl, which he did not remember well. It is thought that he has mentioned ‘Isa b. ‘Abd Allah, ‘Abbas b.Sahland Abu Humaid al-Sa’idi."
        },
        {
          "body": "It was narrated fromSahlbin Abi Hathmah that:'Abdullah binSahland Muhayysah set out for Khaibar because of some problem that had arisen. Someone came to Muhayysah and he told him that 'Abdullah binSahlhad been Killed and thrown into a pit, or a well. He came to the Jews and said: \"By Allah, you killed him. \" They said: \"By Allah, we did not kill him.\"Then he went back to the Messenger of Allah and told him about that. Then he and Huwayysah  - his brother who was older than him - and 'Abdur-Rahman binSahl, came (to the Prophet). Muhayysah, who was the one who had been at Khaibar, began to speak, but the messenger of Allah said: \"Let the elder speak first,\" So Huwayysah elder speaks first.\" So Huwayysah spoke, then Muhayysah spoke. The Messenger of Allah said: \"Either (the Jews) will pay the Diyah for your comanion, or war will be declared on them.\" The Messenger of Allah sent a letter to that effect (to the Jews) and they wrote back saying: \"By Allah, we did not kill him.\" The Messenger of Allah said to Huwayysah. Muhayysah and 'Abdur-Rahman: \"Will you swear an oath establishing your claim to the blood money of your companion?\" They said: \"No.\" He said: \"Should the jews swear an oath for you? They said: \"They are not Muslims.\" So the Messenger of Allah paid (the Diyah) himself, and he sent one hundred she-camels to their abodes.Sahlsaid: \"A red she-camel from among them kicked me.\""
        },
        {
          "body": "Sahlb. Abu Hathma and Rafi' b. Khadij reported that 'Abdullah b.Sahlb. Zaid and Muhayyisa b. Mas'ud b. Zaid went out and as they reached Khaibar they were separated. Then Muhayyisa found 'Abdullah b.Sahlhaving been killed. He buried him, and then came to Allah's Messenger (may peace be upon him). They were Huwayyisa b. Mas'ud and 'Abd al-Rahman b.Sahl, and he (the latter one) was the youngest of the people (those three who had come to seek an interview with the Holy Prophet) began to talk before his Companions (had spoken). Thereupon Allah's Messenger (may peace be upon him) said:The eldest one (eldest in regard to age should speak). So he kept quiet, and his companions (Muhayyisa and Huwayyisa) began to speak, and he ('Abd al Rahman) spoke along with them and they narrated to Allah's Messenger (may peace be upon him) the murder of 'Abdullah b.Sahl. Thereupon he said to them: Are you prepared to take fifty oaths so that you may be entitled (to blood-wit) of your companion (or your man who has murdered)? They said: How can we take an oath on a matter which we have not witnessed? He (the Holy Prophet) said: Then the Jews will exonerate themselves by fifty oaths. They said: How can we accept the oaths of people who are unbelievers? When Allah's Messenger (may peace be upon him) saw that, he himself paid his blood-wit."
        },
        {
          "body": "Sahl. b. Abu Hathma and Rafi' b. Khadij reported that Muhayyisa b. Mas'ud and 'Abdullah b.Sahlwent towards Khaibar and they separated near the palm-trees. 'Abdullah b.Sahlwas killed. They accused the Jews (for this act). And there came to Allah's Apostle (may peace be upon him) his brother (the brother of the slain person) 'Abd al-Rahman and his cousins Huwayyisa and Muhayyisa; and 'Abd al-Rahman talked to him about the matter pertaining to (the murder of) his brother, and he was the youngest among them. Thereupon Allah's Messenger (may peace be upon him) said:Show regard for the greatness of the old, or he said: Let the eldest begin speaking. Then they (Huwayyisa and Muhayyisa) spoke about the matter of their companion (murder of their cousin, 'Abdullah b.Sahl). Thereupon Allah's Messenger (may peace be upon him) said: Let fifty (persons) among you take oath for levelling the charge (of murder) against a person amongst them, and he would be surrendered to you. They said: We have not witnessed this matter ourselves. How can we then take oath? He (the Holy Prophet) said: The Jews will exonerate themselves by the oaths of fifty of them. They said: Messenger of Allah, they are non-believing people. Thereupon Allah's Messenger (may peace be upon him) paid the blood wit for him.Sahlsaid: As one day I entered the fold a she-camel amongst those camels hit me with its leg."
        },
        {
          "body": "It was\nnarrated fromSahlbin Sa’d As-Sa’idi that the Messenger of\nAllah\n(saw) said:“The Tasbih is for men and clapping is for women.”"
        },
        {
          "body": "NarratedSahlbin Sa`d:Allah's Apostle said, \"If at all there is bad omen, it is in the horse, the woman, and the house.\""
        },
        {
          "body": "NarratedSahlbin Sa`d:The Prophet said to a man, \"Marry, even with (a Mahr equal to) an iron ring.\""
        },
        {
          "body": "NarratedSahl:The distance between the pulpit and the wall of the mosque on the side of the Qibla was just sufficient \nfor a sheep to pass through."
        },
        {
          "body": "NarratedSahlbin Sa`d:The Prophet said, \"The saying 'Sub Han Allah' is for men and clapping is for women."
        },
        {
          "body": "Abu Laila 'Abdullah b. 'Abd al-Rahman b.Sahlreported that the elderly persons of (the tribe) had informedSahlb. Abu Hathma that 'Abdullah b.Sahland Muhayyisa went out to Khaibar under some distress which had afflicted them. Muhayyisa came and informed that Abdutlah b.Sahlhad been killed, and (his dead body) had been thrown in a well or in a ditch. He came to the Jews and said:By Allah, it is you who have killed him. They said: By Allah, we have not killed him. He then came to his people, and made mention of that to them. Then came he and his brother Huwayyisa, and he was older than he, and 'Abd al-Rahman b.Sahl. Then Muhayyisa went to speak, and it was he who had accompanied ('Abdullah) to Khaibar, whereupon Allah's Messenger (may peace be upon him) said to Muhayyisa: Observe greatness of the great (he meant the seniority of age). Then Huwayyisa spoke and then Muhayyisa also spoke. Thereupon Allah's Messenger (may peace be upon him) said: They should either pay blood-wit for your companion, or be prepared for war. Allah's Messenger (may peace be upon him) wrote about it to them (to the Jews). They wrote: Verily, by Allah, we have not killed him. Thereupon Allah's Messenger (may peace be upon him) said to Huwayyisa and Muhayyisa and Abd al-Rahman: Are you prepared to take oath in order to entitle yourselves for the blood-wit of your companion? They said: No. He (the Holy Prophet) said: Then the Jews will take oath (of their innocence). They said: They are not Muslims. Allah's Messenger (may peace be upon him), however, himself paid the blood-wit to them and sent to them one hundred camels until they entered into their houses,Sahlsaid: One red she-camel among them kicked me."
        },
        {
          "body": "Sahlb. Sa‘d said, “We did not have a siesta or lunch till after the Friday prayer.” \n\n(Bukhari and Muslim.)"
        },
        {
          "body": "Ahmad reported fromSahlbin Abu Hathma's Hadith that it was the first ever husband and wife separation for compensation in Islam."
        },
        {
          "body": "It was narrated fromSahlbin Sa’d that the Prophet (saw) said:“At\nthe end of my nation there will be the earth collapsing,\ntransformations, and Qadhf.”"
        },
        {
          "body": "NarratedSahl:The Prophet said, \"The people of Paradise will see the Ghuraf (special abodes) in Paradise as you see \na star in the sky.\""
        },
        {
          "body": "Sahlbin Sa'd narrated that :the Messenger of Allah said: \"The people will remain upon goodness as long as they hasten to break the fast.\""
        },
        {
          "body": "Narrated Ibn Maqal:`Ali led the funeral prayer ofSahlbin Hunaif and said, \"He was one of the warriors of Badr.\""
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa that Fatimabintal-Mundhir said, \"We used to veil our faces when we were in ihram\nin the company of AsmabintAbi Bakr as-Siddiq.\"20.7 Wearing\nPerfume during Hajj."
        },
        {
          "body": "NarratedSahlbin Sa`d:An Arab lady was mentioned to the Prophet so he asked Abu Usaid As-Sa`idi to send for her, and he \nsent for her and she came and stayed in the castle of Bani Sa`ida. The Prophet came out and went to \nher and entered upon her. Behold, it was a lady sitting with a drooping head. When the Prophet spoke \nto her, she said, \"I seek refuge with Allah from you.\" He said, \"I grant you refuge from me.\" They said \nto her, \"Do you know who this is?\" She said, \"No.\" They said, \"This is Allah's Apostle who has come \nto command your hand in marriage.\" She said, \"I am very unlucky to lose this chance.\" Then the \nProphet and his companions went towards the shed of Bani Sa`ida and sat there. Then he said, \"Give \nus water, OSahl!\" So I took out this drinking bowl and gave them water in it. The sub-narrator added:Sahltook out for us that very drinking bowl and we all drank from it. Later on `Umar bin `Abdul \n`Aziz requestedSahlto give it to him as a present, and he gave it to him as a present."
        },
        {
          "body": "Abbas binSahl[bin Sa'd] narrated:\"Abu Humaid, Abu Usaid,Sahlbin Sa'd, and Muhammad bin Maslamah were once together and they were mentioning the Salat of Allah's Messenger. Abu Humaid said: 'I am the most knowledgeable among you of the Salat of Allah's Messenger: Allah's Messenger would bow and place his hands on his knees as if he was grasping them, and he would draw his forearms to hold them away from his sides.'\""
        },
        {
          "body": "It was narrated that Abu Bakr bin 'Uthman binSahlbin Hunaif said:\"I heard Abu Umamah binSahlsay: 'We prayed Zuhr with 'Umar bin 'Abdul-'Aziz, then we went out and entered upon Anas bin Malik, and we found him praying 'Asr.'\" I said: \"O uncle, what is this prayer that you prayed?\" He said: \"'Asr; this is the prayer of the Messenger of Allah (PBUH) that we used to pray with him.\""
        },
        {
          "body": "‘Abbas b.Sahlsaid:Abu Humaid, Abu usaid,Sahlb. Sa’d and Muhammad b. Maslamah got together. Then he narrated this tradition. He did not mention the raising of hands when he stood after two rak’ahs, nor did he mention sitting. He said: When he finished (his prostration), he spread his foot (on the ground) and turned the toes of his right feet towards the qiblah(and then he sat on his left foot)."
        },
        {
          "body": "Narrated FatimabintAl-Mundhir:Whenever a lady suffering from fever was brought to Asma'bintAbu Bakr, she used to invoke Allah \nfor her and then sprinkle some water on her body, at the chest and say, \"Allah's Apostle used to order \nus to abate fever with water.\""
        },
        {
          "body": "NarratedSahlbin Sa' (RA):The Prophet (SAW) married a man to a woman for a dowry of an iron ring.\n\n[al-Hakim reported it]."
        },
        {
          "body": "Sahlb. Sa‘d told of the Prophet being accustomed to place his two fingers opposite his shoulders and make supplication."
        },
        {
          "body": "It was narrated fromSahlbin Sa'd that:the Messenger of Allah said: \"If  it exists, it is in three things: a horse, and woman and a house,\" meaning omens."
        },
        {
          "body": "It was\nnarrated fromSahlbin Sa’d that the Prophet (saw) said:“The\npeople will remain upon goodness as long as they hasten to break\ntheir\nfast.”"
        },
        {
          "body": "It was\nnarrated thatSahlbin Sa’d said:“We did not take a Qailulah nor\neat Ghada’ until after Friday (prayer).”*"
        },
        {
          "body": "NarratedSahlbin Sa`d:We used to have a midday nap and take our meals after the Jumua (prayer)."
        },
        {
          "body": "NarratedSahl(bin Sa`d):The distance between the Musalla of Allah's Apostle and the wall was just sufficient for a sheep to \npass through ."
        },
        {
          "body": "NarratedSahl:As above with the addition: We never had an afternoon nap nor meals except after offering the Jumua \nprayer."
        },
        {
          "body": "NarratedSahlbin Sa`d:Allah's Apostle said, \"The people will remain on the right path as long as they hasten the breaking of \nthe fast.\""
        },
        {
          "body": "The same tradition has been narrated on the authority ofSahlb. Sa'd through a different chain of transmitters with a slight difference in the wording."
        },
        {
          "body": "NarratedSahlbin Sa`d Saidi:Allah's Apostle said \"If there is any evil omen in anything, then it is in the woman, the horse and the \nhouse.\""
        },
        {
          "body": "It was narrated fromSahlbin Abu Hathmah from the elders of his people that :'Abdullah binSahland Muhayyishah set out for Khaibar because of some problem that had arisen. Someone came to Muhayyishah, and he told him that Abdullah binSahlhad been killed and thrown into a pit or well in Khaibar. He came to the Jews and said: “By Allah, you killed him.” They said: “By Allah, we did not kill him.” Then he went back to his people and told them about that. Then he and his brother Huwayyisah, who was older than him, and 'Abdur-Rahman binSahl, came (to the Prophet (SAW)). Muhayyisah, who was the one who had been at Khaibar, went and he began to speak, but the Messenger of Allah (SAW) said: “Let the elder speak first.” So Huwayyisah spoke, then Muhayyisah spoke. The Messenger of Allah (SAW) said: “Either (the Jews) will pay the blood money for your companion, or war will be declared on them.” The Messenger of Allah (SAW) sent a letter to that effect (to the Jews) and they wrote back saying: “By Allah, we did not kill him.” The Messenger of Allah (SAW) said to Huwayyisah, Muhayyisah and Abdur-Rahman: “Will you swear an oath establishing your claim to the blood money of your companion?” They said: “No” He said: “Should the Jews swear an oath for you?” They said: “They are not Muslims.” So the Messenger of Allah (SAW) paid the blood money himself, and he sent one hundred she-camels to them and some of them entered the house.Sahlsaid: “A red she-camels from among them kicked me.”"
        },
        {
          "body": "Narrated Abu Laila bin `Abdullah bin `Abdur-Rahman binSahl:Sahlbin Abi Hathma and some great men of his tribe said, `Abdullah bin 'Sahland Muhaiyisa went \nout to Khaibar as they were struck with poverty and difficult living conditions. Then Muhaiyisa was \ninformed that `Abdullah had been killed and thrown in a pit or a spring. Muhaiyisa went to the Jews \nand said, \"By Allah, you have killed my companion.\" The Jews said, \"By Allah, we have not killed \nhim.\" Muhaiyisa then came back to his people and told them the story. He, his elder brother \nHuwaiyisa and `Abdur-Rahman binSahlcame (to the Prophet) and he who had been at Khaibar, \nproceeded to speak, but the Prophet said to Muhaiyisa, \"The eldest! The eldest!\" meaning, \"Let the \neldest of you speak.\" So Huwaiyisa spoke first and then Muhaiyisa. Allah's Apostle said, \"The Jews \nshould either pay the blood money of your (deceased) companion or be ready for war.\" After that \nAllah's Apostle wrote a letter to the Jews in that respect, and they wrote that they had not killed him. \nThen Allah's Apostle said to Huwaiyisa, Muhaiyisa and `Abdur-Rahman, \"Can you take an oath by \nwhich you will be entitled to take the blood money?\" They said, \"No.\" He said (to them), \"Shall we \nask the Jews to take an oath before you?\" They replied, \"But the Jews are not Muslims.\" So Allah's \nApostle gave them one-hundred she-camels as blood money from himself.Sahladded: When those \nshe-camels were made to enter the house, one of them kicked me with its leg."
        },
        {
          "body": "Sahlb. Abi Hathmah and some senior men of the tribe told that 'Abd Allah b. AbiSahland Muhayyasah came to Khaibar on account of the calamity (i.e. famine) that befall them. Muhayyasah came and told the 'Abd Allah b.Sahlhad been killed and thrown in a well or stream. He hen came to the Jews and said:I swear by Allah, you have killed him. They said: We swear by Allah, we have not killed him. He then proceeded and came to his tribe  and mentioned this to them. Then he, his brother Huwayyasah, who was older to him, and 'Abd al-Rahman b.Sahlcame forward (to the Prophet). Muhayyasah began to speak. It was he who was at Khaibar. The Messenger of Allah (saws) then said to him: Let the eldest (speak), let the eldest (speak), meaning age. So Huwayyasah spoke, and after him Muhayyasah spoke. The Messenger of Allah (saws) then said: They should either pay the bloodwit for you friend or they should be prepared for war. So the Messenger of Allah (saws) wrote to them about it. They wrote (in reply): We swear by Allah, we have not killed him. The Messenger of Allah (saws) then said to Huwayyasah, Muhayyasah and 'Abd al-Rahman: Will you take an oath and thus have the claim to the blood of your friend ? They said: No. He (the Prophet) said: The Jews will then take an oath. They said: They are not Muslims. Then the Messenger of Allah (saws) himself paid the bloodwit. The Messenger of Allah (saws) then sent on one hundred she-camels and they were entered in their house.Sahlsaid: A red she-camel of them gave me a kick."
        },
        {
          "body": "It was\nnarrated from Abu Bakr bin ‘Abdullah bin Zubair from his\ngrandmother – he (the narrator) said:“I do not know if it was\nAsma’bintAbu Bakr or Su’dabint‘Awf’ – that the\nMessenger of Allah (saw)\nentered upon Duba’ahbint‘Abdul-Muttalib\nand said: “What is keeping\nyou, O my aunt, from performing Hajj?”\nShe said: “I am a sick woman,\nand I am afraid of being prevented\n(from completing Hajj).” He said:\n‘Enter Ihram and stipulate the\ncondition that you will exit Ihram from\nthe point where you are\nprevented.’”"
        },
        {
          "body": "Yahya related to me from Malik from Hisham ibn Urwa from his\nfather from ZaynabbintAbu Salama that she saw ZaynabbintJahsh, the\nwife of Abd ar-Rahman ibn Awf, and she used to bleed as if\nmenstruating. She would do ghusl and pray."
        },
        {
          "body": "Sahlb. Sa'd reported God’s messenger as saying, “Uhud is a mountain which loves us and which we love.” \n\nBukhari transmitted it."
        },
        {
          "body": "Sahlb. Sa'd said that the people received command that a man should place the right hand on the left forearm in prayer. \n\nBukhari transmitted it."
        },
        {
          "body": "A’ishah (RAA) narrated, ‘By Allah the Messenger of Allah (P.B.U.H.) offered funeral prayer in the mosque for the sons of Baida (Sahland Suhail).’ Related by Muslim"
        },
        {
          "body": "It was\nnarrated fromSahlbin Sa’d that the Messenger of Allah (saw)\nsaid:“A place the size of a whip in Paradise is better than this\nworld\nand everything in it.”"
        }
      ]
    }
  ]
}